/////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  .icaファイルのアニメーションデータを扱う関数群
 * @file   ica_data.h
 * @author obata
 * @date   2009.09.01
 *
 */
/////////////////////////////////////////////////////////////////////////////
#pragma once


//===========================================================================
// アニメーションデータの不完全型宣言
//===========================================================================
typedef struct _ICA_DATA ICA_DATA;


//===========================================================================
// 初期化・破棄関数
//===========================================================================

//---------------------------------------------------------------------------
/**
 * @brief アニメーションデータを作成する
 *
 * @param heap_id 使用するヒープID
 * @param arc_id  読み込むアーカイブファイル
 * @param dat_id  アーカイブファイル上のインデックスナンバー
 *
 * @return 作成したアニメーションデータ
 */
//---------------------------------------------------------------------------
ICA_DATA* ICA_DATA_Create( HEAPID heap_id, ARCID arc_id, ARCDATID dat_id );

//---------------------------------------------------------------------------
/**
 * @brief アニメーションデータを破棄する
 *
 * @param p_data 破棄するデータ
 */
//---------------------------------------------------------------------------
void ICA_DATA_Delete( ICA_DATA* p_data );


//===========================================================================
// アニメーションデータ取得関数
//===========================================================================

//---------------------------------------------------------------------------
/**
 * @brief 指定フレームにおける位置データを取得する
 *
 * @param p_anime   アニメーションデータ
 * @param p_vec     取得した座標の格納先
 * @param now_frame 現在のフレーム数
 */
//---------------------------------------------------------------------------
void ICA_DATA_GetPos( ICA_DATA* p_anime, VecFx32* p_vec, fx32 now_frame );

//---------------------------------------------------------------------------
/**
 * @brief 指定フレームにおける向きデータを取得する
 *
 * @param p_anime   アニメーションデータ
 * @param p_vec     取得したベクトルの格納先
 * @param now_frame 現在のフレーム数
 */
//---------------------------------------------------------------------------
void ICA_DATA_GetDir( ICA_DATA* p_anime, VecFx32* p_vec, fx32 now_frame );

//---------------------------------------------------------------------------
/**
 * @brief カメラ座標・ターゲット座標を指定フレームの状態に設定する
 *
 * @param p_anime   アニメーションデータ
 * @param p_camera  設定対象のカメラ
 * @param now_frame 現在のフレーム数
 */
//---------------------------------------------------------------------------
void ICA_DATA_SetCameraStatus( 
    ICA_DATA* p_anime, GFL_G3D_CAMERA* p_camera, fx32 now_frame );
