//============================================================================================
/**
 * @file	pm_version.c
 * @brief	バージョン定義ソース
 * @date	2005.12.01
 * @author	GAME FREAK Inc.
 *
 *
 * 2009.12.16   HGSSから移植
 */
//============================================================================================

/*
 * 今のところpm_version.hがプリコンパイルヘッダに含まれており、
 * プリコンパイルヘッダは全てのソースのコンパイルで対象に含まれるため
 * このソースはpm_version.hヘッダをインクルードしていない
 */

#include <gflib.h>

//マルチブート用きり分け
#ifndef MULTI_BOOT_MAKE  //通常時処理
#include "debug/debug_flg.h"
#endif //MULTI_BOOT_MAKE

#include "playable_version.h"
//============================================================================================
//
//	バージョンチェック
//
//============================================================================================

#ifndef	PM_VERSION
/* PM_VERSION未定義、問題あり!*/
#error	PM_VERSION UNDEFINED!!
#endif

#if (PM_VERSION == VERSION_WHITE || PM_VERSION == VERSION_BLACK )
/*WHITE or BLACK、問題なし */
#else
/* 未定義バージョン、問題あり！ */
#error!!
#endif

#ifndef	PM_LANG
/* PM_LANG未定義、問題あり!*/
#error	PM_LANG	UNDEFINED!!
#endif

#if (PM_LANG == LANG_JAPAN )
/* 日本語、問題なし */
#else
/* 未定義の言語、問題あり!　*/
#error!!
#endif

//============================================================================================
//
//	バージョン参照用データ
//
//============================================================================================

//---------------------------------------------------------------------------
/**
 * @brief	ポケモンのカートリッジバージョンを格納しているconst変数
 */
//---------------------------------------------------------------------------
#ifdef  PLAYABLE_VERSION
u8 CasetteVersion = 0;
#else
const u8 CasetteVersion = PM_VERSION;
#endif

//---------------------------------------------------------------------------
/**
 * @brief	使用言語の種類を保持するロムデータ
 */
//---------------------------------------------------------------------------
const u8 CasetteLanguage = PM_LANG;

//============================================================================================
//============================================================================================
//---------------------------------------------------------------------------
/**
 * @brief 
 */
//---------------------------------------------------------------------------
const u8 GetVersion( void )
{
#ifdef  PLAYABLE_VERSION
  GF_ASSERT( CasetteVersion != 0 );
#endif

#ifndef MULTI_BOOT_MAKE  //通常時処理
#ifdef  PM_DEBUG
  if (DEBUG_FLG_GetFlg( DEBUG_FLG_ReverseVersion ) == TRUE )
  {
    if (CasetteVersion == VERSION_BLACK)
    {
      return VERSION_WHITE;
    }
    else
    {
      return VERSION_BLACK;
    }
  }
#endif  //PM_DEBUG
#endif MULTI_BOOT_MAKE  //通常時処理

  return CasetteVersion;
}

#ifdef  PLAYABLE_VERSION
void SetVersion( u8 version )
{
  CasetteVersion = version;
}
#endif


//============================================================================================
//============================================================================================
//#include "d_date.h"		/* 日付文字列：ROM作成 */

