//=============================================================================================
/**
 * @file	global_msg.h
 * @brief	グローバルメッセージデータ宣言
 * @author	taya
 * @date	2008.11.19	作成
 *
 * @li	各所から何度も参照される文字列を最初に１度だけ開いて、以後共有する
 */
//=============================================================================================
#ifndef __GLOBAL_MSG_H__
#define __GLOBAL_MSG_H__

#include <heap.h>
#include <msgdata.h>

//--------------------------------------------------------------
/**
 *	グローバルメッセージデータ
 */
//--------------------------------------------------------------
extern const GFL_MSGDATA*	GlobalMsg_Poke;		///< ポケモン名



//=============================================================================================
/**
 * グローバルメッセージデータハンドラを生成（プログラム起動後に１度だけ呼ぶ）
 *
 * @param   heapID		生成用ヒープID
 */
//=============================================================================================
extern void GLOBALMSG_Init( HEAPID heapID );


#endif
