///////////////////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  BGMに関する情報の管理システム
 * @author obata_toshihiro
 * @date   2009.07.17
 *
 */
///////////////////////////////////////////////////////////////////////////////////////////
#pragma once

#include "gamesystem/gamedata_def.h"
#include "../../../resource/sound/bgm_info/iss_type.h"


//====================================================================================
/**
 *
 * @brief システムワーク構造体の不完全型宣言
 *
 */
//====================================================================================
typedef struct _BGM_INFO_SYS_WORK BGM_INFO_SYS;


//--------------------------------------------------------------
/**
 * @brief BGM_INFO_SYSへのポインタ取得
 * @param gamedata    GAMEDATAへのポインタ
 * @return BGM_INFO_SYS BGM情報取得システムへのポインタ
 *
 * @note
 * 実態はsrc/gamesystem/game_data.cにあるが、情報隠蔽を
 * 考慮してBGM_INFO_SYSを扱うヘッダに配置している
 */
//--------------------------------------------------------------
extern BGM_INFO_SYS * GAMEDATA_GetBGMInfoSys(GAMEDATA * gamedata);

//====================================================================================
/**
 *
 * @brief システム作成・破棄関数
 *
 */
//====================================================================================

//----------------------------------------------------------------------------
/**
 * @brief BGM情報管理システムを作成する
 *
 * @param heap_id ヒープID
 *
 * @return システムワークへのポインタ
 */
//----------------------------------------------------------------------------
BGM_INFO_SYS* BGM_INFO_CreateSystem( HEAPID heap_id );

//----------------------------------------------------------------------------
/**
 * @brief BGM情報管理システムを破棄する
 *
 * @param p_sys 破棄するシステム
 */
//----------------------------------------------------------------------------
void BGM_INFO_DeleteSystem( BGM_INFO_SYS* p_sys );


//====================================================================================
/**
 *
 * @brief データ取得関数
 *
 */
//====================================================================================

//----------------------------------------------------------------------------
/**
 * @brief 指定したBGMのISSタイプを取得する
 * 
 * @param p_sys   取得対象のシステム
 * @param seq_idx BGMのシーケンス・インデックス( SEQ_XXXX )
 *
 * @return 指定BGMのISSタイプ( 街ISS, 道路ISS など )
 */
//----------------------------------------------------------------------------
u8 BGM_INFO_GetIssType( BGM_INFO_SYS* p_sys, u16 seq_idx );
