//==============================================================================
/**
 * @file    gds_test.h
 * @brief   GDSテスト
 * @author  matsuda
 * @date    2010.03.22(月)
 */
//==============================================================================
#pragma once


#ifdef PM_DEBUG

//==============================================================================
//  外部関数宣言
//==============================================================================
extern const GFL_PROC_DATA GdsTestProcData;
extern const GFL_PROC_DATA GdsTestMusicalAllProcData;

#endif  //PM_DEBUG
