//==============================================================================
/**
 * @file    gds_test.h
 * @brief   GDSテスト
 * @author  matsuda
 * @date    2010.03.22(月)
 */
//==============================================================================
#pragma once


#ifdef PM_DEBUG

//==============================================================================
//  構造体定義
//==============================================================================
typedef struct{
  GAMEDATA *gamedata;
	DWCSvlResult *pSvl;   ///<Wi-Fi Login画面で使用したSVL
}GDS_TEST_PARENT;

//==============================================================================
//  外部関数宣言
//==============================================================================
extern const GFL_PROC_DATA GdsTestProcData;
extern const GFL_PROC_DATA GdsTestMusicalAllProcData;

#endif  //PM_DEBUG
