//============================================================================================
/**
 * @file		box2_snd_def.h
 * @brief		ボックス画面サウンドナンバー定義
 * @author	Hiroyuki Nakamura
 * @date		09.10.05
 */
//============================================================================================
#pragma	once

//--------------------------------------------------------------------------------------------
//		
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_LOG_IN				( SEQ_SE_SELECT1 )		// ボックス画面開始
#define  SE_BOX2_LOG_OFF			( SEQ_SE_SELECT1 )		// ボックス画面終了

//--------------------------------------------------------------------------------------------
//	ポケモンいどう
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_POKE_CATCH		( SEQ_SE_SELECT1 )		// ポケモンつかむ
#define  SE_BOX2_POKE_PUT			( SEQ_SE_SELECT1 )		// ポケモンおく

//--------------------------------------------------------------------------------------------
//	てもちポケモン
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_OPEN_PARTY_TRAY		( SEQ_SE_SELECT1 )		// 手持ちウィンドウを開く
#define  SE_BOX2_CLOSE_PARTY_TRAY		( SEQ_SE_SELECT1 )		// 手持ちウィンドウを閉じる

//--------------------------------------------------------------------------------------------
//	操作
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_MOVE_CURSOR			( SEQ_SE_SELECT1 )		// カーソル移動
#define  SE_BOX2_DECIDE						( SEQ_SE_SELECT1 )		// 決定音
#define  SE_BOX2_CANCEL						( SEQ_SE_SELECT1 )		// キャンセル音
#define  SE_BOX2_CHANGE_TRAY			( SEQ_SE_SELECT1 )		// トレイ切り替え

#define  SE_BOX2_WARNING					( SEQ_SE_SELECT1 )		// 警告音(最後の1匹を逃がそうとした時)
#define  SE_BOX2_DISABLE_BUTTON		( SEQ_SE_SELECT1 )		// 押せないボタンを押したとき

#define  SE_BOX2_ITEM_WITHDRAW		( SEQ_SE_SELECT1 )		// アイテムあずかる
#define  SE_BOX2_ITEM_SET					( SEQ_SE_SELECT1 )		// アイテムもたせる
#define  SE_BOX2_ITEM_SWAP				( SEQ_SE_SELECT1 )		// アイテムとりかえる








#if 0
//--------------------------------------------------------------------------------------------
//		
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_LOG_IN				(SEQ_SE_DP_PC_LOGIN)	//ボックス画面開始
#define  SE_BOX2_LOG_OFF			(SEQ_SE_DP_PC_LOGOFF)	//ボックス画面終了


//--------------------------------------------------------------------------------------------
//	ポケモンいどう
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_POKE_CATCH			(SEQ_SE_DP_BOX02)		//ポケモンつかむ
#define  SE_BOX2_POKE_PUT			(SEQ_SE_DP_BOX01)		//ポケモンおく


//--------------------------------------------------------------------------------------------
//	てもちポケモン
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_OPEN_PARTY_TRAY	(SEQ_SE_DP_OPEN7)		//手持ちウィンドウを開く
#define  SE_BOX2_CLOSE_PARTY_TRAY	(SEQ_SE_DP_CLOSE7)		//手持ちウィンドウを閉じる


//--------------------------------------------------------------------------------------------
//	操作
//--------------------------------------------------------------------------------------------
#define  SE_BOX2_MOVE_CURSOR		(SEQ_SE_DP_SELECT)		//カーソル移動
#define  SE_BOX2_DECIDE				(SEQ_SE_DP_DECIDE)		//決定音
#define  SE_BOX2_CANCEL				(SEQ_SE_DP_SELECT)		//キャンセル音
#define  SE_BOX2_CHANGE_TRAY		(SEQ_SE_DP_SELECT)		//トレイ切り替え

#define  SE_BOX2_WARNING			(SEQ_SE_DP_BOX03)		//警告音(最後の1匹を逃がそうとした時)
#define  SE_BOX2_DISABLE_BUTTON		(SEQ_SE_DP_BOX03)		//押せないボタンを押したとき

#define  SE_BOX2_ITEM_WITHDRAW		(SE_BOX2_DECIDE)		//アイテムあずかる
#define  SE_BOX2_ITEM_SET			(SE_BOX2_DECIDE)		//アイテムもたせる
#define  SE_BOX2_ITEM_SWAP			(SE_BOX2_DECIDE)		//アイテムとりかえる

#endif


