/////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  調査レーダー 初期画面 ( メニュー画面 )
 * @file   research_menu.c
 * @author obata
 * @date   2010.02.03
 */
///////////////////////////////////////////////////////////////////////////////// 
#include <gflib.h>
#include "research_menu.h"


//===============================================================================
// ■定数
//===============================================================================
// 処理シーケンス
typedef enum{
  RESEARCH_MENU_SEQ_SETUP,    // 準備
  RESEARCH_MENU_SEQ_CLEAN_UP, // 後片付け
  RESEARCH_MENU_SEQ_FINISH,   // 終了
} RESEARCH_MENU_SEQ;


//=============================================================================== 
// ■調査初期画面 ワーク
//=============================================================================== 
struct _RESEARCH_MENU_WORK
{
  HEAPID heapID;
  RESEARCH_MENU_SEQ seq;  // 処理シーケンス
};


//=============================================================================== 
// □調査初期画面 制御関数
//=============================================================================== 

//-------------------------------------------------------------------------------
/**
 * @brief 調査初期画面ワークの生成
 *
 * @param heapID
 */
//-------------------------------------------------------------------------------
RESEARCH_MENU_WORK* CreateResearchMenuWork( HEAPID heapID )
{
  RESEARCH_MENU_WORK* work;

  work         = GFL_HEAP_AllocMemory( heapID, sizeof(RESEARCH_MENU_WORK) );
  work->heapID = heapID;
  work->seq    = RESEARCH_MENU_SEQ_SETUP;
  return work;
}

//-------------------------------------------------------------------------------
/**
 * @brief 調査初期画面ワークの破棄
 *
 * @param heapID
 */
//-------------------------------------------------------------------------------
void DeleteResearchMenuWork( RESEARCH_MENU_WORK* work )
{
  if( work == NULL )
  {
    GF_ASSERT(0);
    return;
  } 
  GFL_HEAP_FreeMemory( work );
} 

//-------------------------------------------------------------------------------
/**
 * @brief 調査初期画面 メイン関数
 *
 * @param work
 */
//-------------------------------------------------------------------------------
RESEARCH_MENU_RESULT ResearchMenuMain( RESEARCH_MENU_WORK* work )
{
  return RESEARCH_MENU_RESULT_EXIT;
}
