//////////////////////////////////////////////////////////////////////////////
/**
 * @brief  調査データ
 * @file   research_data.h
 * @author obata
 * @date   2010.02.22
 */
//////////////////////////////////////////////////////////////////////////////
#pragma once
#include <gflib.h>


//============================================================================
// ■定数
//============================================================================
#define MAX_ANSWER_NUM_PER_QUESTION (17) // 質問あたりの回答選択肢の最大数
#define QUESTION_NUM_PER_TOPIC      (3)  // 調査項目あたりの質問数


//============================================================================
// ■回答データ
//============================================================================
typedef struct
{
  u16 ID;         // 回答ID
  u8  colorR;     // 表示カラー(R) [0, 31]
  u8  colorG;     // 表示カラー(G) [0, 31]
  u8  colorB;     // 表示カラー(B) [0, 31]
  u16 todayCount; // 今日の回答人数
  u16 totalCount; // いままでの回答人数

} ANSWER_DATA;


//============================================================================
// ■質問データ
//============================================================================
typedef struct
{
  u8  ID;         // 質問ID 
  u8  answerNum;  // 回答の数
  u16 todayCount; // 今日の回答人数
  u16 totalCount; // いままでの回答人数
  ANSWER_DATA answerData[ MAX_ANSWER_NUM_PER_QUESTION ]; // 回答データ

} QUESTION_DATA;


//============================================================================
// ■調査データ
//============================================================================
typedef struct 
{
  u8 topicID; // 調査項目ID
  QUESTION_DATA questionData[ QUESTION_NUM_PER_TOPIC ]; // 質問データ

} RESEARCH_DATA; 
