/////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  調査レーダー テスト画面
 * @file   research_test.h
 * @author obata
 * @date   2010.02.03
 */
///////////////////////////////////////////////////////////////////////////////// 
#pragma once
#include <gflib.h>


//===============================================================================
// ■定数
//=============================================================================== 
// メイン関数 戻り値
typedef enum {
  RESEARCH_TEST_RESULT_CONTINUE,  // テスト画面継続
  RESEARCH_TEST_RESULT_END,       // テスト画面終了
} RESEARCH_TEST_RESULT;


//=============================================================================== 
// ■テスト画面 ワーク
//=============================================================================== 
typedef struct _RESEARCH_TEST_WORK RESEARCH_TEST_WORK;


//=============================================================================== 
// ■テスト画面 制御関数
//=============================================================================== 
// ワーク生成/破棄
RESEARCH_TEST_WORK* CreateResearchTestWork( HEAPID heapID );
void                DeleteResearchTestWork( RESEARCH_TEST_WORK* work );

// メイン関数
RESEARCH_TEST_RESULT ResearchTestMain( RESEARCH_TEST_WORK* work ); 
