//==============================================================================
/**
 * @file	easy_pokelist.h
 * @brief	簡易ポケモンリスト
 * @author	matsuda
 * @date	2008.12.05(金)
 */
//==============================================================================
#ifndef __EASY_POKELIST_H__
#define __EASY_POKELIST_H__

#include "gamesystem/game_data.h"


//==============================================================================
//	定数定義
//==============================================================================
FS_EXTERN_OVERLAY(pokelist);


//==============================================================================
//	構造体定義
//==============================================================================
///簡易ポケモンリスト呼び出し時に引き渡す構造体
typedef struct{
	POKEPARTY *party;		///<手持ちポケモンへのポインタ
	
	//ポケモンリストからの戻り値
	s32 select_pos;			///<最後に選択した場所(-1はキャンセルで戻った時)
}EASY_POKELIST_PARENT;


//==============================================================================
//	外部データ
//==============================================================================
extern const GFL_PROC_DATA EasyPokeListData;


#endif	//__EASY_POKELIST_H__
