//============================================================================================
/**
 * @file	skel_net_gra.c
 * @brief	通信アイコンデータ部分の定義
 * @author	ohno
 * @date	2007.05.29
 */
//============================================================================================


#ifndef __NET_ICONDATA__
#define __NET_ICONDATA__

//==============================================================================
/**
 * @brief    通信アイコングラフィックテーブルポインタを得る
 * @param    none
 * @return   グラフィックテーブルポインタ
 */
//==============================================================================

extern const char** NET_ICONDATA_GetTableData(void);

//==============================================================================
/**
 * @brief    通信アイコンWIFIグラフィックNOを得る
 * @param    none
 * @return   通信アイコンWIFIグラフィックNO
 */
//==============================================================================

extern void NET_ICONDATA_GetNoBuff(int* pNoBuff);


#endif //__NET_ICONDATA__
