//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		beacon_detail_gra.h
 *	@brief	すれ違い詳細画面グラフィック設定
 *	@author Miyuki Iwasawa	
 *	@date		2010.02.01
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include <gflib.h>
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	グラフィックワーク
//=====================================
typedef struct _BEACON_DETAIL_GRAPHIC_WORK  BEACON_DETAIL_GRAPHIC_WORK;

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
///初期化
//	ディスプレイセレクトにはGX_DISP_SELECT_MAIN_SUB or GX_DISP_SELECT_SUB_MAINを
//	渡してください。途中で書き換えたい場合、GFL_DISP_SetDispSelectを使用して下さい。
//=====================================
extern BEACON_DETAIL_GRAPHIC_WORK * BEACON_DETAIL_GRAPHIC_Init( int display_select, HEAPID heapID );
//-------------------------------------
///破棄
//=====================================
extern void BEACON_DETAIL_GRAPHIC_Exit( BEACON_DETAIL_GRAPHIC_WORK *p_wk );
//-------------------------------------
///２D描画
//=====================================
extern void BEACON_DETAIL_GRAPHIC_2D_Draw( BEACON_DETAIL_GRAPHIC_WORK *p_wk );

//-------------------------------------
///情報取得	内部で設定したCLUNITを返します	OBJ使わない場合NULL
//=====================================
extern GFL_CLUNIT * BEACON_DETAIL_GRAPHIC_GetClunit( const BEACON_DETAIL_GRAPHIC_WORK *cp_wk );

