//======================================================================
/**
 * @file	ctvt_beacon.c
 * @brief	通信トランシーバー：ビーコン
 * @author	ariizumi
 * @data	09/12/22
 *
 * モジュール名：CTVT_BCON
 */
//======================================================================
#include "buflen.h"

//======================================================================
//	define
//======================================================================
#pragma mark [> define
#define CTVT_COMM_NAME_LEN (SAVELEN_PLAYER_NAME+EOM_SIZE)

//======================================================================
//	enum
//======================================================================
#pragma mark [> enum


//======================================================================
//	typedef struct
//======================================================================
#pragma mark [> struct
//ビーコンデータ
typedef struct
{
  STRCODE name[CTVT_COMM_NAME_LEN];
  u16     id;
  u8      connectNum;
  u8      pad;
  //呼び出しターゲット
  u8      callTarget[3][6];
}CTVT_COMM_BEACON;

//======================================================================
//	proto
//======================================================================
#pragma mark [> proto

//自身が呼ばれているかチェック
const BOOL CTVT_BCON_CheckCallSelf( CTVT_COMM_BEACON *beacon , u8* selfMacAdr );
