//============================================================================
/**
 *  @file   yesno_menu.h
 *  @brief  下画面を使っての二択メニュー
 *  @author Koji Kawada
 *  @data   2010.01.14
 *  @note   
 *
 *  モジュール名：YESNO_MENU
 */
//============================================================================
#pragma once

// lib
#include <gflib.h>

// system
#include "gamesystem/gamesystem.h"

//=============================================================================
/**
 *  定数定義
 */
//=============================================================================
//-------------------------------------
/// 選択結果
//=====================================
typedef enum
{
  YESNO_MENU_SEL_NO,    // NOを選んだ
  YESNO_MENU_SEL_YES,   // YESを選んだ
  YESNO_MENU_SEL_SEL,   // 選択中
}
YESNO_MENU_SEL;

//=============================================================================
/**
*  構造体宣言
*/
//=============================================================================
//-------------------------------------
/// ワーク
//=====================================
typedef struct _YESNO_MENU_WORK YESNO_MENU_WORK;

//=============================================================================
/**
 *  関数宣言
 */
//=============================================================================
//-------------------------------------
/// リソース読み込み
//=====================================
extern YESNO_MENU_WORK* YESNO_MENU_CreateRes(
                          HEAPID         heap_id,
                          u8             bg_frame,           // bg_frameとbg_frame+1の2個を使用する
                          u8             bg_frame_prio,      // bg_frame_prioとbg_frame_prio+1に設定する
                          u8             bg_pal,             // bg_palからbg_pal+2の3本を使用する
                          u8             obj_pal,            // obj_palとobj_pal+1の2本を使用する
                          GFL_CLUNIT*    clunit,
                          GFL_FONT*      font,
                          PRINT_QUE*     print_que,
                          BOOL           key );              // キー操作のときTRUE


//-------------------------------------
/// リソース破棄
//=====================================
extern void YESNO_MENU_DeleteRes( YESNO_MENU_WORK* work );

//-------------------------------------
/// 開く
//=====================================
extern void YESNO_MENU_OpenMenu( YESNO_MENU_WORK* work, STRBUF* yes, STRBUF* no );

//-------------------------------------
/// 閉じる
//=====================================
extern void YESNO_MENU_CloseMenu( YESNO_MENU_WORK* work );

//-------------------------------------
/// 主処理
//=====================================
extern void YESNO_MENU_Main( YESNO_MENU_WORK* work );

//-------------------------------------
/// 選択結果を得る
//=====================================
extern YESNO_MENU_SEL YESNO_MENU_GetSelect( YESNO_MENU_WORK* work );

//-------------------------------------
/// キー操作で選択したか
//=====================================
extern BOOL YESNO_MENU_IsKey( YESNO_MENU_WORK* work );  // キー操作で選択したときTRUEを返す

