//=============================================================================================
/**
 * @file	gfl_use.c
 * @date	2006.12.06
 * @author	GAME FREAK inc.
 * @brief	ユーザーのGFライブラリ使用のためのスケルトンソース
 *
 */
//=============================================================================================

#include <nitro.h>
#include "gflib.h"
//#include "gflib_inter.h"

#include "main.h"

#include "gfl_use.h"
#include "ui.h"
#include "procsys.h"

//=============================================================================================
//=============================================================================================
//------------------------------------------------------------------
//------------------------------------------------------------------
static const HEAP_INIT_HEADER hih[]={
	{ HEAPSIZE_SYSTEM,	OS_ARENA_MAIN },
	{ HEAPSIZE_APP,		OS_ARENA_MAIN },
};

//=============================================================================================
//
//			関数
//
//=============================================================================================
//------------------------------------------------------------------
/**
 * @brief	GFライブラリ利用部分：初期化
 *
 * InitSystemの内部で呼んでいるInitFileSystemはgflibの外では
 * 呼べないため、InitSystemを呼んでいる。
 */
//------------------------------------------------------------------
void GFLUser_Init(void)
{
	InitSystem();
#if 0
#ifdef USE_MAINEXMEMORY
  OS_EnableMainExArena();
#endif

  // システム初期化
  OS_Init();
  OS_InitTick();
  OS_InitAlarm();
  // RTC初期化
  RTC_Init();
  // GX初期化
  GX_Init();
  // 固定小数点API初期化
  FX_Init();
  // ファイルシステム初期化
  InitFileSystem();
#endif

  //ヒープシステム初期化
  GFL_HEAP_sysInit(&hih[0],HEAPID_BASE_MAX,4,0);

  //アーカイブシステム初期化
  //GFL_ARC_SysInit(...);

  //UIシステム初期化
  GFL_UI_sysInit(HEAPID_BASE_SYSTEM);

  //PROCシステム初期化
  GFL_PROC_SysInit(HEAPID_BASE_SYSTEM);

}


//------------------------------------------------------------------
/**
 * @brief	GFライブラリ利用部分：メイン呼び出し
 */
//------------------------------------------------------------------
void GFLUser_Main(void)
{
	GFL_UI_sysMain();
	
	GFL_PROC_SysMain();
}


//------------------------------------------------------------------
/**
 * @brief	GFライブラリ利用部分：終了処理
 */
//------------------------------------------------------------------
void GFLUser_Exit(void)
{
	GFL_UI_sysEnd();
	GFL_PROC_SysExit();
	GFL_HEAP_sysExit();
}


//------------------------------------------------------------------
/**
 * @brief	GFライブラリ利用部分：VBlank割り込み処理
 */
//------------------------------------------------------------------
void GFLUser_VIntr(void)
{
}


