//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		townmap_util.h
 *	@brief  タウンマップ処理共通ルーチン
 *	@author	Toru=Nagihashi
 *	@date		2010.02.06
 *	@note   タウンマップで行っている主人公の位置サーチなどを
 *	        他の場所でも使うので外部化
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
//lib
#include <gflib.h>
#include "app/townmap_util.h"
#include "field/zonedata.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  タウンマップで使用するため、そのゾーンIDがフィールド上の
 *	        どこのゾーンIDなのか、どこからきたゾーンIDなのか返す。
 *	        （例えば、ZONEID_C01GYM0101はC01のジムなので
 *	        ZONEID_C01が返ってきます）
 *
 *	@param	const GAMEDATA *cp_gamedata ゲームデータ  (エスケープロケーション取得用)
 *	@param  now_zoneID
 *
 *	@return 元になるZONEID
 */
//-----------------------------------------------------------------------------
u16 TOWNMAP_UTIL_GetRootZoneID( const GAMEDATA* cp_gamedata, u16 now_zoneID )
{
  PLAYER_WORK *p_player;
#ifdef DEBUG_ONLY_FOR_toru_nagihashi
#warning( TODO:add zoneID check!! )
#endif //DEBUG_ONLY_FOR_toru_nagihashi

  if( ZONEDATA_IsFieldMatrixID( now_zoneID ) )
  { 
    //フィールドにいる状態
    return now_zoneID;
  }
  else
  { 
    //フィールド以外にいる状態
    return GAMEDATA_GetEscapeLocation( cp_gamedata )->zone_id;
  }
}
