//=============================================================================================
/**
 * @file	sound.c
 * @brief	サウンドルーチン
 * @author	Hisashi Sogabe
 * @date	2007/04/17
 */
//=============================================================================================
#include "gflib.h"

//=============================================================================================
//	型宣言
//=============================================================================================

//=============================================================================================
//	定数宣言
//=============================================================================================
#define	SOUND_HEAP_SIZE		(0x40000)
#define	STOP_FADE_FRAME		(1)				//GFL_SOUND_StopBgmでの曲がとまるまでのFADE_WAIT
#define	SOUND_SEQARC_NOLOAD	(0xffffffff)

//=============================================================================================
//	ワーク
//=============================================================================================
static	NNSSndArc			arc;
static	u8					sndHeap[SOUND_HEAP_SIZE];
static	NNSSndHeapHandle	heap;
static	NNSSndHandle		bgmHandle;
static	NNSSndHandle		seHandle;
static	int					GFL_SOUND_seqarc_no=SOUND_SEQARC_NOLOAD;

//=============================================================================================
//=============================================================================================
//	設定関数
//=============================================================================================
//=============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * サウンド初期化
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_Init( void )
{
	NNS_SndInit();
	heap=NNS_SndHeapCreate(&sndHeap,sizeof(sndHeap));
	NNS_SndHandleInit(&bgmHandle);
	NNS_SndHandleInit(&seHandle);
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドメイン処理
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_Main( void )
{
	NNS_SndMain();
}

//--------------------------------------------------------------------------------------------
/**
 * サウンド終了（呼ばれることはないだろうが、一応作成）
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_Exit( void )
{
	NNS_SndHeapDestroy( heap );
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータロード（アーカイブデータ）
 *
 * @param[in]	arcID		読み込むアーカイブファイルの種類インデックスナンバー
 * @param[in]	datID		読み込むデータのアーカイブファイル上のインデックスナンバー
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_LoadArchiveData( int arcID, int datID )
{
	BOOL	result;

	GFL_ARC_OpenFileTopPosWrite(arcID,datID,&arc.file);

    arc.file_open = TRUE;
    
    /* セットアップ */
    result = NNS_SndArcSetup( &arc, heap, FALSE );

    GF_ASSERT( result );
    if ( ! result ) return;

	NNS_SndArcSetCurrent(&arc);

	NNS_SndArcPlayerSetup(heap);
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータロード（シーケンスデータ）
 *
 * @param	seq_no	シーケンスデータナンバー
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_LoadSequenceData( int seq_no )
{
	NNS_SndArcLoadSeq(seq_no,heap);
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータロード（シーケンスアーカイブデータ）
 *
 * @param	seqarc_no	シーケンスアーカイブデータナンバー
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_LoadSequenceArchiveData( int seqarc_no )
{
	NNS_SndArcLoadSeqArc(seqarc_no,heap);
	GFL_SOUND_seqarc_no=seqarc_no;
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータロード（バンクデータ）
 *
 * @param	bank_no	バンクデータナンバー
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_LoadBankData( int bank_no )
{
	NNS_SndArcLoadBank(bank_no,heap);
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータロード（グループデータ）
 *
 * @param	group_no	グループデータナンバー
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_LoadGroupData( int group_no )
{
    const NNSSndArcGroupInfo* info;
    const NNSSndArcGroupItem* item;
    int itemNo;

	NNS_SndArcLoadGroup(group_no,heap);
    info = NNS_SndArcGetGroupInfo( group_no );

    GF_ASSERT ( info!=NULL );
    
    for( itemNo = 0; itemNo < info->count ; itemNo++ )
    {
        item = & info->item[ itemNo ];
        
        switch( item->type ) {
        case NNS_SNDARC_SNDTYPE_SEQARC:
			GFL_SOUND_seqarc_no=item->index;
            break;
        default:
            GF_ASSERT(1);
            break;
        }
    }
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータ再生（BGM）
 *
 * @param	bgm_no	BGMナンバー
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_PlayBGM( int bgm_no )
{
	NNS_SndArcPlayerStartSeq(&bgmHandle,bgm_no);
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータStop（BGM）
 *
 * 今鳴っているBGMを止める
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_StopBGM( void )
{
	NNS_SndPlayerStopSeq(&bgmHandle,STOP_FADE_FRAME);
}

//--------------------------------------------------------------------------------------------
/**
 * サウンドデータ再生（BGM）
 *
 * @param	bgm_no	BGMナンバー
 */
//--------------------------------------------------------------------------------------------
void	GFL_SOUND_PlaySE( int se_no )
{
	GF_ASSERT(GFL_SOUND_seqarc_no!=SOUND_SEQARC_NOLOAD);
	NNS_SndArcPlayerStartSeqArc(&seHandle,GFL_SOUND_seqarc_no,se_no);
}

