//////////////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  電光掲示板のゾーン依存データ
 * @file   elboard_zone_data.h
 * @author obata
 * @date   2009.10.27
 *
 */
//////////////////////////////////////////////////////////////////////////////////////


//====================================================================================
// ■電光掲示板データ構造体
//====================================================================================
typedef struct
{
  u32 zone_id;        // ゾーンID
  u32 x;              // x座標
  u32 y;              // y座標
  u32 z;              // z座標
  u32 dir;            // 向き
  u32 arcDatID;       // アーカイブ内インデックス(アーカイブIDは ARCID_MESSAGE で固定)
  u32 msgID_date;     // 日付に使用するメッセージID
  u32 msgID_weather;  // 天気に使用するメッセージID
  u32 msgID_infoA;    // 地域情報(A)に使用するメッセージID
  u32 msgID_infoB;    // 地域情報(B)に使用するメッセージID
  u32 msgID_infoC;    // 地域情報(C)に使用するメッセージID
  u32 msgID_infoD;    // 地域情報(C)に使用するメッセージID
  u32 msgID_infoE;    // 地域情報(E)に使用するメッセージID
  u32 msgID_infoF;    // 地域情報(F)に使用するメッセージID
  u32 msgID_infoG;    // 地域情報(G)に使用するメッセージID
  u32 msgID_infoH;    // 地域情報(H)に使用するメッセージID
  u32 msgID_infoI;    // 地域情報(I)に使用するメッセージID
  u32 msgID_cmMon;    // 一言CM(月)に使用するメッセージID
  u32 msgID_cmTue;    // 一言CM(火)に使用するメッセージID
  u32 msgID_cmWed;    // 一言CM(水)に使用するメッセージID
  u32 msgID_cmThu;    // 一言CM(木)に使用するメッセージID
  u32 msgID_cmFri;    // 一言CM(金)に使用するメッセージID
  u32 msgID_cmSat;    // 一言CM(土)に使用するメッセージID
  u32 msgID_cmSun;    // 一言CM(日)に使用するメッセージID

} ELBOARD_ZONE_DATA;


//====================================================================================
// ■データ取得関数
//====================================================================================

//-----------------------------------------------------------------------------------
/**
 * @brief 電光掲示板ゾーン依存データを読み込む
 * 
 * @param buf    読み込んだデータの格納先
 * @param arc_id 読み込むデータのアーカイブID
 * @param dat_id 読み込むデータのアーカイブ内インデックス
 *
 * @return 読み込みが正しく行われた場合 TRUE
 */
//-----------------------------------------------------------------------------------
BOOL ELBOARD_ZONE_DATA_Load( ELBOARD_ZONE_DATA* buf, ARCID arc_id, ARCDATID dat_id );
