//==============================================================================
/**
 * @file    event_comm_sleep.h
 * @brief   ミッション：スリープしているターゲットに話しかけた
 * @author  matsuda
 * @date    2010.05.19(水)
 */
//==============================================================================
#pragma once


//==============================================================================
//  外部関数宣言
//==============================================================================
extern void EVENTCHANGE_CommMissionSleep_MtoT_Talk(GMEVENT *event, const COMMTALK_COMMON_EVENT_WORK *ccew);
