//==============================================================================
/**
 * @file    event_mission_help_after.h
 * @brief   ミッション：助けろ：戦闘後に起動する独自イベント
 * @author  matsuda
 * @date    2010.02.23(火)
 *
 * 侵入関連の余計なものをincludeしなくていいように個別にヘッダーを作成
 */
//==============================================================================
#pragma once


//==============================================================================
//  外部関数宣言
//==============================================================================
extern GMEVENT* EVENT_Intrude_BattleHelpAfterEvent( GAMESYS_WORK* gsys, HEAPID heap_id );
