//==============================================================================
/**
 * @file    event_subscreen.h
 * @brief   サブスクリーン切り替えイベントのヘッダ
 * @author  matsuda
 * @date    2009.12.14(月)
 */
//==============================================================================
#pragma once


//==============================================================================
//  外部関数宣言
//==============================================================================
extern GMEVENT * EVENT_ChangeSubScreen(
  GAMESYS_WORK *gsys, FIELDMAP_WORK *fieldWork, FIELD_SUBSCREEN_MODE change_mode);

