//======================================================================
/**
 * @file	evwkdef.c
 * @brief	フラグ、ワーク領域定義
 * @author	Satoshi Nohara
 * @date	2005.11.07
 *
 * 2007.06.04	プラチナ用にオフセットを変更
 */
//======================================================================
#ifndef __EVWKDEF_H__
#define __EVWKDEF_H__

#include "../../../resource/fldmapdata/flagwork/flag_define.h"
#include "../../../resource/fldmapdata/flagwork/work_define.h"

//======================================================================
//  フラグ定義関連
//======================================================================
enum {
  //  トレーナーフラグ開始ナンバー
  TR_FLAG_START       = TR_FLAG_AREA_START,

  //  隠しアイテムフラグ開始ナンバー
  FH_FLAG_START       = FLAG_HIDEITEM_AREA_START,

  //  システムフラグ開始ナンバー
  SYSFLAG_START       = SYS_FLAG_AREA_START,

  //  時間経過フラグ開始ナンバー
  TIMEFLAG_START      = TMFLG_AREA_START,

  //  全セーブフラグ占有ワークサイズ
  EVENT_FLAG_AREA_MAX =  (FLAGS_TOTAL_MAX / 8),


  //--------------------------------------------------------------
  //  フラグオフセット
  //--------------------------------------------------------------
  //セーブフラグスタート　オフセット
  SVFLG_START			    = 0x0000,

  //制御フラグスタート　オフセット
  SCFLG_START			    = 0x4000,

  //--------------------------------------------------------------
  //  セーブしないフラグ関連定義 制御フラグ
  //--------------------------------------------------------------
  //制御フラグ最大数
  CTRLFLAG_MAX		    = 64,
  CTRLFLAG_AREA_MAX   = (CTRLFLAG_MAX / 8),

};


//======================================================================
//  ワーク関連定義
//======================================================================
enum {
  EVENT_WORK_AREA_MAX = WORKS_TOTAL_MAX - WORKS_TOTAL_MIN,

  //セーブワーク定義スタート　オフセット
  SVWK_START			    = 0x4000,

  //データ交換・汎用ワーク定義スタート　オフセット
  SCWK_START			    = 0x8000,
};

//#if !(SVWK_START == WORKS_TOTAL_MIN)
//#error  セーブワーク定義スタート　オフセットの不一致！
//#endif


#if 0
//----------------------------------------------------------------
//
//	エメラルド
//
//----------------------------------------------------------------
//フラグ数 = 2400
//ぎりぎりまで使用していた

//トレーナーフラグ数 = 864
//854使用していた

//ワーク数 = 256
//多少余裕ある感じ？だった
#endif

#if 0
//----------------------------------------------------------------
//
//	ダイヤ・パール
//
//----------------------------------------------------------------
トレーナーフラグ
開始	1360
最大数	1040
2400 - 1360 = 1040

ローカルフラグ
0-63

未使用
63-99

イベントフラグ
100-399

バニッシュフラグ
400-729

隠しアイテムフラグ
730-985(255)

フィールド上のアイテム
986-1241

未使用
1242-1359
#endif

#endif //__EVWKDEF_H__
