//============================================================================================
/**
 * @file      event_pdc_return.h
 * @brief     ポケモンドリームキャッチからフィールドへの復帰管理
 * @author    Koji Kawada
 * @date      2010.03.23
 */
//============================================================================================
#pragma once

#include "gamesystem\game_data.h"
#include "app\pdc.h"

/*--------------------------------------------------------------------------*/
/* Proc Param                                                               */
/*--------------------------------------------------------------------------*/
typedef struct {

  GAMEDATA*             gameData;
  PDC_SETUP_PARAM*      pdcResult;

}PDCRET_PARAM;

/*--------------------------------------------------------------------------*/
/* Proc Table                                                               */
/*--------------------------------------------------------------------------*/
extern const GFL_PROC_DATA   PdcRet_ProcData;

// オーバーレイモジュール宣言
FS_EXTERN_OVERLAY(pdc_return);

