//==============================================================================
/**
 * @file    event_mission_secretitem_ex.h
 * @brief   ミッション：道具を隠せ：目的地に着いた時に起動するイベント
 * @author  matsuda
 * @date    2010.02.23(火)
 *
 * 侵入関連の余計なものをincludeしなくていいように個別にヘッダーを作成
 */
//==============================================================================
#pragma once


//==============================================================================
//  外部関数宣言
//==============================================================================
extern GMEVENT* EVENT_Intrude_SecretItemArrivalEvent(GAMESYS_WORK *gsys, INTRUDE_COMM_SYS_PTR intcomm, const MISSION_DATA *mdata );
