#pragma once
///////////////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief 名前入力イベント
 * @file  event_name_input.h
 * @author obata
 * @date   2009.10.20
 *
 */
///////////////////////////////////////////////////////////////////////////////////////


//-------------------------------------------------------------------------------------
/**
 * @brief 手持ちポケモン名入力画面呼び出しイベント
 * 
 * @param gsys        ゲームシステム
 * @param ret_wk      入力結果を受け取るワーク(TRUE:確定, FALSE:キャンセル)
 * @param party_index 名前を入力するポケモンのパーティー内インデックス
 *
 * @return イベント
 */
//-------------------------------------------------------------------------------------
GMEVENT* EVENT_NameInput_PartyPoke( GAMESYS_WORK* gsys, u16* ret_wk, u16 party_index );
