//============================================================================================
/**
 * @file  event_battle_return.h
 * @brief バトルからフィールドへの復帰管理
 * @author  taya
 * @date  2009.10.23
 */
//============================================================================================
#pragma once

#include "gamesystem\game_data.h"
#include "battle\battle.h"

/*--------------------------------------------------------------------------*/
/* Proc Param                                                               */
/*--------------------------------------------------------------------------*/
typedef struct {

  GAMEDATA*             gameData;
  BATTLE_SETUP_PARAM*   btlResult;

}BTLRET_PARAM;

/*--------------------------------------------------------------------------*/
/* Proc Table                                                               */
/*--------------------------------------------------------------------------*/
extern const GFL_PROC_DATA   BtlRet_ProcData;

// オーバーレイモジュール宣言
FS_EXTERN_OVERLAY(battle_return);

