//////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  移動床による強制移動イベント
 * @file   event_autoway.h
 * @author obata
 * @date   2009.11.27
 */
//////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma once


//----------------------------------------------------------------------------------------------------
/**
 * @brief 移動床イベントを作成する
 *
 * @param parent   親となるイベント
 * @param gsys     ゲームシステム
 * @param fieldmap フィールドマップ
 *
 * @return 移動床イベント
 */
//----------------------------------------------------------------------------------------------------
extern GMEVENT* EVENT_PlayerMoveOnAutoWay( GMEVENT* parent, 
                                           GAMESYS_WORK* gsys, FIELDMAP_WORK* fieldmap );
