//======================================================================
/**
 * @file	eventwork_def.h
 * @brief	フラグ、ワーク領域定義のプログラムへのマッピング
 * @author	Satoshi Nohara
 * @date	2005.11.07
 *
 */
//======================================================================
#pragma once

#include "../../../resource/fldmapdata/flagwork/flag_define.h"
#include "../../../resource/fldmapdata/flagwork/work_define.h"

//======================================================================
//  フラグ定義関連
//======================================================================
enum {
  ///  トレーナーフラグ開始ナンバー
  TR_FLAG_START       = TR_FLAG_AREA_START,

  ///  隠しアイテムフラグ開始ナンバー
  FH_FLAG_START       = FLAG_HIDEITEM_AREA_START,

  ///  システムフラグ開始ナンバー
  SYSFLAG_START       = SYS_FLAG_AREA_START,

  ///  時間経過フラグ開始ナンバー
  TIMEFLAG_START      = TMFLG_AREA_START,


  //--------------------------------------------------------------
  //  フラグオフセット
  //--------------------------------------------------------------
  ///セーブフラグスタート　オフセット
  SVFLG_START			    = 0x0000,

  ///制御フラグスタート　オフセット
  SCFLG_START			    = 0x4000,

  //--------------------------------------------------------------
  //  セーブしないフラグ関連定義 制御フラグ
  //--------------------------------------------------------------
  ///制御フラグ最大数
  CTRLFLAG_MAX		    = 64,
  ///制御フラグ占有エリア
  CTRLFLAG_AREA_MAX   = (MATH_ROUNDUP(CTRLFLAG_MAX,8) / 8),

};


//======================================================================
//  ワーク関連定義
//======================================================================
enum {
  ///セーブワーク定義スタート　オフセット
  SVWK_START			    = 0x4000,

  ///データ交換・汎用ワーク定義スタート　オフセット
  SCWK_START			    = 0x8000,
};

