///////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief 殿堂入り確認画面呼び出しイベント
 * @file  event_dendou_pc.h
 * @author obata
 * @date   2010.03.30
 */
/////////////////////////////////////////////////////////////////////////////////////// 
#pragma once
#include <gflib.h>

//-------------------------------------------------------------------------------------
/**
 * @brief 殿堂入り確認画面呼び出しイベントを生成する
 *
 * @param gameSystem
 * @param call_mode 呼び出しタイプ
 * @param ret_wk    終了モードを格納するワーク
 */
//-------------------------------------------------------------------------------------
extern GMEVENT* EVENT_DendouCall( GAMESYS_WORK* gameSystem, u16 call_mode, u16* ret_wk );
