//////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  殿堂入り登録アニメーションイベント
 * @file   event_dendou_anime.c
 * @author obata_toshihiro
 * @date   2010.04.07
 */
//////////////////////////////////////////////////////////////////////////////////////////
#include <gflib.h>
#include "gamesystem/gamesystem.h"


//----------------------------------------------------------------------------------------
/**
 * @brief 殿堂入りアニメイベントを生成する
 *
 * @param gsys
 * @param parent
 *
 * @return 殿堂入りアニメイベント
 */
//----------------------------------------------------------------------------------------
extern GMEVENT* EVENT_DendouAnime( GAMESYS_WORK* gsys, GMEVENT* parent );
