//////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  季節表示イベント
 * @file   event_season_display.c
 * @author obata
 * @date   2009.11.25
 */
//////////////////////////////////////////////////////////////////////////////////////////
#pragma once


//----------------------------------------------------------------------------------------
/**
 * @brief 四季表示イベントを作成する
 *
 * @param gsys     ゲームシステム
 * @param fieldmap フィールドマップ
 *
 * @return 作成したイベント
 */
//----------------------------------------------------------------------------------------
extern GMEVENT* EVENT_SeasonDisplay( GAMESYS_WORK* gsys, FIELDMAP_WORK* fieldmap );

//----------------------------------------------------------------------------------------
/**
 * @brief 季節表示イベントに要するフレーム数を取得する
 *
 * @param gsys ゲームシステム
 *
 * @return イベント起動から終了までにかかるフレーム数
 */
//----------------------------------------------------------------------------------------
extern u32 GetSeasonDispEventFrame( GAMESYS_WORK* gsys );
