//======================================================================
/**
 * @file	event_debug_menu.h
 * @brief	フィールドデバッグメニューの制御イベント
 * @author	kagaya
 * @date	2008.11.13
 */
//======================================================================
#ifndef __FIELD_DEBUG_H__
#define __FIELD_DEBUG_H__

#include "gamesystem/gamesystem.h"
#include "gamesystem/game_event.h"
#include "field/fieldmap_proc.h"

//======================================================================
//	define
//======================================================================

//======================================================================
//	struct
//======================================================================

//======================================================================
//	extern
//======================================================================
extern GMEVENT * DEBUG_EVENT_DebugMenu( GAMESYS_WORK * gsys,
		FIELD_MAIN_WORK * fieldWork, HEAPID heapID, u16 page_id );

#endif //__FIELD_DEBUG_H__
