//==============================================================================
/**
 * @file    event_intrude_subscreen.h
 * @brief   ŠÈ’P‚Èà–¾‚ğ‘‚­
 * @author  matsuda
 * @date    2009.10.18(“ú)
 */
//==============================================================================
#pragma once


//==============================================================================
//  ŠO•”ŠÖ”éŒ¾
//==============================================================================
extern GMEVENT * EVENT_ChangeIntrudeSubScreen(
  GAMESYS_WORK *gsys, FIELDMAP_WORK *fieldWork, FIELD_SUBSCREEN_MODE change_mode);

