//======================================================================
/**
 * @file	event_gameover.h
 * @brief	イベント：全滅処理
 * @author	tamada GAMEFREAK inc.
 * @date	2009.09.20
 */
//======================================================================
#pragma once
#include <gflib.h>

#include "gamesystem/gamesystem.h"
#include "gamesystem/game_event.h"

//======================================================================
//  define
//======================================================================
//--------------------------------------------------------------
/**
 * @brief   復活処理タイプ
 */
//--------------------------------------------------------------
typedef enum {
  REVIVAL_TYPE_HOME,      ///<自宅で復活
  REVIVAL_TYPE_POKECEN,   ///<ポケセンで復活
}REVIVAL_TYPE;

//======================================================================
//  struct
//======================================================================
//--------------------------------------------------------------
//--------------------------------------------------------------
typedef struct {
  GAMESYS_WORK * gsys;
  REVIVAL_TYPE rev_type;
  const MYSTATUS * mystatus;
}GAMEOVER_WORK;

//======================================================================
//  extern
//======================================================================
extern GMEVENT * EVENT_NormalLose( GAMESYS_WORK * gsys );

FS_EXTERN_OVERLAY(gameclear_demo);

extern const GFL_PROC_DATA GameOverMsgProcData;

