////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  電光掲示板を見るイベント
 * @file   event_look_elboard.h
 * @author obata
 * @date   2009.11.25
 */
////////////////////////////////////////////////////////////////////////////////////////////
#pragma once


//------------------------------------------------------------------------------------------
/**
 * @brief 電光掲示板を見るイベントを生成する
 *
 * @param gsys     ゲームシステム
 * @param fieldmap フィールドマップ
 * @param frame    カメラの移動に要するフレーム数
 *
 * @return 作成したイベント
 */
//------------------------------------------------------------------------------------------
extern GMEVENT* EVENT_LookElboard( GAMESYS_WORK* gsys, FIELDMAP_WORK* fieldmap, u16 frame);
