//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		field_subscreen.h
 *	@brief		InforBerの初期化・破棄　
 *	@data		2009.03.26	fieldmapから移植
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __FIELD_SUBSCREEN_H__
#define __FIELD_SUBSCREEN_H__

#ifdef _cplusplus
extern "C"{
#endif


//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------
//BG面とパレット番号(仮設定
#define FIELD_SUBSCREEN_BGPLANE	(GFL_BG_FRAME3_S)
#define FIELD_SUBSCREEN_PALLET	(0xE)

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
extern void FIELD_SUBSCREEN_Init( u32 heapID );
extern void FIELD_SUBSCREEN_Exit( void );
extern void FIELD_SUBSCREEN_Main( void );

#ifdef _cplusplus
}	// extern "C"{
#endif

#endif		// __FIELD_SUBSCREEN_H__


