//============================================================================================
/**
 * @file  field_diving_data.h
 * @brief ダイビング接続先チェック用データとそのアクセス関数
 * @date  2010.02.21
 * @author  tamada GAME FREAK inc.
 */
//============================================================================================
#pragma once

#include <gflib.h>
//-----------------------------------------------------------------------------
/**
 * @brief ダイビングした先のゾーンIDを取得する
 * @param zone_id   現在のゾーン
 * @param x     探すX位置（グリッド単位）
 * @param z     探すZ位置（グリッド単位）
 * @return  u16 zone_id ZONE_ID_MAXの時、見つからなかった
 */
//-----------------------------------------------------------------------------
extern u16 DIVINGSPOT_GetZoneID( u16 zone_id, u16 x, u16 z );

//-----------------------------------------------------------------------------
/**
 * @brief ダイビングできるかどうかの判定
 * @param zone_id   現在のゾーン
 * @param x     探すX位置（グリッド単位）
 * @param z     探すZ位置（グリッド単位）
 * @return  BOOL  TRUEのとき、ダイビング可能
 */
//-----------------------------------------------------------------------------
extern BOOL DIVINGSPOT_SearchData( u16 zone_id, u16 x, u16 z );

