#pragma once
/////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  ギミック登録関数(ゲート)
 * @file   field_gimmick_gate.h
 * @author obata
 * @date   2009.10.21
 *
 */
/////////////////////////////////////////////////////////////////////////////
#include "fieldmap.h"
#include "gimmick_obj_elboard.h"


//==========================================================================================
// ■ギミック登録関数
//==========================================================================================
extern void GATE_GIMMICK_Setup( FIELDMAP_WORK* fieldmap );
extern void GATE_GIMMICK_End( FIELDMAP_WORK* fieldmap );
extern void GATE_GIMMICK_Move( FIELDMAP_WORK* fieldmap );


#if 0  // ニュースの管理方法を変更し, 不要になったために削除 2009.12.17
//==========================================================================================
// ■掲示板
//==========================================================================================

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板に平常通りのニュースを設定する
 *
 * @param fieldmap フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void GATE_GIMMICK_Elboard_SetupNormalNews( FIELDMAP_WORK* fieldmap );

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板に指定したニュースを追加する
 *
 * @param fieldmap フィールドマップ
 * @param str_id   追加するニュースのメッセージ番号
 * @param wordset  指定メッセージに展開するワードセット
 */
//------------------------------------------------------------------------------------------
extern void GATE_GIMMICK_Elboard_AddSpecialNews( 
    FIELDMAP_WORK* fieldmap, u32 str_id, WORDSET* wordset );

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板の状態を復帰させる(復帰ポイントは自動的に記憶)
 *
 * @param fieldmap フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void GATE_GIMMICK_Elboard_Recovery( FIELDMAP_WORK* fieldmap );
#endif


//==========================================================================================
// ■カメラ
//==========================================================================================

//------------------------------------------------------------------------------------------
/**
 * @brief カメラを電光掲示板に向ける
 *
 * @param fieldmap フィールドマップ
 * @param frame    カメラの動作に要するフレーム数
 */
//------------------------------------------------------------------------------------------
extern void GATE_GIMMICK_Camera_LookElboard( FIELDMAP_WORK* fieldmap, u16 frame );

//------------------------------------------------------------------------------------------
/**
 * @brief カメラを元に戻す
 *
 * @param fieldmap フィールドマップ
 * @param frame    カメラの動作に要するフレーム数
 */
//------------------------------------------------------------------------------------------
extern void GATE_GIMMICK_Camera_Reset( FIELDMAP_WORK* fieldmap, u16 frame );
