////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @file   field_place_name.c
 * @brief  地名表示ウィンドウ
 * @author obata_toshihiro
 * @date   2009.07.08
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////
#include "field_place_name.h"


//===================================================================================
/**
 * 定数
 */
//===================================================================================

//-----------------
// システムの状態
//-----------------
typedef enum
{
	FIELD_PLACE_NAME_STATE_HIDE,		// 非表示
	FIELD_PLACE_NAME_STATE_APPEAR,		// 出現中
	FIELD_PLACE_NAME_STATE_WAIT,		// 待機(表示)中
	FIELD_PLACE_NAME_STATE_DISAPPEAR,	// 退出中
	FIELD_PLACE_NAME_STATE_MAX,
}
FIELD_PLACE_NAME_STATE;


//===================================================================================
/**
 * システム・ワーク
 */
//===================================================================================
struct _FIELD_PLACE_NAME
{ 
	FIELD_PLACE_NAME_STATE state;			// 状態
	u32	                   current_zone_id;	// 現在表示中の地名に対応するゾーンID
	u32                    next_zone_id;	// 次に表示する地名に対応するゾーンID
};


//===================================================================================
/**
 * 静的関数のプロトタイプ宣言
 */
//===================================================================================


//------------------------------------------------------------------------------------
/**
 * @brief 地名表示システムを作成する
 *
 * @param heap_id 使用するヒープID
 *
 * @return 地名表示システム・ワークへのポインタ
 */
//------------------------------------------------------------------------------------
FIELD_PLACE_NAME* FIELD_PLACE_NAME_Create( HEAPID heap_id )
{
	FIELD_PLACE_NAME* p_sys;

	// システム・ワーク作成
	p_sys = (FIELD_PLACE_NAME*)GFL_HEAP_AllocClearMemory( heap_id, sizeof( FIELD_PLACE_NAME ) );

	// 作成したシステムを返す
	return p_sys;
}

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示システムの動作処理
 *
 * @param p_sys 動かすシステム
 */
//------------------------------------------------------------------------------------
void FIELD_PLACE_NAME_Process( FIELD_PLACE_NAME* p_sys )
{
}

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示ウィンドウの描画処理
 *
 * @param p_sys 描画対象システム
 */
//------------------------------------------------------------------------------------
void FIELD_PLACE_NAME_Draw( FIELD_PLACE_NAME* p_sys )
{
}

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示システムを破棄する
 *
 * @param p_sys 破棄するシステム
 */
//------------------------------------------------------------------------------------
void FIELD_PLACE_NAME_Delete( FIELD_PLACE_NAME* p_sys )
{
	// システム・ワーク解放
	GFL_HEAP_FreeMemory( p_sys );
}
