/////////////////////////////////////////////////////////////////////////////////////////
/**
 *
 * @file field_bgm_control.h
 * @brief フィールドマップにおけるBGMフェードの操作関数群
 * @author obata
 * @date   2009.08.19
 *
 */
/////////////////////////////////////////////////////////////////////////////////////////

#pragma once


//---------------------------------------------------------------------------------------
/**
 * @breif 指定ゾーンで再生すべきBGMのフェードインを開始する
 *
 * @param p_gdata     ゲームデータ
 * @param zone_id     BGMを開始するゾーン
 * @param fade_frames フェードインに要するフレーム数
 */
//---------------------------------------------------------------------------------------
void FIELD_BGM_CONTROL_FadeIn( GAMEDATA* p_gdata, u16 zone_id, u16 fade_frames );

//---------------------------------------------------------------------------------------
/**
 * @breif 指定ゾーンのBGMが再生中のBGMと異なる場合, 再生中のBGMのフェードアウトを開始する
 *
 * @param p_gdata     ゲームデータ
 * @param zone_id     BGMを開始するゾーン
 * @param fade_frames フェードインに要するフレーム数
 */
//---------------------------------------------------------------------------------------
void FIELD_BGM_CONTROL_FadeOut( GAMEDATA* p_gdata, u16 zone_id, u16 fade_frames );

//---------------------------------------------------------------------------------------
/**
 * @brief フェード中かどうかを判定する
 *
 * @return フェード中ならTRUE
 */
//---------------------------------------------------------------------------------------
BOOL FIELD_BGM_CONTROL_IsFade();
