#pragma once
/////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  ギミック登録関数(ゲート)
 * @file   field_gimmick_gate.h
 * @author obata
 * @date   2009.10.21
 *
 */
/////////////////////////////////////////////////////////////////////////////
#include "fieldmap.h"
#include "gimmick_obj_elboard.h"


//==========================================================================================
// ■ギミック登録関数
//==========================================================================================
void GATE_GIMMICK_Setup( FIELDMAP_WORK* fieldmap );
void GATE_GIMMICK_End( FIELDMAP_WORK* fieldmap );
void GATE_GIMMICK_Move( FIELDMAP_WORK* fieldmap );


//==========================================================================================
// ■掲示板
//==========================================================================================

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板に平常通りのニュースを設定する
 *
 * @param fieldmap フィールドマップ
 */
//------------------------------------------------------------------------------------------
void GATE_GIMMICK_Elboard_SetupNormalNews( FIELDMAP_WORK* fieldmap );

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板に指定したニュースを追加する
 *
 * @param fieldmap フィールドマップ
 * @param news     追加するニュース
 */
//------------------------------------------------------------------------------------------
void GATE_GIMMICK_Elboard_AddSpecailNews( FIELDMAP_WORK* fieldmap, const NEWS_PARAM* news );
