//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		field_wfbc.h
 *	@brief  White Forest  Black City データ
 *	@author	tomoya takahashi
 *	@date		2009.11.09
 *
 *	モジュール名：FIELD_WFBC
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#ifdef _cplusplus
extern "C"{
#endif

#include "field_g3d_mapper.h"

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
///	人物状態
//=====================================
typedef enum 
{
  FIELD_WFBC_PEOPLE_STATUS_NONE,    // いない
  FIELD_WFBC_PEOPLE_STATUS_NORMAL,  // 通常

  FIELD_WFBC_PEOPLE_STATUS_MAX,

} FIELD_WFBC_PEOPLE_STATUS;


//-------------------------------------
///	記憶する人物の数　最大数
//=====================================
#define FIELD_WFBC_PEOPLE_MAX ( 10 )

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
///	WFBCワーク
//=====================================
typedef struct _FIELD_WFBC FIELD_WFBC;

//-------------------------------------
///	人物情報
//=====================================
typedef struct _FIELD_WFBC_PEOPLE FIELD_WFBC_PEOPLE;



//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

//-------------------------------------
///	生成・破棄
//=====================================
extern FIELD_WFBC* FIELD_WFBC_Create( HEAPID heapID );
extern void FIELD_WFBC_Delete( FIELD_WFBC* p_wk );


//-------------------------------------
///	全体情報の取得
//=====================================
extern u32 FIELD_WFBC_GetPeopleNum( const FIELD_WFBC* cp_wk );
extern const FIELD_WFBC_PEOPLE* FIELD_WFBC_GetPeople( const FIELD_WFBC* cp_wk, int index );

// WFの高さ情報

// BCの高さ情報


//-------------------------------------
///	全体情報の設定
//=====================================
extern int FIELD_WFBC_AddPeople( FIELD_WFBC* p_wk, u32 objcode );
extern void FIELD_WFBC_DeletePeople( FIELD_WFBC* p_wk, int index );

//-------------------------------------
///	人物情報の取得
//=====================================
extern u32 FIELD_WFBC_PEOPLE_GetOBJCode( const FIELD_WFBC_PEOPLE* cp_people );


//============================================================================================
//============================================================================================
//------------------------------------------------------------------
//  ↓このヘッダで宣言しているが実態はfield_g3d_mapper.cにある
//------------------------------------------------------------------
extern FIELD_WFBC* FLDMAPPER_GetWfbcWork( const FLDMAPPER* g3Dmapper);


#ifdef _cplusplus
}	// extern "C"{
#endif



