////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  ギミック処理(ポケモンリーグフロント02)
 * @file   field_gimmick_league_front.h
 * @author obata
 * @date   2009.12.01
 */
//////////////////////////////////////////////////////////////////////////////////////////// 
#pragma once
#include <gflib.h>
#include "field/fieldmap_proc.h"


//==========================================================================================
// ■拡張オブジェクト
//==========================================================================================
//-------------
// オブジェクト
//-------------
typedef enum{
  LF02_EXOBJ_LIFT,         // リフト
  LF02_EXOBJ_LIGHT_FIGHT,  // ライト(格闘)
  LF02_EXOBJ_LIGHT_EVIL,   // ライト(悪)
  LF02_EXOBJ_LIGHT_GHOST,  // ライト(ゴースト)
  LF02_EXOBJ_LIGHT_ESPER,  // ライト(エスパー)
  LF02_EXOBJ_NUM
} OBJ_INDEX;
//----------
// ユニット
//----------
typedef enum{
  LF02_EXUNIT_GIMMICK,
  LF02_EXUNIT_NUM
} UNIT_INDEX;


//==========================================================================================
// ■ギミック登録関数
//==========================================================================================

//------------------------------------------------------------------------------------------
/**
 * @brief 初期化関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void LEAGUE_FRONT_02_GIMMICK_Setup( FIELDMAP_WORK* fieldmap );

//------------------------------------------------------------------------------------------
/**
 * @brief 終了関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void LEAGUE_FRONT_02_GIMMICK_End( FIELDMAP_WORK* fieldmap );

//------------------------------------------------------------------------------------------
/**
 * @brief 動作関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void LEAGUE_FRONT_02_GIMMICK_Move( FIELDMAP_WORK* fieldmap );
