//////////////////////////////////////////////////////////////////////////////////////
/**
 * @file   field_place_name.h
 * @brief  地名表示ウィンドウ
 * @author obata_toshihiro
 * @date   2009.07   
 */
//////////////////////////////////////////////////////////////////////////////////////
#pragma once
#include <gflib.h>
#include "field/field_msgbg.h"


//====================================================================================
// ■システムの不完全型
//====================================================================================
typedef struct _FIELD_PLACE_NAME FIELD_PLACE_NAME;


//====================================================================================
// ■index
//====================================================================================
/*
FIELD_PLACE_NAME* FIELD_PLACE_NAME_Create( HEAPID heapID, FLDMSGBG* msgbg );
void FIELD_PLACE_NAME_Delete( FIELD_PLACE_NAME* system );
void FIELD_PLACE_NAME_Process( FIELD_PLACE_NAME* system );
void FIELD_PLACE_NAME_Draw( const FIELD_PLACE_NAME* system );
void FIELD_PLACE_NAME_Display( FIELD_PLACE_NAME* system, u32 zoneID );
void FIELD_PLACE_NAME_DisplayForce( FIELD_PLACE_NAME* system, u32 zoneID );
void FIELD_PLACE_NAME_Hide( FIELD_PLACE_NAME* system );
void FIELD_PLACE_NAME_RecoverBG( FIELD_PLACE_NAME* system );
*/ 


//====================================================================================
// ■生成・破棄
//====================================================================================

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示システムを生成する
 *
 * @param heapID 使用するヒープID
 * @param msgbg  使用するメッセージBG
 *
 * @return 生成したシステム
 */
//------------------------------------------------------------------------------------
extern FIELD_PLACE_NAME* FIELD_PLACE_NAME_Create( HEAPID heapID, FLDMSGBG* msgbg );

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示システムを破棄する
 *
 * @param system
 */
//------------------------------------------------------------------------------------
extern void FIELD_PLACE_NAME_Delete( FIELD_PLACE_NAME* system );


//====================================================================================
// ■動作
//====================================================================================

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示システムの動作処理
 *
 * @param system
 */
//------------------------------------------------------------------------------------
extern void FIELD_PLACE_NAME_Process( FIELD_PLACE_NAME* system );

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示ウィンドウの描画処理
 *
 * @param system
 */
//------------------------------------------------------------------------------------
extern void FIELD_PLACE_NAME_Draw( const FIELD_PLACE_NAME* system );


//====================================================================================
// ■制御
//====================================================================================

//------------------------------------------------------------------------------------
/**
 * @brief ゾーンの切り替えを通知し, 新しい地名を表示する
 *
 * @param system
 * @param zoneID 表示する場所のゾーンID
 */
//------------------------------------------------------------------------------------
extern void FIELD_PLACE_NAME_Display( FIELD_PLACE_NAME* system, u32 zoneID );

//------------------------------------------------------------------------------------
/**
 * @brief 地名ウィンドウを強制的に表示する
 *
 * @param system
 * @param zoneID 表示する場所のゾーンID
 */
//------------------------------------------------------------------------------------
extern void FIELD_PLACE_NAME_DisplayForce( FIELD_PLACE_NAME* system, u32 zoneID );

//------------------------------------------------------------------------------------
/**
 * @brief 地名ウィンドウの表示を強制的に終了する
 *
 * @param system
 */
//------------------------------------------------------------------------------------
extern void FIELD_PLACE_NAME_Hide( FIELD_PLACE_NAME* system );

//------------------------------------------------------------------------------------
/**
 * @brief 地名表示ウィンドウのキャラクタデータ, スクリーンデータを復帰させる
 *
 * @param system
 */
//------------------------------------------------------------------------------------
extern void FIELD_PLACE_NAME_RecoverBG( FIELD_PLACE_NAME* system );
