#pragma once
/////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  ギミック登録関数(ゲート)
 * @file   field_gimmick_gate.h
 * @author obata
 * @date   2009.10.21
 *
 */
/////////////////////////////////////////////////////////////////////////////
#include "fieldmap.h"
#include "gimmick_obj_elboard.h"


//==========================================================================================
// ■ギミック登録関数
//==========================================================================================
void GATE_GIMMICK_Setup( FIELDMAP_WORK* fieldmap );
void GATE_GIMMICK_End( FIELDMAP_WORK* fieldmap );
void GATE_GIMMICK_Move( FIELDMAP_WORK* fieldmap );


//==========================================================================================
// ■掲示板
//==========================================================================================

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板に平常通りのニュースを設定する
 *
 * @param fieldmap フィールドマップ
 */
//------------------------------------------------------------------------------------------
void GATE_GIMMICK_Elboard_SetupNormalNews( FIELDMAP_WORK* fieldmap );

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板に指定したニュースを追加する
 *
 * @param fieldmap フィールドマップ
 * @param str_id   追加するニュースのメッセージ番号
 * @param wordset  指定メッセージに展開するワードセット
 */
//------------------------------------------------------------------------------------------
void GATE_GIMMICK_Elboard_AddSpecialNews( 
    FIELDMAP_WORK* fieldmap, u32 str_id, WORDSET* wordset );

//------------------------------------------------------------------------------------------
/**
 * @brief 掲示板の状態を復帰させる(復帰ポイントは自動的に記憶)
 *
 * @param fieldmap フィールドマップ
 */
//------------------------------------------------------------------------------------------
void GATE_GIMMICK_Elboard_Recovery( FIELDMAP_WORK* fieldmap );
