//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		field_bbd_color.h
 *	@brief  ビルボード　カラー　データ
 *	@author	tomoya takahashi
 *	@date		2010.01.05
 *
 *	モジュール名：FLD_BBD_COLOR
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#ifdef _cplusplus
extern "C"{
#endif

#include "gflib.h"

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
///	ビルボードカラー設定システム
//=====================================
typedef struct _FLD_BBD_COLOR FLD_BBD_COLOR;


//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

// 生成・破棄
extern FLD_BBD_COLOR* FLD_BBD_COLOR_Create( HEAPID heapID ); 
extern void FLD_BBD_COLOR_Delete( FLD_BBD_COLOR* p_wk );

// 読み込み処理
extern void FLD_BBD_COLOR_Load( FLD_BBD_COLOR* p_wk, u32 idx );

// 設定
extern void FLD_BBD_COLOR_SetData( const FLD_BBD_COLOR* cp_wk, GFL_BBD_SYS* p_bbdsys );

#ifdef _cplusplus
}	// extern "C"{
#endif



