////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  フィールドタスク(カメラのズーム処理)
 * @file   field_task_camera_zoom.h
 * @author obata
 * @date   2009.11.18
 */
////////////////////////////////////////////////////////////////////////////////////////////


//------------------------------------------------------------------------------------------
/**
 * @brief カメラを等速ズームさせるタスクを作成する
 *
 * @param fieldmap 処理対象のフィールドマップ
 * @param frame    ズーム完了までのフレーム数
 * @param dist     移動する距離/最終的な距離
 */
//------------------------------------------------------------------------------------------
extern FIELD_TASK* FIELD_TASK_CameraLinearZoom( FIELDMAP_WORK* fieldmap, u16 frame, fx32 dist );

//------------------------------------------------------------------------------------------
/**
 * @brief カメラを急加速ズームさせるタスクを作成する
 *
 * @param fieldmap 処理対象のフィールドマップ
 * @param frame    ズーム完了までのフレーム数
 * @param dist     移動する距離/最終的な距離
 */
//------------------------------------------------------------------------------------------
extern FIELD_TASK* FIELD_TASK_CameraSharpZoom( FIELDMAP_WORK* fieldmap, u16 frame, fx32 dist );
