////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  ギミック処理(ポケモンリーグフロント01)
 * @file   field_gimmick_league_front.h
 * @author obata
 * @date   2009.12.01
 */
//////////////////////////////////////////////////////////////////////////////////////////// 
#pragma once
#include <gflib.h>
#include "field/fieldmap_proc.h"


//==========================================================================================
// ■拡張オブジェクト
//==========================================================================================
//-------------
// オブジェクト
//-------------
typedef enum {
  LF01_EXOBJ_LIFT,         // リフト
  LF01_EXOBJ_LIFT_EFFECT,  // リフトの稼動エフェクト
  LF01_EXOBJ_LIGHT_FIGHT,  // ライト(格闘)
  LF01_EXOBJ_LIGHT_EVIL,   // ライト(悪)
  LF01_EXOBJ_LIGHT_GHOST,  // ライト(ゴースト)
  LF01_EXOBJ_LIGHT_ESPER,  // ライト(エスパー)
  LF01_EXOBJ_NUM
} LF01_EXOBJ_INDEX;
//----------
// ユニット
//----------
typedef enum {
  LF01_EXUNIT_GIMMICK,
  LF01_EXUNIT_NUM
} LF01_EXUNIT_INDEX;


//==========================================================================================
// ■ギミック登録関数
//==========================================================================================

//------------------------------------------------------------------------------------------
/**
 * @brief 初期化関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void LEAGUE_FRONT_01_GIMMICK_Setup( FIELDMAP_WORK* fieldmap );

//------------------------------------------------------------------------------------------
/**
 * @brief 終了関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void LEAGUE_FRONT_01_GIMMICK_End( FIELDMAP_WORK* fieldmap );

//------------------------------------------------------------------------------------------
/**
 * @brief 動作関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
extern void LEAGUE_FRONT_01_GIMMICK_Move( FIELDMAP_WORK* fieldmap ); 
