//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		field_envse_data.c
 *	@brief  環境音SEのデータ
 *	@author	tomoya takahhashi
 *	@date		2010.03.10
 *
 *	モジュール名：
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

#include "gflib.h"

#include "sound/pm_sndsys.h"

#include "field_envse_data.h"

#include "field_envse.cdat"

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------






// 環境音チェック
//----------------------------------------------------------------------------
/**
 *	@brief  環境音チェック
 *
 *	@param	soundIdx  SE
 *
 *	@retval TRUE    環境音
 *	@retval FALSE   環境音じゃない
 */
//-----------------------------------------------------------------------------
BOOL FLD_ENVSE_DATA_IsEnvSE( u32 soundIdx )
{
  int i;

  for( i=0; i<NELEMS(c_FLD_ENVSE_DATA); i++ ){
    if( c_FLD_ENVSE_DATA[i].label == soundIdx ){
      return TRUE;
    }
  }
  return FALSE;
}


//----------------------------------------------------------------------------
/**
 *	@brief  サウンドのループ音チェック
 *
 *	@param	soundIdx  SEインデックス
 *
 *	@retval TRUE  ループ音
 *	@retval FALSE 単発
 */
//-----------------------------------------------------------------------------
BOOL FLD_ENVSE_DATA_IsLoopSE( u32 soundIdx )
{
  int  i;

  for( i=0; i<NELEMS(c_FLD_ENVSE_DATA); i++ ){
    if( (c_FLD_ENVSE_DATA[i].label == soundIdx) && (c_FLD_ENVSE_DATA[i].loop == TRUE) ){
      return TRUE;
    }
  }
  return FALSE;
}

