////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  フィールドタスク(カメラの注視点補正座標の移動処理)
 * @file   field_task_target_offset.h
 * @author obata
 * @date   2009.11.24
 */
////////////////////////////////////////////////////////////////////////////////////////////
#pragma once


//------------------------------------------------------------------------------------------
/**
 * @brief カメラの注視点補正座標移動タスクを作成する
 *
 * @param fieldmap タスク動作対象のフィールドマップ
 * @param frame    タスク動作フレーム数
 * @param offset   最終的なオフセット値
 */
//------------------------------------------------------------------------------------------
extern FIELD_TASK* FIELD_TASK_CameraTargetOffset( FIELDMAP_WORK* fieldmap, 
                                                  int frame, 
                                                  const VecFx32* offset );
