/////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief  フィールドタスク(自機の平行移動処理)
 * @file   field_task_player_trans.h
 * @author obata
 * @date   2009.11.18
 */
/////////////////////////////////////////////////////////////////////////////////////////////////


//-----------------------------------------------------------------------------------------------
/**
 * @brief プレイヤーの移動タスクを作成する
 *
 * @param fieldmap 動作対象フィールドマップ
 * @param frame    動作フレーム数
 * @param pos      移動先座標
 */
//-----------------------------------------------------------------------------------------------
FIELD_TASK* FIELD_TASK_TransPlayer( FIELDMAP_WORK* fieldmap, int frame, VecFx32* pos );
