//======================================================================
/**
 * @file	field_palace_sys.h
 * @brief	侵入時管理
 * @author	ariizumi
 * @data	10/04/29
 *
 * モジュール名：FIELD_PALACE
 */
//======================================================================
#pragma once
#include "gamesystem/gamesystem.h"
//======================================================================
//	define
//======================================================================

//======================================================================
//	enum
//======================================================================

//======================================================================
//	typedef struct
//======================================================================
typedef struct _FIELD_PALACE_SYS FIELD_PALACE_SYS;

//======================================================================
//	proto
//======================================================================
extern FIELD_PALACE_SYS* FIELD_PALACE_Create( HEAPID heapId , GAMESYS_WORK *gsys , FIELDMAP_WORK *fieldWork , u16 zoneId );
extern void FIELD_PALACE_Delete( FIELD_PALACE_SYS *work );
extern u8* FIELD_PALACE_GetShadeTable( FIELD_PALACE_SYS *work );

//--------------------------------------------------------------
//	そのゾーンに到達しているか？
//  パレス対象外なら常にTRUE
//--------------------------------------------------------------
extern const BOOL FIELD_PALACE_CheckArriveZone( GAMEDATA *gmData , u16 zoneId );
