#include <gflib.h>
#include "fieldmap.h"
#include "field_gimmick_h03.h"

#include "gamesystem/iss_3ds_unit.h"
#include "gamesystem/iss_3ds_sys.h"
#include "arc/h03.naix"
#include "sound_obj.h"



//==========================================================================================
// ■3Dリソース
//==========================================================================================
// リソース
static const GFL_G3D_UTIL_RES res_table[] = 
{
  { ARCID_H03_GIMMICK, NARC_h03_h03_train1_nsbmd, GFL_G3D_UTIL_RESARC },
};

// オブジェクト
static const GFL_G3D_UTIL_OBJ obj_table[] = 
{
  { 0, 0, 0, NULL, 0 },
};

// セットアップ情報
static GFL_G3D_UTIL_SETUP setup = { res_table, NELEMS(res_table), obj_table, NELEMS(obj_table) };


//==========================================================================================
// ■ギミックワーク
//==========================================================================================
typedef struct
{ 
  ISS_3DS_SYS* iss3dsSys; // 3Dサウンドシステム
  SOUNDOBJ*         sobj; // 音源オブジェクト
} H03WORK;


//==========================================================================================
// ■ギミック登録関数
//==========================================================================================

//------------------------------------------------------------------------------------------
/**
 * @brief 初期化関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
void H03_GIMMICK_Setup( FIELDMAP_WORK* fieldmap )
{
}

//------------------------------------------------------------------------------------------
/**
 * @brief 終了関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
void H03_GIMMICK_End( FIELDMAP_WORK* fieldmap )
{
}

//------------------------------------------------------------------------------------------
/**
 * @brief 動作関数
 *
 * @param fieldmap ギミック動作フィールドマップ
 */
//------------------------------------------------------------------------------------------
void H03_GIMMICK_Move( FIELDMAP_WORK* fieldmap )
{
}
