//============================================================================================
/**
 * @file  field_bmanime.h
 * @brief フィールド配置モデルアニメ制御
 * @date  2009.05.11
 * @author  tamada GAME FREAK inc.
 */
//============================================================================================

#pragma once

//============================================================================================
//============================================================================================

//------------------------------------------------------------------
/**
 * @brief 配置モデルアニメの適用タイプ指定
 */
//------------------------------------------------------------------
typedef enum {  
  BMANIME_TYPE_NONE = 0,    ///<アニメなし
  BMANIME_TYPE_ETERNAL,     ///<常に適用
  BMANIME_TYPE_EVENT,       ///<イベントで適用
  BMANIME_TYPE_TIMEZONE,    ///<時間帯変化

  BMANIME_TYPE_MAX
}BMANIME_TYPE;

//------------------------------------------------------------------
/**
 * @brief 配置モデルアニメの特殊タイプ指定
 */
//------------------------------------------------------------------
typedef enum {  
  BMANIME_PROG_TYPE_NONE = 0,   ///<特に動作なし
  BMANIME_PROG_TYPE_ELBOARD1,   ///<電光掲示板その１
  BMANIME_PROG_TYPE_ELBOARD2,   ///<電光掲示板その２

  BMANIME_PROG_TYPE_MAX,
}BMANIME_PROG_TYPE;



