////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @file   field_cars.h
 * @brief  ゾーンID ZONE_ID_H01 の橋の上に車を走らせるシステム
 * @author obata_toshihiro
 * @date   2009.07.28
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma once

#include "field_player.h"


//=========================================================================
/**
 * @brief システムの不完全型宣言
 */
//=========================================================================
typedef struct _FIELD_CARS FIELD_CARS;


//=========================================================================
/**
 * @brief システム初期化・破棄関数
 */
//=========================================================================

// 初期化	
FIELD_CARS* FIELD_CARS_Create( FIELD_PLAYER* p_player, u16 zone_id, HEAPID heap_id );

// 破棄
void FIELD_CARS_Delete( FIELD_CARS* p_sys ); 

//=========================================================================
/**
 * @brief システム動作関数
 */
//=========================================================================

// 処理
void FIELD_CARS_Process( FIELD_CARS* p_sys );

// 描画
void FIELD_CARS_Draw( FIELD_CARS* p_sys ); 
