////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @file   iss_unit.h
 * @brief  ISSユニット
 * @author obata_toshihiro
 * @date   2009.07.16
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma once
#include <gflib.h>


// ISSユニット構造体の不完全型の宣言
typedef struct _ISS_UNIT ISS_UNIT;


//----------------------------------------------------------------------------
/**
 * @brief  ISSユニットを作成する
 *
 * @param  zone_id ゾーンID
 * @param  heap_id 使用するヒープID
 * 
 * @return ISSユニット
 */
//----------------------------------------------------------------------------
ISS_UNIT* ISS_UNIT_Create( u16 zone_id, HEAPID heap_id ); 

//----------------------------------------------------------------------------
/**
 * @brief  ISSユニットを破棄する
 *
 * @param p_unit 破棄するISSユニット 
 */
//----------------------------------------------------------------------------
void ISS_UNIT_Delete( ISS_UNIT* p_unit );

//----------------------------------------------------------------------------
/**
 * @brief 音量を調整する
 *
 * @param p_unit 操作対象のユニット
 * @param gx     主人公のx座標[グリッド]
 * @param gy     主人公のy座標[グリッド]
 * @param gz     主人公のz座標[グリッド]
 */
//----------------------------------------------------------------------------
void ISS_UNIT_Update( const ISS_UNIT* p_unit, int gx, int gy, int gz );

//----------------------------------------------------------------------------
/**
 * @brief ゾーン切り替えを通知する
 *
 * @param p_unit       通知対象のISSユニット
 * @param next_zone_id 新しいゾーンID
 */
//----------------------------------------------------------------------------
void ISS_UNIT_ZoneChange( ISS_UNIT* p_unit, u16 next_zone_id );
