//////////////////////////////////////////////////////////////////////////////////////
/**
 * @file   iss_unit.h
 * @brief  ISSユニット
 * @author obata_toshihiro
 * @date   2009.07.29
 */
//////////////////////////////////////////////////////////////////////////////////////
#pragma once
#include <gflib.h>
#include "gamesystem/game_data.h"


// ISSユニット構造体の不完全型の宣言
typedef struct _ISS_UNIT ISS_UNIT;


//----------------------------------------------------------------------------
/**
 * @brief  ISSユニットを作成する
 *
 * @param p_gdata	監視対象ゲームデータ
 * @param zone_id   ゾーンID
 * @param heap_id   使用するヒープID
 * 
 * @return ISSユニット
 */
//----------------------------------------------------------------------------
extern ISS_UNIT* ISS_UNIT_Create( GAMEDATA* p_gdata, u16 zone_id, HEAPID heap_id );

//----------------------------------------------------------------------------
/**
 * @brief  ISSユニットを破棄する
 *
 * @param p_unit 破棄するISSユニット 
 */
//----------------------------------------------------------------------------
extern void ISS_UNIT_Delete( ISS_UNIT* p_unit );

//----------------------------------------------------------------------------
/**
 * @brief プレイヤーを監視し, 音量を調整する
 *
 * @param p_unit 操作対象のユニット
 */
//----------------------------------------------------------------------------
extern void ISS_UNIT_Update( ISS_UNIT* p_unit );

//----------------------------------------------------------------------------
/**
 * @brief ゾーン切り替えを通知する
 *
 * @param p_unit       通知対象のISSユニット
 * @param next_zone_id 新しいゾーンID
 */
//----------------------------------------------------------------------------
void ISS_UNIT_ZoneChange( ISS_UNIT* p_unit, u16 next_zone_id );
