//============================================================================================
/**
 * @file  proc_gameclear_save.c
 * @date  2009.12.20
 * @author  tamada GAMEFREAK inc.
 * @brief ゲームクリア時のセーブなど
 *
 */
//============================================================================================
#pragma once

#include <gflib.h>

#include "event_gameclear.h"  //GAMECLEAR_MODE

//--------------------------------------------------------------
/// ゲームクリア後デモに渡すパラメータ
//--------------------------------------------------------------
typedef struct {
  GAMESYS_WORK * gsys;
  GAMECLEAR_MODE clear_mode;
}GAMECLEAR_MSG_PARAM;
//--------------------------------------------------------------
/// ゲームクリア後デモ用ProcData
//--------------------------------------------------------------
extern const GFL_PROC_DATA GameClearMsgProcData;

//--------------------------------------------------------------
/// ゲームクリア後デモ用ProcDataが存在するオーバーレイID
//--------------------------------------------------------------
FS_EXTERN_OVERLAY(gameclear_demo);

