//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		scrcmd_subscreen.h
 *	@brief  サブスクリーン　スクリプトコマンド
 *	@author	tomoya takahashi
 *	@date		2010.03.10
 *
 *	モジュール名：
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#ifdef _cplusplus
extern "C"{
#endif


//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

// サブスクリーンの変更と元に戻す処理。
extern VMCMD_RESULT EvCmdSubScreenChnage( VMHANDLE *core, void *wk );
extern VMCMD_RESULT EvCmdSubScreenBack( VMHANDLE *core, void *wk );

// スクリプト終了チェック用定義
extern BOOL SCREND_CheckEndSubScreenChange( SCREND_CHECK *end_check, int *seq );


#ifdef _cplusplus
}	// extern "C"{
#endif



