//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		scrcmd_movepoke.h
 *	@brief  移動ポケモン  スクリプトコマンド
 *	@author	tomoya takahashi
 *	@date		2010.03.09
 *
 *	モジュール名：
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#ifdef _cplusplus
extern "C"{
#endif


//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
// 移動ポケモン　ポケモンワーク生成・破棄
extern VMCMD_RESULT EvCmdMovePoke_Create( VMHANDLE *core, void *wk );
extern VMCMD_RESULT EvCmdMovePoke_Delete( VMHANDLE *core, void *wk );

//　移動ぽけもん　アニメーション開始
extern VMCMD_RESULT EvCmdMovePoke_StartAnime( VMHANDLE *core, void *wk );

//　移動ぽけもん　アニメーション終了待ち
extern VMCMD_RESULT EvCmdMovePoke_IsEnd( VMHANDLE *core, void *wk );

#ifdef _cplusplus
}	// extern "C"{
#endif



