//////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  スクリプトコマンド：ビーコン通信/Gパワー関連
 * @file   scrcmd_beacon.h
 * @author iwasawa
 * @date   2010.02.15
 */
//////////////////////////////////////////////////////////////////////

#pragma once

//--------------------------------------------------------------------
/**
 * @brief ビーコン送信リクエスト呼び出し 
 *
 * @param core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT:w
 */
//--------------------------------------------------------------------
extern VMCMD_RESULT EvCmdBeaconSetRequest( VMHANDLE* core, void* wk );

