//======================================================================
/**
 * @file	scrcmd_postman.h
 * @brief	スクリプトコマンド：ふしぎなおくりもの配達員
 * @date	2010.02.12
 * @author  tamada GAMEFREAK inc.
 *
 */
//======================================================================
#pragma once

//======================================================================
//  extern 
//======================================================================
extern VMCMD_RESULT EvCmdPostmanCommand( VMHANDLE * core, void *wk );

