
//======================================================================
/**
 * @file  scrcmd_sxy.h
 * @brief  スクリプトコマンド用関数：イベントデータ操作
 * @date  2010.02.01
 *
 */
//======================================================================

#pragma once

//======================================================================
//  extern 
//======================================================================
extern VMCMD_RESULT EvCmdMoveBgEventPos( VMHANDLE * core, void * wk );
extern VMCMD_RESULT EvCmdMoveExitEventPos( VMHANDLE * core, void * wk );

