//////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  スクリプトコマンド：育て屋関連
 * @file   scrcmd_sodateya.h
 * @author obata
 * @date   2009.09.24
 *
 */
//////////////////////////////////////////////////////////////////////
#pragma once


//====================================================================
// ■タマゴ関連
//====================================================================

//--------------------------------------------------------------------
/**
 * @brief 育て屋のポケモンに卵が生まれたかどうかのチェック
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdCheckSodateyaHaveEgg( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋のタマゴを受け取る
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaEgg( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋のタマゴを削除する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdDeleteSodateyaEgg( VMHANDLE* core, void* wk );


//====================================================================
// ■ポケモン預ける・引き取る
//====================================================================

//--------------------------------------------------------------------
/**
 * @brief 預けるポケモンの選択画面を呼び出す
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdSodateyaSelectTemotiPokemon( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋にポケモンを預ける
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdTrustPokeToSodateya( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋からポケモンを受け取る
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdCheckOutPokeFromSodateya( VMHANDLE* core, void* wk );


//====================================================================
// ■預けポケモン関連
//====================================================================

//--------------------------------------------------------------------
/**
 * @breif 育て屋に預けているポケモンの数を取得する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaPokemonNum( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @breif 預けポケモン2体の相性をチェックする
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdSodateyaLoveCheck( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋に預けているポケモンのモンスターナンバーを取得する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaPokeMonsNo( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋に預けているポケモンの形状ナンバーを取得する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaPokeFormNo( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋に預けているポケモンについて, 性別を取得する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaPokeSex( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋に預けているポケモンについて, 現在のレベルを取得する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaPokeLv( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋に預けているポケモンについて, 成長したレベルを取得する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaPokeGrowUpLv( VMHANDLE* core, void* wk );

//--------------------------------------------------------------------
/**
 * @brief 育て屋に預けているポケモンについて, 引き取り料金を取得する
 *
 * @param	core 仮想マシン制御構造体へのポインタ
 * @param wk   SCRCMD_WORKへのポインタ
 *
 * @retval VMCMD_RESULT
 */
//--------------------------------------------------------------------
VMCMD_RESULT EvCmdGetSodateyaPokeTakeBackCharge( VMHANDLE* core, void* wk ); 
