//======================================================================
/**
 * @file  trainer_eye_data.h
 * @date  2009.09.09
 * @author  GAMEFREAK inc.
 *
 * 2009.09.09 script.cから分離した
 */
//======================================================================
#pragma once

#include "battle/battle.h"
#include "fldmmdl.h"

//--------------------------------------------------------------
/**
 * @brief トレーナー視線ヒット移動制御ワークへの不完全型ポインタ
 */
//--------------------------------------------------------------
typedef struct _EV_EYEMEET_MOVE_WORK EV_EYEMEET_MOVE_WORK;

//--------------------------------------------------------------
/**
 * @brief トレーナー視線ヒットデータ
 */
//--------------------------------------------------------------
typedef struct
{
  MMDL *mmdl;
	int range;  				///< 視線距離
	int dir;  					///< 移動方向
	int scr_id;			  	///< スクリプトID
	int tr_id;			  	///< トレーナーID
  int move_type;      ///< 視線動作タイプ
}TRAINER_HITDATA;

//--------------------------------------------------------------
/**
 * @brief トレーナー視線ヒット：スクリプト保持データ
 */
//--------------------------------------------------------------
typedef struct {
  ///トレーナー視線ヒットデータ
  TRAINER_HITDATA hitdata;

  ///視線ヒット移動制御ワーク
  EV_EYEMEET_MOVE_WORK * ev_eye_move;

}SCR_TRAINER_HITDATA;

