//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		weather_snow.h
 *	@brief		天気	雪
 *	@author		tomoya takahashi
 *	@date		2009.03.19
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __WEATHER_SNOW_H__
#define __WEATHER_SNOW_H__

#ifdef _cplusplus
extern "C"{
#endif

#include "weather_task.h"


FS_EXTERN_OVERLAY(field_weather_snow);

//-----------------------------------------------------------------------------
/**
 *		通常の雪
*/
//-----------------------------------------------------------------------------
extern WEATHER_TASK_DATA c_WEATHER_TASK_DATA_SNOW;


//-----------------------------------------------------------------------------
/**
 *		吹雪
*/
//-----------------------------------------------------------------------------
extern WEATHER_TASK_DATA c_WEATHER_TASK_DATA_SNOWSTORM;

//-----------------------------------------------------------------------------
/**
 *		あられ
*/
//-----------------------------------------------------------------------------
extern WEATHER_TASK_DATA c_WEATHER_TASK_DATA_ARARE;

//-----------------------------------------------------------------------------
/**
 *		ダイヤモンドダスト
*/
//-----------------------------------------------------------------------------
extern WEATHER_TASK_DATA c_WEATHER_TASK_DATA_DIAMONDDUST;


#ifdef _cplusplus
}	// extern "C"{
#endif

#endif		// __WEATHER_SNOW_H__


