//======================================================================
/**
 * @file  user_define.h
 * @author  GAMEFREAK inc.
 * @date  2009.11.11
 */
//======================================================================

#pragma once


//======================================================================
//  最初の3体識別用定義
//======================================================================
#define FIRST_POKETYPE_KUSA   ( 0 )	//草タイプを選んだ
#define FIRST_POKETYPE_HONOO	( 1 )	//炎タイプを選んだ
#define FIRST_POKETYPE_MIZU   ( 2 )	//水タイプを選んだ

