//============================================================================
/**
 *  @file   zukan_detail_form.h
 *  @brief  図鑑詳細画面の姿画面
 *  @author Koji Kawada
 *  @data   2010.02.02
 *  @note   
 *
 *  モジュール名：ZUKAN_DETAIL_FORM
 */
//============================================================================
#pragma once


// インクルード
#include <gflib.h>

#include "zukan_detail_procsys.h"

// オーバーレイ
FS_EXTERN_OVERLAY(zukan_detail);


//=============================================================================
/**
 *  PROC
 */
//=============================================================================
extern const ZKNDTL_PROC_DATA    ZUKAN_DETAIL_FORM_ProcData;


//=============================================================================
/**
*  構造体宣言
*/
//=============================================================================
//-------------------------------------
/// PROC パラメータ
//=====================================
typedef struct _ZUKAN_DETAIL_FORM_PARAM
{
  HEAPID heap_id;
}
ZUKAN_DETAIL_FORM_PARAM;


//=============================================================================
/**
*  関数のプロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
/// パラメータを設定する
//=====================================
extern void         ZUKAN_DETAIL_FORM_InitParam(
                            ZUKAN_DETAIL_FORM_PARAM*  param,
                            HEAPID                    heap_id );

