//======================================================================
/**
 * @file	mb_comm_sys.c
 * @brief	マルチブート 通信システム
 * @author	ariizumi
 * @data	09/11/13
 *
 * モジュール名：MB_COMM
 */
//======================================================================
#include <gflib.h>
#include "system/main.h"
#include "system/gfl_use.h"

#include "multiboot/comm/mb_comm_sys.h"

//======================================================================
//	define
//======================================================================
#pragma mark [> define

//======================================================================
//	enum
//======================================================================
#pragma mark [> enum


//======================================================================
//	typedef struct
//======================================================================
#pragma mark [> struct
struct _MB_COMM_WORK
{
  HEAPID heapId;
};


//======================================================================
//	proto
//======================================================================
#pragma mark [> proto

//--------------------------------------------------------------
//	ワークの作成
//--------------------------------------------------------------
MB_COMM_WORK* MB_COMM_CreateSystem( const HEAPID heapId )
{
  MB_COMM_WORK* commWork = GFL_HEAP_AllocMemory( heapId , sizeof( MB_COMM_WORK ) );
  
  commWork->heapId = heapId;
  
  return commWork;
}

//--------------------------------------------------------------
//	ワークの開放
//--------------------------------------------------------------
void MB_COMM_DeleteSystem( MB_COMM_WORK* commWork )
{
  GFL_HEAP_FreeMemory( commWork );
}
