//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		debug_ui_input.h
 *	@brief  キー入力情報のバッファリング
 *	@author	tomoya takahashi
 *	@date		2010.05.01
 *
 *	モジュール名：
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#ifdef _cplusplus
extern "C"{
#endif

#include <gflib.h>

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

extern void DEBUG_UI_INPUT_Start( void );
extern void DEBUG_UI_INPUT_End( void );
extern void DEBUG_UI_INPUT_Update( void );
extern u32 DEBUG_UI_INPUT_GetInputBufNum( void );
extern const GFL_UI_DEBUG_OVERWRITE* DEBUG_UI_INPUT_GetInputBuf( void );


#ifdef _cplusplus
}	// extern "C"{
#endif



