//============================================================================================
/**
 * @file  msc_mode.c
 * @brief MCS利用状態制御用フラグ
 * @date  2010.03.20
 */
//============================================================================================

#ifdef  PM_DEBUG

#include "debug/mcs_mode.h"
#include <gflib.h>

static MCS_USEMODE mcsUseMode;
//----------------------------------------------------------------
/// 利用モードの取得
//----------------------------------------------------------------
MCS_USEMODE MCS_USEMODE_Get(void)
{
  return mcsUseMode;
}

//----------------------------------------------------------------
/// 利用モードの設定
//----------------------------------------------------------------
void MCS_USEMODE_Set( MCS_USEMODE mode )
{
  GF_ASSERT( mode < MCS_USEMODE_MAX );
  mcsUseMode = mode;
}

#endif

