//=============================================================================================
/**
 * @file	bmp_win.h
 * @brief	ビットマップウィンドウシステム
 */
//=============================================================================================
#ifndef _BMP_WIN_H_
#define _BMP_WIN_H_

#ifdef __cplusplus
extern "C" {
#endif

// BitmapWindowのビットモード
enum {
	GFL_BMPWIN_BITMODE_4 = 0,
	GFL_BMPWIN_BITMODE_8 = 1
};

//----------------------------------------------------
/**
 *  ハンドル構造体の型宣言
 */
//----------------------------------------------------
typedef struct _GFL_BMPWIN	GFL_BMPWIN;

//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
/**
 *
 * ビットマップ管理システムの開始、終了
 *
 * 主にプロセス起動、終了時に呼ばれる。
 * ビットマップウインドウを使用するＢＧフレーム（複数指定可）、使用ＣＧＸ領域の設定を行う。
 * これ以後、各ビットマップ作成の際は、ここで設定したステータスが用いられる。
 */
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
/**
 * システム初期化
 *
 * @param	heapID	使用ヒープ領域
 */
//--------------------------------------------------------------------------------------------
extern void	GFL_BMPWIN_Init( HEAPID heapID );

//--------------------------------------------------------------------------------------------
/**
 * システム終了
 */
//--------------------------------------------------------------------------------------------
extern void GFL_BMPWIN_Exit( void );

//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウの作成、破棄
 *
 * ビットマップとして使用したいＢＧフレーム、描画位置、使用ＣＧＸサイズの設定などを指定し
 * ビットマップウインドウ管理ハンドルを作成する。
 * 自動でＣＧＸバッファ領域のヒープ確保も行う。
 * 作成後のビットマップウインドウ操作は、ハンドルポインタによって行われる。
 */
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウの作成
 *
 * @param	frmnum	GFL_BGL使用フレーム
 * @param	posx	Ｘ座標（キャラクター単位）
 * @param	posy	Ｙ座標（キャラクター単位）
 * @param	sizx	Ｘサイズ（キャラクター単位）
 * @param	sizy	Ｙサイズ（キャラクター単位）
 * @param	panum	使用パレットナンバー
 * @param	dir		確保ＶＲＡＭ方向(GFL_BMP_CHRAREA_GET_F:前方確保　GFL_BMP_CHRAREA_GET_B:後方確保）
 *
 * @return	ビットマップウインドウハンドルポインタ
 */
//--------------------------------------------------------------------------------------------
extern GFL_BMPWIN* GFL_BMPWIN_Create( u8 frmnum, u8 posx, u8 posy, u8 sizx, u8 sizy, u8 palnum, u8 dir );

//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウの破棄
 *
 * @param	bmpwin	ビットマップウインドウポインタ
 */
//--------------------------------------------------------------------------------------------
extern void GFL_BMPWIN_Delete( GFL_BMPWIN* bmpwin );

//--------------------------------------------------------------------------------------------
/**
 *
 * 描画制御
 *
 */
//--------------------------------------------------------------------------------------------
//---------------------------------------------------------
/**
 * ビットマップ用キャラクターを内部バッファからＶＲＡＭへ転送
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
extern	void	GFL_BMPWIN_TransVramCharacter( GFL_BMPWIN * bmpwin );

//---------------------------------------------------------
/**
 * ビットマップ用スクリーンを関連ＢＧスクリーンバッファに作成する
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
extern	void	GFL_BMPWIN_MakeScreen( GFL_BMPWIN * bmpwin );

//---------------------------------------------------------
/**
 * 関連ＢＧスクリーンバッファのビットマップ用スクリーンをクリアする
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
extern	void	GFL_BMPWIN_ClearScreen( GFL_BMPWIN * bmpwin );

//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウステータス取得
 */
//--------------------------------------------------------------------------------------------
//--------------------------------
/**
 *
 * フレームナンバーの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	フレームナンバー
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetFrame( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * BMP領域のXサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	BMP領域のXサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetSizeX( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * BMP領域のYサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	BMP領域のYサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetSizeY( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * スクリーンXサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	スクリーンXサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetScreenSizeX( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * スクリーンYサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	スクリーンYサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetScreenSizeY( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * 描画Xサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	描画Xサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetPosX( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * 描画Yサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	描画Yサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetPosY( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * キャラクターナンバーの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	キャラクターナンバー
 */
//--------------------------------
extern	u16	GFL_BMPWIN_GetChrNum( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * ビットマップポインタの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	ビットマップポインタ
 */
//--------------------------------
extern	GFL_BMP_DATA*	GFL_BMPWIN_GetBmp( GFL_BMPWIN * bmpwin );

//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウステータス変更
 */
//--------------------------------------------------------------------------------------------
//--------------------------------
/**
 * 描画X座標の変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	px		セットする描画X座標
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetPosX( GFL_BMPWIN * bmpwin, u8 px );

//--------------------------------
/**
 * 描画Y座標の変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	py		セットする描画Y座標
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetPosY( GFL_BMPWIN * bmpwin, u8 py );

//--------------------------------
/**
 * スクリーン描画サイズXの変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	sx		セットするスクリーン描画サイズX
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetScreenSizeX( GFL_BMPWIN * bmpwin, u8 sx );

//--------------------------------
/**
 * スクリーン描画サイズＹの変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	sy		セットするスクリーン描画サイズY
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetScreenSizeY( GFL_BMPWIN * bmpwin, u8 sy );

//--------------------------------
/**
 * パレットナンバーの変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	palnum	セットするパレットナンバー
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetPalette( GFL_BMPWIN * bmpwin, u8 palnum );

#ifdef __cplusplus
}/* extern "C" */
#endif

#endif
