//============================================================================================
/**
 * @file	trtype_gra.h
 * @bfief	トレーナーグラフィックインデックスファイル定義
 * @author	TrainerDataConverter
 * @author	このファイルは、コンバータが吐き出したファイルです
*/
//============================================================================================

#pragma once

static	const	u8	TrTypeGraTable[]={
	0, //男主人公
	1,	//女主人公
	2,		//たんぱんこぞう
	3,		//ミニスカート
	4,		//じゅくがえり
	5,		//じゅくがえり
	6,		//テニスプレイヤー
	7,		//フットボーラー
	8,		//ウエーター
	9,		//ウエートレス
	10,		//ジムリーダー
	11,		//ジムリーダー
	12,		//ジムリーダー
	13,		//ほいくし
	14,		//えんじ
	15,		//えんじ
	16,		//ふたごちゃん
	17,		//ポケモンブリーダー
	18,		//ポケモンブリーダー
	19,		//ジムリーダー
	20,		//ジムリーダー
	21,		//ジムリーダー
	22,		//ジムリーダー
	23,		//ジムリーダー
	24,		//ポケモンレンジャー
	25,		//ポケモンレンジャー
	26,		//さぎょういん
	27,		//バックパッカー
	28,		//バックパッカー
	29,		//つりびと
	30,		//ミュージシャン
	31,		//ダンサー
	32,		//クラウン
	33,		//げいじゅつか
	34,		//ベーカリー
	35,		//サイキッカー
	36,		//サイキッカー
	37,		//ポケモントレーナー
	38,		//ポケモントレーナー
	39,		//プラズマだん
	40,		//ポケモントレーナー
	41,		//おぼっちゃま
	42,		//おじょうさま
	43,		//パイロット
	44,		//さぎょういん
	45,		//バスケせんしゅ
	46,		//けんきゅういん
	40,		//プラズマだん
	47,		//ＯＬ
	48,		//エリートトレーナー
	49,		//エリートトレーナー
	50,		//カラテおう
	51,		//けんきゅういん
	52,		//サッカーせんしゅ
	53,		//ジムリーダー
	54,		//ジムリーダー
	55,		//ジムリーダー
	56,		//スキンヘッズ
	57,		//せいそういん
	58,		//だいすきクラブ
	59,		//だいすきクラブ
	60,		//ドクター
	61,		//ナース
	62,		//バッドチーム
	63,		//バトルガール
	64,		//パラソルおねえさん
	65,		//ビジネスマン
	66,		//ビジネスマン
	67,		//ファンクラブ
	68,		//ファンクラブ
	69,		//ベテラントレーナー
	70,		//ベテラントレーナー
	71,		//ぼうそうぞく
	72,		//やきゅうせんしゅ
	73,		//やまおとこ
	74,		//マダム
	75,		//ジェントルマン
	76,		//プラズマだん
	77,		//してんのう
	78,		//してんのう
	79,		//してんのう
	80,		//してんのう
	81,		//プラズマだん
	82,		//てつどういん
	83,		//かいパンやろう
	84,		//ビキニのおねえさん
	85,		//おまわりさん
	86,		//メイド
	87,		//サブウェイマスター
	88,		//チャンピオン
	89,		//サイクリング
	90,		//サイクリング
	71,		//バイクずき
	4,		//ブルジョワールけ
	70,		//ブルジョワールけ
	74,		//ブルジョワールけ
	75,		//ブルジョワールけ
	69,		//ゲームフリーク
	42,		//ブルジョワールけ
	41,		//ブルジョワールけ
	91,		//ポケモントレーナー
	40,		//プラズマだん
	92,		//サブウェイマスター
	93, //男主人公（シューター）
	94,	//女主人公（シューター）
};

