//============================================================================================
/**
 * @file  mb_bmp.c
 * @brief メールボックス画面 BMP関連
 * @author  Akito Mori / Hiroyuki Nakamura
 * @date  09.12.03
 */
//============================================================================================
#ifndef __MB_BMP_H__
#define __MB_BMP_H__

//============================================================================================
//  定数定義
//============================================================================================

//「メールをけす」メッセージＩＤ
enum {
  MBBMP_DELMSG_ID_CHECK = 0,  //「ないようは　きえて　しまいますが　よろしい　ですか？」
  MBBMP_DELMSG_ID_ERASE,    //「ないようを　けしました」
  MBBMP_DELMSG_ID_POKE,   //「ポケモンに　もたせますか？」
  MBBMP_DELMSG_ID_BAG,    //「ないようを　けした　メールを バッグに　しまいました」
  MBBMP_DELMSG_ID_DELETE,   //「バッグが　いっぱいです… メールを　すてました」
};


//============================================================================================
//  プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * ＢＭＰ関連初期化
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_Init( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * ＢＭＰ関連削除
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_Exit( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * メール選択ボタンにＢＭＰをセット
 *
 * @param syswk メールボックス画面システムワーク
 * @param frmID BGWINFRMのID
 * @param winID BMPWINのID
 * @param mailID  メールデータのID
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_MailButtonSet( MAILBOX_SYS_WORK * syswk, u32 frmID, u32 winID, u32 mailID );

//--------------------------------------------------------------------------------------------
/**
 * デフォルト文字セット
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_DefaultStrSet( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * 「とじる」表示
 *
 * @param appwk メールボックス画面アプリワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_ClosePut( MAILBOX_APP_WORK * appwk );

//--------------------------------------------------------------------------------------------
/**
 * 「やめる」表示
 *
 * @param appwk メールボックス画面アプリワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_ReturnPut( MAILBOX_APP_WORK * appwk );

//--------------------------------------------------------------------------------------------
/**
 * ページ表示
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_PagePut( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * メール選択時のメッセージ表示
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_SelectMsgPut( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * メッセージウィンドウ表示
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_TalkWinPut( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * メッセージウィンドウ非表示
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_TalkWinDel( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * 「メールをけす」メッセージ表示
 *
 * @param syswk メールボックス画面システムワーク
 * @param id    メッセージＩＤ
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_DeleteMsgPut( MAILBOX_SYS_WORK * syswk, u32 id );

//--------------------------------------------------------------------------------------------
/**
 * メールの内容表示
 *
 * @param syswk メールボックス画面システムワーク
 *
 * @return  none
 */
//--------------------------------------------------------------------------------------------
extern void MBBMP_MailMesPut( MAILBOX_SYS_WORK * syswk );


#endif  // MB_BMP_H
