//============================================================================================
/**
 * @file	mb_ui.h
 * @brief	メールボックス画面 インターフェース関連
 * @author	Hiroyuki Nakamura
 * @date	09.01.31
 */
//============================================================================================
#ifndef MB_UI_H
#define	MB_UI_H

//============================================================================================
//	定数定義
//============================================================================================

// カーソル選択定義
enum {
	// メール選択
	MBUI_MAILSEL_MAIL1 = 0,		// 00: メール１
	MBUI_MAILSEL_MAIL2,			// 01: メール２
	MBUI_MAILSEL_MAIL3,			// 02: メール３
	MBUI_MAILSEL_MAIL4,			// 03: メール４
	MBUI_MAILSEL_MAIL5,			// 04: メール５
	MBUI_MAILSEL_MAIL6,			// 05: メール６
	MBUI_MAILSEL_MAIL7,			// 06: メール７
	MBUI_MAILSEL_MAIL8,			// 07: メール８
	MBUI_MAILSEL_MAIL9,			// 08: メール９
	MBUI_MAILSEL_MAIL10,		// 09: メール１０
	MBUI_MAILSEL_RETURN,		// 10: やめる
};


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * ページ切り替え矢印タッチチェック
 *
 * @param	syswk	メールボックス画面システムワーク
 *
 * @return	結果
 */
//--------------------------------------------------------------------------------------------
extern u32 MBUI_MailSelArrowCheck( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * カーソル移動初期化
 *
 * @param	syswk	メールボックス画面システムワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void MBUI_CursorMoveInit( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * カーソル移動削除
 *
 * @param	syswk	メールボックス画面システムワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void MBUI_CursorMoveExit( MAILBOX_SYS_WORK * syswk );

//--------------------------------------------------------------------------------------------
/**
 * メール選択のカーソル位置セット
 *
 * @param	work		メールボックス画面システムワーク
 * @param	pos			位置
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void MBUI_MailSelCurMove( MAILBOX_SYS_WORK * syswk, int pos );

//--------------------------------------------------------------------------------------------
/**
 * 「メールをよむ」画面キー・タッチチェック
 *
 * @param	none
 *
 * @retval	"TRUE = 終了"
 * @retval	"FALSE = それ以外"
 */
//--------------------------------------------------------------------------------------------
extern BOOL MBUI_MailReadCheck(void);


#endif	// MB_UI_H
