//==============================================================================
/**
 * @file    comm_player_support.h
 * @brief   通信プレイヤーからのサポート
 * @author  matsuda
 * @date    2009.12.10(木)
 */
//==============================================================================
#pragma once

#include "gamesystem/gamedata_def.h"
#include "savedata/mystatus.h"


//==============================================================================
//  型定義
//==============================================================================
///通信プレイヤーサポート型
typedef struct _COMM_PLAYER_SUPPORT COMM_PLAYER_SUPPORT;




//==============================================================================
//  定数定義
//==============================================================================
///サポートタイプ
typedef enum{
  SUPPORT_TYPE_NULL,            ///<サポート無し
  SUPPORT_TYPE_RECOVER_HALF,    ///<回復(半分)
  SUPPORT_TYPE_RECOVER_FULL,    ///<回復(全快)
  
  SUPPORT_TYPE_USED,            ///<サポート効果使用済み
}SUPPORT_TYPE;




//==============================================================================
//  外部関数宣言
//==============================================================================
//==================================================================
/**
 * サポートデータAlloc
 *
 * @param   cps		
 */
//==================================================================
extern COMM_PLAYER_SUPPORT * COMM_PLAYER_SUPPORT_Alloc(HEAPID heap_id);

//==================================================================
/**
 * サポートデータFreeMemory
 *
 * @param   cps		
 */
//==================================================================
extern void COMM_PLAYER_SUPPORT_Free(COMM_PLAYER_SUPPORT *cps);

//==================================================================
/**
 * サポートデータ初期化
 *
 * @param   cps		
 */
//==================================================================
extern void COMM_PLAYER_SUPPORT_Init(COMM_PLAYER_SUPPORT *cps);

//==================================================================
/**
 * サポートパラメータをセットする
 *
 * @param   dest_cps		
 * @param   type		    
 * @param   mystatus		
 */
//==================================================================
extern void COMM_PLAYER_SUPPORT_SetParam(
  COMM_PLAYER_SUPPORT *dest_cps, SUPPORT_TYPE type, const MYSTATUS *mystatus);

//==================================================================
/**
 * サポートデータからMYSTATUSを取得
 *
 * @param   cps		
 *
 * @retval  const MYSTATUS *		
 */
//==================================================================
extern const MYSTATUS * COMM_PLAYER_SUPPORT_GetMyStatus(const COMM_PLAYER_SUPPORT *cps);

//==================================================================
/**
 * サポートデータからサポートタイプを取得
 *
 * @param   cps		
 *
 * @retval  SUPPORT_TYPE		
 */
//==================================================================
extern SUPPORT_TYPE COMM_PLAYER_SUPPORT_GetSupportType(const COMM_PLAYER_SUPPORT *cps);

//==================================================================
/**
 * サポートデータを使用済み状態にする
 *
 * @param   cps		
 */
//==================================================================
extern void COMM_PLAYER_SUPPORT_SetUsed(COMM_PLAYER_SUPPORT *cps);

//==================================================================
/**
 * 戦闘後の状況の反映
 *
 * @param   cps		
 */
//==================================================================
extern void COMM_PLAYER_SUPPORT_SetBattleEnd(COMM_PLAYER_SUPPORT *cps);

//==================================================================
/**
 * 戦闘後、サポートが発生していたかチェック
 *
 * @param   cps		
 *
 * @retval  BOOL		TRUE:サポートが発生していた
 */
//==================================================================
extern BOOL COMM_PLAYER_SUPPORT_GetBattleEndSupportType(const COMM_PLAYER_SUPPORT *cps);

//==================================================================
/**
 * 戦闘後に使用するツール：実際に助けてくれた人のMYSTATUSを取得する
 *
 * @param   cps		
 *
 * @retval  const MYSTATUS *		
 *
 * 戦闘画面で反映されたサポートがいるならその人優先
 * 反映されたサポートがないなら最後に受信している人のデータを返す
 */
//==================================================================
extern const MYSTATUS * COMM_PLAYER_SUPPORT_GetSupportedMyStatus(const COMM_PLAYER_SUPPORT *cps);


//==============================================================================
//  gamedata
//==============================================================================
//==================================================================
/**
 * サポートデータへのポインタ取得
 *
 * @param   gamedata		
 *
 * @retval  COMM_PLAYER_SUPPORT *		
 */
//==================================================================
extern COMM_PLAYER_SUPPORT * GAMEDATA_GetCommPlayerSupportPtr(GAMEDATA * gamedata);
