//==============================================================================
/**
 * @file    msgspeed.h
 * @brief   ユーザコンフィグ等、各種条件からメッセージ表示速度を決定する
 * @author  taya
 * @date    2009.04.06
 *
 *  メッセージ表示速度は“１文字ごとのウェイトフレーム数”です。
 *  この値は、プレイヤーが設定した CONFIGデータの値によって決定されるので
 *  本来はこの値が必要になる全ての個所で CONFIGデータポインタを引き継いで参照すべきですが、
 *  範囲が大きく処理が煩雑になるのを回避するため、グローバルに近い間隔で
 *  必要な値を参照できるよう、作成したものです。
 */
//==============================================================================
#ifndef __MSGSPEED_H__
#define __MSGSPEED_H__

#include "savedata\save_control.h"
#include "savedata\config.h"

//=============================================================================================
/**
 * システム初期化 - 速度決定に必要な情報へのアクセサを渡す -
 * ※ゲーム起動後に１回だけ呼びだし。
 *
 * @param   ctrl    セーブデータコントローラ
 *
 */
//=============================================================================================
extern void MSGSPEED_InitSystem( const SAVE_CONTROL_WORK* ctrl );

//=============================================================================================
/**
 * ウェイトフレーム数取得
 *
 * @retval  int   ウェイトフレーム数（この値を PRINTSYS_PrintStream 等の wait 値としてそのまま使う）
 */
//=============================================================================================
extern int MSGSPEED_GetWait( void );

//=============================================================================================
/**
 * “速い”ウェイトフレーム数を取得（gmmでメッセージ速度コントロール 'FAST' にした時のフレーム数）
 *
 * @retval  int
 */
//=============================================================================================
extern int MSGSPEED_GetWaitFast( void );

//=============================================================================================
/**
 * “遅い”ウェイトフレーム数を取得（gmmでメッセージ速度コントロール 'SLOW' にした時のフレーム数）
 *
 * @retval  int
 */
//=============================================================================================
extern int MSGSPEED_GetWaitSlow( void );

//=============================================================================================
/**
 * CONFIG設定値に対応したウェイトフレーム数取得
 *
 * @param   speed   CONFIG設定値
 *
 * @retval  int   ウェイトフレーム数取得（この値を PRINTSYS_PrintStream 等の wait 値としてそのまま使う）
 */
//=============================================================================================
extern int MSGSPEED_GetWaitByConfigParam( MSGSPEED speed );


#endif
