//==============================================================================
/**
 * @file		msgspeed.h
 * @brief		ユーザコンフィグ等、各種条件からメッセージ表示速度を決定する
 * @author	taya
 * @date		2009.04.06
 */
//==============================================================================
#ifndef	__MSGSPEED_H__
#define	__MSGSPEED_H__

#include "savedata\save_control.h"

//=============================================================================================
/**
 * システム初期化 - 速度決定に必要な情報へのアクセサを渡す - 
 * ※ゲーム起動後に１回だけ呼びだし。
 *
 * @param   ctrl		セーブデータコントローラ
 *
 */
//=============================================================================================
extern void MSGSPEED_InitSystem( const SAVE_CONTROL_WORK* ctrl );

//=============================================================================================
/**
 * メッセージ速度取得
 *
 * @retval  int		メッセージ速度（この値を PRINTSYS_PrintStream 等の wait 値としてそのまま使う）
 */
//=============================================================================================
extern int MSGSPEED_GetWait( void );


#endif
