//============================================================================================
/**
 * @file	pm_season.h
 * @brief	ãGêﬂÇÃíËã`
 * @author	tamada GAME FREAK Inc.
 * @date	09.03.17
 *
 */
//============================================================================================

#pragma once

#ifdef	__cplusplus
extern "C" {
#endif

//============================================================================================
//============================================================================================

#define	PMSEASON_SPRING		(0)			/**!< èt */
#define	PMSEASON_SUMMER		(1)			/**!< âƒ */
#define	PMSEASON_AUTUMN		(2)			/**!< èH */
#define	PMSEASON_WINTER		(3)			/**!< ì~ */

#define	PMSEASON_TOTAL		(4)			/**!< ìñÇΩÇËëOÇæÇ™élãGÇÕÇSÇ¬ */


#ifndef __ASM_NO_DEF_ 
//--------------------------------------------------------------------------------------------
/**
 * @brief åªç›éûçèÇÃãGêﬂÇåvéZÇ∑ÇÈ
 *
 * @return åªç›éûçèÇÃãGêﬂ( PMSEASON_SPRING Ç»Ç« )
 */
//--------------------------------------------------------------------------------------------
extern u8 PMSEASON_GetCurrentSeasonID(); 

//--------------------------------------------------------------------------------------------
/**
 * @brief éüÇÃãGêﬂÇãÅÇﬂÇÈ
 *
 * @param now åªç›ÇÃãGêﬂ( PMSEASON_SPRING Ç»Ç« )
 *
 * @return éüÇÃãGêﬂ( PMSEASON_SPRING Ç»Ç« )
 */
//--------------------------------------------------------------------------------------------
extern u8 PMSEASON_GetNextSeasonID( u8 now );

//--------------------------------------------------------------------------------------------
/**
 * @brief ëOÇÃãGêﬂÇãÅÇﬂÇÈ
 *
 * @param now åªç›ÇÃãGêﬂ( PMSEASON_SPRING Ç»Ç« )
 *
 * @return ëOÇÃãGêﬂ( PMSEASON_SPRING Ç»Ç« )
 */
//--------------------------------------------------------------------------------------------
extern u8 PMSEASON_GetPrevSeasonID( u8 now );
#endif  // __ASM_NO_DEF_


#ifdef	__cplusplus
} /* extern "C" */
#endif

