//============================================================================================
/**
 * @file	pm_season.h
 * @brief	ãGêﬂÇÃíËã`
 * @author	tamada GAME FREAK Inc.
 * @date	09.03.17
 *
 */
//============================================================================================

#pragma once

#ifdef	__cplusplus
extern "C" {
#endif

//============================================================================================
//============================================================================================

#define	PMSEASON_SPRING		(0)			/**!< èt */
#define	PMSEASON_SUMMER		(1)			/**!< âƒ */
#define	PMSEASON_AUTUMN		(2)			/**!< èH */
#define	PMSEASON_WINTER		(3)			/**!< ì~ */

#define	PMSEASON_TOTAL		(4)			/**!< ìñÇΩÇËëOÇæÇ™élãGÇÕÇSÇ¬ */

#ifdef	__cplusplus
} /* extern "C" */
#endif

