//=============================================================================================
/**
 * @file	g3d_tool.h
 * @brief	g3d関連サポートツール
 * @date	2008.12.09
 * @author	tamada GAME FREAK inc.
 */
//=============================================================================================
#pragma once

#ifdef	__cplusplus
extern "C" {
#endif

#include <gflib.h>


#ifdef	PM_DEBUG
//==============================================================================
/**
 * @brief	初期化用関数
 */
//==============================================================================
extern void DEBUG_GFL_G3D_SetVManSize(GFL_G3D_VMAN_TEXSIZE texsize, GFL_G3D_VMAN_PLTSIZE pltsize);

//==============================================================================
/**
 * @brief	確保しているテクスチャVRAMのサイズを取得する
 * @return	u32		テクスチャVRAM確保サイズ
 *
 * DEBUG_GFL_G3D_SetVManSizeでの設定を元に値を返している
 */
//==============================================================================
extern u32 DEBUG_GFL_G3D_GetVManTextureSize(void);

//==============================================================================
/**
 * @brief	確保しているパレットVRAMのサイズを取得する
 * @return	u32		パレットVRAM確保サイズ
 *
 * DEBUG_GFL_G3D_SetVManSizeでの設定を元に値を返している
 */
//==============================================================================
extern u32 DEBUG_GFL_G3D_GetVManPaletteSize(void);

//==============================================================================
/**
 * @brief	VRAMへのテクスチゃ転送状態を取得する
 *
 * @return  u32		ＶＲＡＭ余り
 */
//==============================================================================
extern u32  DEBUG_GFL_G3D_GetBlankTextureSize(void);

//==============================================================================
/**
 * @brief	VRAMへのテクスチゃ転送状態を取得する
 *
 * @return  u32		使用しているＶＲＡＭ容量
 */
//==============================================================================
extern u32  DEBUG_GFL_G3D_GetUseTextureSize(void);

//==============================================================================
/**
 * @brief	リンクドPALマネージャーの転送状態を取得する
 *
 * @return  u32		パレット余りサイズ
 */
//==============================================================================
extern u32  DEBUG_GFL_G3D_GetBlankPaletteSize(void);

//==============================================================================
/**
 * @brief	リンクドPALマネージャーの転送状態を取得する
 *
 * @return  u32		リンクドPALマネージャーの転送バイト数
 */
//==============================================================================
extern u32  DEBUG_GFL_G3D_GetUsePaletteSize(void);


#endif

#ifdef	__cplusplus
}	/* extern "C" */
#endif
