//=============================================================================
/**
 * @file	date.h
 * @brief	年・月・日・曜日のアクセス処理
 * @author	by mori GAME FREAK Inc.
 * @date	2006.05.11 -> 2009.08.04 移植 nagihashi
 */
//=============================================================================
#pragma once
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------

// 作った理由はNitroSDKのRTCDate構造体が「年・月・日・曜日」の４つのメンバにu32を
// ひとつづつ充てていたからです。最大でも0-99なのでu8で十分。
// inline関数で宣言する事で、使用した人のソースにコードが展開されます。
// DSのRTCでも年は最大0～99まで。

typedef u32 GFDATE;

// 年・月・日・
// 曜日をパック（曜日はRTCWeek列挙型をNitroSDKから参照してください　日曜=0）



//------------------------------------------------------------------
/**
 * @brief   年・月・日・曜日のセット(入っている曜日が正しいかはチェックしてません）
 */
//------------------------------------------------------------------
static inline GFDATE GFDATE_Set( u32 year, u32 month, u32 day, int week)
{
	return (year<<24) | ((month&0xff)<<16) | ((day&0xff)<<8) | week;
}

//------------------------------------------------------------------
/**
 * @brief   NitroSDKの構造体からGFDATEに変換
 */
//------------------------------------------------------------------
static inline GFDATE GFDATE_RTCDate2GFDate( const RTCDate *RTCDate)
{
	return GFDATE_Set( RTCDate->year, RTCDate->month, RTCDate->day, RTCDate->week);
}


//------------------------------------------------------------------
/**
 * @brief   年を返す
 */
//------------------------------------------------------------------
static inline u8 GFDATE_GetYear( GFDATE gfDate )
{
	return gfDate>>24;
}

//------------------------------------------------------------------
/**
 * @brief   月を返す
 */
//------------------------------------------------------------------
static inline u8 GFDATE_GetMonth( GFDATE gfDate )
{
	return (gfDate>>16) & 0xff;
}

//------------------------------------------------------------------
/**
 * @brief   日を返す
 */
//------------------------------------------------------------------
static inline u8 GFDATE_GetDay( GFDATE gfDate )
{
	return (gfDate>>8) & 0xff;
}

//------------------------------------------------------------------
/**
 * @brief   曜日を返す（正しいかチェックはしていません）
 */
//------------------------------------------------------------------
static inline u8 GFDATE_GetWeek( GFDATE gfDate )
{
	return gfDate & 0xff;
}

//------------------------------------------------------------------
/**
 * @brief   GFDATEをNitroSDKの構造体に変換
 */
//------------------------------------------------------------------
static inline void GFDATE_GFDate2RTCDate( GFDATE src, RTCDate *des )
{
	des->year  = GFDATE_GetYear(  src );
	des->month = GFDATE_GetMonth( src );
	des->day   = GFDATE_GetDay(   src );
	des->week  = GFDATE_GetWeek(  src );
	
}
