//============================================================================
/**
 *
 *	@file		gra_tool.h
 *	@brief  グラフィックツール
 *	@author	goto / hosaka genya(GSから移植)
 *  @date	  2005.11.16
 *	@data	  2009.10.31(GSから移植)
 *
 */
//============================================================================
#pragma once

//=============================================================================
/**
 *								extern宣言
 */
//=============================================================================

//--------------------------------------------------------------
/**
 * @brief	rawdataを2D→1Dに変換する
 *
 * @param	pRawData			変換対象テクスチャデータ
 * @param	org_w				変換対象データ横幅
 * @param	x					変換対象矩形:x
 * @param	y					変換対象矩形:y
 * @param	w					変換対象矩形:w
 * @param	h					変換対象矩形:h
 * @param	buff				展開先バッファ
 *
 * @retval	none	
 *
 */
//--------------------------------------------------------------
extern void ChangesInto_RawData_1D_from_2D(void * pRawData, int  org_w, int x, int y, int w, int h, void* buff);

