/////////////////////////////////////////////////////////////////////////////////////
/**
 *
 * @brief  icaアニメーション カメラ応用関数
 * @file   ica_camera.h
 * @author obata
 * @date   2009.10.08
 *
 */
/////////////////////////////////////////////////////////////////////////////////////
#pragma once


//-----------------------------------------------------------------------------------
/**
 * @brief カメラ座標・ターゲット座標を現在フレームの状態に設定する
 *
 * @param camera  設定対象のカメラ
 * @param anime   設定アニメーション
 */
//-----------------------------------------------------------------------------------
extern void ICA_CAMERA_SetCameraStatus( GFL_G3D_CAMERA* camera, const ICA_ANIME* anime );

//-----------------------------------------------------------------------------------
/**
 * @brief カメラ座標を現在フレームの状態に設定する
 *
 * @param camera  設定対象のカメラ
 * @param anime   設定アニメーション
 */
//-----------------------------------------------------------------------------------
extern void ICA_CAMERA_SetCameraPos( GFL_G3D_CAMERA* camera, const ICA_ANIME* anime );

//-----------------------------------------------------------------------------------
/**
 * @brief 注視点座標を現在フレームの状態に設定する
 *
 * @param camera  設定対象のカメラ
 * @param anime   設定アニメーション
 */
//-----------------------------------------------------------------------------------
extern void ICA_CAMERA_SetTargetPos( GFL_G3D_CAMERA* camera, const ICA_ANIME* anime );
