//===================================================================
/**
 * @file  main.h
 * @brief アプリケーション　サンプルスケルトン
 * @author  GAME FREAK Inc.
 * @date  06.11.28
 *
 * $LastChangedDate$
 * $Id$
 */
//===================================================================

#pragma once

//------------------------------------------------------------------
/**
 * @brief heap_define.h 展開用マクロ定義
 *
 * enumの記述となるようにマクロを展開している
 */
//------------------------------------------------------------------
#define HEAP_DEFINE( heap_id )  heap_id,

//------------------------------------------------------------------
//親ヒープ用宣言
//------------------------------------------------------------------
enum{
  GFL_HEAPID_APP = GFL_HEAPID_SYSTEM + 1,
  GFL_HEAPID_MAX
};

//------------------------------------------------------------------
//子ヒープ用宣言
//------------------------------------------------------------------
enum{
  HEAPID_BG=GFL_HEAPID_MAX,   // 2

#include "system/heap_define.h"

  HEAPID_CHILD_MAX, //終端
};

//------------------------------------------------------------------
//  ヒープサイズ定義
//------------------------------------------------------------------
#define HEAPSIZE_SYSTEM (0x008000)
#define HEAPSIZE_APP    (0x186000)   // PL,GSでは約0x13A000
#define HEAPSIZE_DSI    (0x486000)   // DSIは16M

//将来的にTWLで増えたメモリは別HEAPIDから撮るための定義
#define GFL_HEAPID_TWL (GFL_HEAPID_APP)

