//===================================================================
/**
 * @file  main.h
 * @brief アプリケーション　サンプルスケルトン
 * @author  GAME FREAK Inc.
 * @date  06.11.28
 *
 * $LastChangedDate$
 * $Id$
 */
//===================================================================

#pragma once

//------------------------------------------------------------------
/**
 * @brief heap_define.h 展開用マクロ定義
 *
 * enumの記述となるようにマクロを展開している
 */
//------------------------------------------------------------------
#define HEAP_DEFINE( heap_id )  heap_id,

//------------------------------------------------------------------
//親ヒープ用宣言
//------------------------------------------------------------------
enum{
  GFL_HEAPID_APP = GFL_HEAPID_SYSTEM + 1,
  GFL_HEAPID_MAX
};

//------------------------------------------------------------------
//子ヒープ用宣言
//------------------------------------------------------------------
enum{
  HEAPID_BG=GFL_HEAPID_MAX,   // 2

#include "system/heap_define.h"

  HEAPID_CHILD_MAX, //終端
};

//将来的にTWLで増えたメモリは別HEAPIDから撮るための定義
#define GFL_HEAPID_TWL (GFL_HEAPID_APP)


//------------------------------------------------------------------
//  処理時間AVERAGE ON・OFF
//------------------------------------------------------------------
#ifdef PM_DEBUG

//#define DEBUG_MAIN_TIME_AVERAGE_MASTER_ON

#endif
