//==============================================================================
/**
 * @file    save_error_warning.h
 * @brief   セーブ読み書きに失敗した場合の警告画面
 * @author  matsuda
 * @date    2010.04.14(水)
 */
//==============================================================================
#pragma once


//==============================================================================
//  外部関数宣言
//==============================================================================
extern void SaveErrorCall_Load(void);
extern void SaveErrorCall_Save(GFL_SAVEERROR_DISABLE err_disable);
