//============================================================================================
/**
 * @file		scroll_bar.h
 * @brief		スクロールバー関連処理
 * @author	Hiroyuki Nakamura
 * @date		10.02.03
 *
 *	モジュール名：SCROLLBAR
 */
//============================================================================================
#pragma	once


//============================================================================================
//	定数定義
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * @brief		スクロールバーの表示Ｙ座標からスクロール値を取得
 *
 * @param		scrollMax			スクロール最大値
 * @param		py						スクロールバーの表示Ｙ座標
 * @param		railTop				レール上部のＹ座標
 * @param		railBottom		レール下部のＹ座標
 * @param		barSize				バーのＹサイズ
 *
 * @return	Ｙ座標
 */
//--------------------------------------------------------------------------------------------
extern u32 SCROLLBAR_GetCount( u32 scrollMax, u32 py, u32 railTop, u32 railBottom, u32 barSize );

//--------------------------------------------------------------------------------------------
/**
 * @brief		スクロールバーの表示Ｙ座標を取得
 *
 * @param		scrollMax			スクロール最大値
 * @param		scrollCount		現在のスクロール値
 * @param		railTop				レール上部のＹ座標
 * @param		railBottom		レール下部のＹ座標
 * @param		barSize				バーのＹサイズ
 *
 * @return	Ｙ座標
 */
//--------------------------------------------------------------------------------------------
extern u32 SCROLLBAR_GetPosY( u32 scrollMax, u32 scrollCount, u32 railTop, u32 railBottom, u32 barSize );
