//============================================================================================
/**
 * @file		time_icon.h
 * @brief		セーブ中などに表示されるタイマーアイコン処理
 * @author	Hiroyuki Nakamura
 * @date		10.02.22
 *
 *	モジュール名：TIMEICON
 */
//============================================================================================
#include <tcbl.h>
#pragma	once


//============================================================================================
//	定数定義
//============================================================================================

// タイマーアイコンワーク
typedef struct _TIMEICON_WORK	TIMEICON_WORK;

#define	TIMEICON_DEFAULT_WAIT		( 16 )		// デフォルトアニメウェイト


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * タイマーアイコン処理追加
 *
 * @param		tcbsys				GFL_TCBSYS
 * @param		msg_win				メッセージを表示しているウィンドウ
 * @param		clear_color		塗りつぶしカラー
 * @param		wait					アニメウェイト
 * @param		heapID				ヒープＩＤ
 *
 * @return	ワーク
 */
//--------------------------------------------------------------------------------------------
extern TIMEICON_WORK * TIMEICON_Create(
												GFL_TCBSYS * tcbsys, GFL_BMPWIN * msg_win, u8 clear_color, u8 wait, HEAPID heapID );
extern TIMEICON_WORK * TIMEICON_CreateTcbl( 
												GFL_TCBLSYS * tcblsys, GFL_BMPWIN * msg_win, u8 clear_color, u8 wait, HEAPID heapID );

//--------------------------------------------------------------------------------------------
/**
 * タイマーアイコン処理削除
 *
 * @param		wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void TILEICON_Exit( TIMEICON_WORK * wk );
