//=============================================================================================
/**
 * @file	btl_pokeselect.h
 * @brief	ポケモンWB バトルシステム	ポケモン選択画面用パラメータ等の定義
 * @author	taya
 *
 * @date	2008.09.25	作成
 */
//=============================================================================================
#ifndef __BTL_POKESELECT_H__
#define __BTL_POKESELECT_H__

#include "btl_common.h"
#include "btl_main.h"

//------------------------------------------------------
/**
 *	ポケモン選択画面用パラメータ
 */
//------------------------------------------------------
typedef struct {

	const BTL_PARTY*	party;				///< パーティデータ
	const u8*					idxOrder;			///< 現在の並び順
	u8								numSelect;		///< 選択するポケモン数
	u8								numProhibit;	///< 先頭からこの数まで、戦闘に出ているので選べない。（0なら無視して良い）
	u8								aliveOnly;		///< TRUEだと生きているポケモンしか選べない

}BTL_POKESELECT_PARAM;

//------------------------------------------------------
/**
 *	結果格納用構造体
 */
//------------------------------------------------------
typedef struct {

	u8			selIdx[ BTL_POSIDX_MAX ];	///< 選択したポケモンの並び順（現在の並び順で先頭を0と数える）
	u8			cnt;											///< 選択した数

}BTL_POKESELECT_RESULT;




#endif
