/*---------------------------------------------------------------------------*
  Project:  TwlWiFi - WCM - include
  File:     wcm.h

  Copyright 2007-2008 Nintendo.  All rights reserved.

  These coded instructions, statements, and computer programs contain
  proprietary information of Nintendo of America Inc. and/or Nintendo
  Company Ltd., and are protected by Federal copyright law.  They may
  not be disclosed to third parties or copied or duplicated in any form,
  in whole or in part, without the prior written consent of Nintendo.

  $Date:: 2008-12-10#$
  $Rev: 1108 $
  $Author: okajima_manabu $
 *---------------------------------------------------------------------------*/

#ifndef NITROWIFI_WCM_H_
#define NITROWIFI_WCM_H_

#ifdef __cplusplus

extern "C" {
#endif

/*===========================================================================*/
#include <nitro/types.h>
#include <nitro/wm.h>
#ifdef SDK_TWL
#include <twl/nwm.h>
#endif

/*---------------------------------------------------------------------------*
    定数 定義
 *---------------------------------------------------------------------------*/

// WCM ライブラリが必要とするワークバッファのサイズ
#define WCM_WORK_SIZE_WM            8960            // TBD
#define WCM_WORK_SIZE_NWM           18432           // 0x4800 TBD

#ifdef SDK_TWL
#define WCM_WORK_SIZE               WCM_WORK_SIZE_NWM
#else
#define WCM_WORK_SIZE               WCM_WORK_SIZE_WM
#endif

// 処理結果コード

#define WCM_OPTION_CHANNEL_RDC      (WCM_OPTION_CHANNEL_1 | WCM_OPTION_CHANNEL_7 | WCM_OPTION_CHANNEL_13)

// DCF 通信時のパワーセーブ設定
#define WCM_OPTION_TEST_POWER   0x00020000
#define WCM_OPTION_FILTER_POWER 0x00010000
#define WCM_OPTION_MASK_POWER   (WCM_OPTION_TEST_POWER | WCM_OPTION_FILTER_POWER)
#define WCM_OPTION_POWER_SAVE   (WCM_OPTION_TEST_POWER | 0x00000000)
#define WCM_OPTION_POWER_ACTIVE (WCM_OPTION_TEST_POWER | 0x00010000)

// AP との認証モード
#define WCM_OPTION_TEST_AUTH        0x00080000
#define WCM_OPTION_FILTER_AUTH      0x00040000
#define WCM_OPTION_MASK_AUTH        (WCM_OPTION_TEST_AUTH | WCM_OPTION_FILTER_AUTH)
#define WCM_OPTION_AUTH_OPENSYSTEM  (WCM_OPTION_TEST_AUTH | 0x00000000)
#define WCM_OPTION_AUTH_SHAREDKEY   (WCM_OPTION_TEST_AUTH | 0x00040000)

// スキャン種別
#define WCM_OPTION_TEST_SCANTYPE    0x00200000
#define WCM_OPTION_FILTER_SCANTYPE  0x00100000
#define WCM_OPTION_MASK_SCANTYPE    (WCM_OPTION_TEST_SCANTYPE | WCM_OPTION_FILTER_SCANTYPE)
#define WCM_OPTION_SCANTYPE_PASSIVE (WCM_OPTION_TEST_SCANTYPE | 0x00000000)
#define WCM_OPTION_SCANTYPE_ACTIVE  (WCM_OPTION_TEST_SCANTYPE | 0x00100000)

// スキャン一巡時の通知可否設定
#define WCM_OPTION_TEST_ROUNDSCAN   0x00800000
#define WCM_OPTION_FILTER_ROUNDSCAN 0x00400000
#define WCM_OPTION_MASK_ROUNDSCAN   (WCM_OPTION_TEST_ROUNDSCAN | WCM_OPTION_FILTER_ROUNDSCAN)
#define WCM_OPTION_ROUNDSCAN_IGNORE (WCM_OPTION_TEST_ROUNDSCAN | 0x00000000)
#define WCM_OPTION_ROUNDSCAN_NOTIFY (WCM_OPTION_TEST_ROUNDSCAN | 0x00400000)

// 使用する無線デバイス
#define WCM_DEVICEID_DEFAULT        0x00000000  // NITRO: WM, HYBRID: NWM, TWL: NWM
#define WCM_DEVICEID_WM             0x00000001
#define WCM_DEVICEID_NWM            0x00000002

#define WCM_DEBUGFLAG_DUMP_SEND     0x00000001
#define WCM_DEBUGFLAG_DUMP_RECV     0x00000002

#define WCM_SIZE_MACADDR            6
#define WCM_SIZE_ETHHDR             14

// 取得した BssDesc に含まれる Infomation Elements
#define WCM_IE_ID_EX_SUPPORT_RATE   50
#define WCM_IE_ID_ERP_INFORMATION_A  42
#define WCM_IE_ID_ERP_INFORMATION_B  47
#define WCM_IE_ID_COUNTRY           7
#define WCM_IE_ID_RSN               48

#define WCM_IE_ID_VENDOR_SPECIFIC   221 /* for WPA */

/*---------------------------------------------------------------------------*
    マクロ 定義
 *---------------------------------------------------------------------------*/
#define WCM_ROUNDUP32(_x_)      (((_x_) + 0x01f) &~(0x01f))
#define WCM_ROUNDDOWN32(_x_)    ((_x_) &~(0x01f))
#define WCM_ROUNDUP4(_x_)       (((_x_) + 0x03) &~(0x03))
#define WCM_ROUNDDOWN4(_x_)     ((_x_) &~(0x03))

/*---------------------------------------------------------------------------*
    型 定義
 *---------------------------------------------------------------------------*/

typedef WMLinkLevel             WCMLinkLevel;

/*---------------------------------------------------------------------------*
    構造体 定義
 *---------------------------------------------------------------------------*/

// WCM ライブラリ動作設定
typedef struct WCMConfig
{
    s32     dmano;      // WM が利用する DMA 番号 ( 0 〜 3 )
    void*   pbdbuffer;  // AP 情報保持領域アドレス
    s32     nbdbuffer;  // AP 情報保持領域サイズ ( バイト単位 )
    s32     nbdmode;    // AP 情報保持方法 ( WCM_APLIST_MODE_* )
} WCMConfig;

// WCM ライブラリ通知内 詳細パラメータ共用体
typedef union WCMNoticeParameter
{
    s32     n;          // 整数型
    void*   p;          // ポインタ型
} WCMNoticeParameter;

// WCM ライブラリ通知コールバックに渡される構造体
typedef struct WCMNotice
{
    s16 notify; // 通知種別 ( WCM_NOTIFY_* )
    s16 result; // 処理結果 ( WCM_RESULT_* )
    WCMNoticeParameter  parameter[3];   // 各種詳細パラメータ
} WCMNotice;

// WCM 通知コールバック関数 型定義
typedef void (*WCMNotify) (WCMNotice * arg);

// WEPキー設定構造体 (NitroWiFi との互換性のために残されている)
typedef struct WCMWepDesc
{
    u8  mode;                   // WEP 暗号化モード ( WCM_WEPMODE_* )
    u8  keyId;                  // WEP キー ID ( 0 〜 3 )
    u8  key[WM_SIZE_WEPKEY];    // WEP キーデータ列[ 20 * 4 バイト ]
} WCMWepDesc;

// 暗号化設定構造体 (WCMWepDesc の機能を含みキャストが可能)
typedef struct WCMPrivacyDesc
{
    u8  mode;                   // 暗号化モード ( WCM_PRIVACYMODE_* )
    union
    {
        u8  keyId;              // mode <= WCM_PRIVACYMODE_WEP128 の時
        u8  keyLen;             // mode >  WCM_PRIVACYMODE_WEP128 の時 (WPA)
    };
    u8  key[WM_SIZE_WEPKEY];
    u8  _reserved[2];
} WCMPrivacyDesc;

// WMBssDesc, NWMBssDesc の共通フィールドを持つ BssDesc
#pragma  warn_padding off
typedef struct WCMBssDesc
{
    u16             length;                    // 2
    u16             rssi;                      // 4
    u8              bssid[WM_SIZE_BSSID];      // 10
    u16             ssidLength;                // 12
    u8              ssid[WM_SIZE_SSID];        // 44
    u16             capaInfo;                  // 46
    struct
    {
        u16             basic;                 // 48
        u16             support;               // 50
    }
    rateSet;
    u16             beaconPeriod;              // 52
    u16             dtimPeriod;                // 54
    u16             channel;                   // 56
    u16             cfpPeriod;                 // 58
    u16             cfpMaxDuration;            // 60
    u16             gameInfoLength;            // 62
    union
    {
        u16             otherElementCount;
        u16             elementCount;
    };                                         // 64
    union
    {
        WMGameInfo      gameInfo;
        u16             elements[1];
    };
} WCMBssDesc;
#pragma  warn_padding reset

// WCMBssDesc に含まれる Information Element
typedef struct WCMInfoElement
{
    u8  identifier;
    u8  length;
    union
    {
        u8              information[1];
        struct
        {
            u8          oui[3];
            u8          ouiType;
            u8          data[1];
        } vender;
    };
} WCMInfoElement;

/*---------------------------------------------------------------------------*
    関数 定義
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
  Name:         WCM_Init
