//============================================================================================
/**
 * @file		zknlist_ui.h
 * @brief		図鑑リスト画面 インターフェイス関連
 * @author	Hiroyuki Nakamura
 * @date		09.12.14
 *
 *	モジュール名：ZKNLISTUI
 */
//============================================================================================
#pragma	once


//============================================================================================
//	定数定義
//============================================================================================

// 入力結果
enum {
	ZKNLISTUI_ID_POKE,			// 00: ポケモン正面絵

	ZKNLISTUI_ID_ICON1,			// 01: ポケモンアイコン
	ZKNLISTUI_ID_ICON2,			// 02: ポケモンアイコン
	ZKNLISTUI_ID_ICON3,			// 03: ポケモンアイコン
	ZKNLISTUI_ID_ICON4,			// 04: ポケモンアイコン
	ZKNLISTUI_ID_ICON5,			// 05: ポケモンアイコン
	ZKNLISTUI_ID_ICON6,			// 06: ポケモンアイコン
	ZKNLISTUI_ID_ICON7,			// 07: ポケモンアイコン

	ZKNLISTUI_ID_START,			// 08: スタート
	ZKNLISTUI_ID_SELECT,		// 09: セレクト
	ZKNLISTUI_ID_Y,					// 10: Ｙ
	ZKNLISTUI_ID_X,					// 11: Ｘ
	ZKNLISTUI_ID_RETURN,		// 12: 戻る

	ZKNLISTUI_ID_CANCEL,		// 13: キャンセルボタン
};


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * @brief		図鑑リスト画面入力処理
 *
 * @param		wk		図鑑リストワーク
 *
 * @return	入力結果
 */
//--------------------------------------------------------------------------------------------
extern int ZKNLISTUI_ListMain( ZKNLISTMAIN_WORK * wk );
