//============================================================================================
/**
 * @file		zukanlist.h
 * @brief		図鑑リスト画面
 * @author	Hiroyuki Nakamura
 * @date		09.12.15
 *
 *	モジュール名：ZUKANLIST
 */
//============================================================================================
#pragma	once

#include "gamesystem/game_data.h"


//============================================================================================
//	定数定義
//============================================================================================

typedef struct {
  GAMEDATA * gamedata;				// ゲームデータ
	ZUKAN_SAVEDATA * savedata;	// 図鑑セーブデータ

	u16	callMode;								// 呼び出しモード
	u16	listMax;								// リスト数
	u16 * list;									// リストデータ

	u16	retMode;								// 終了モード
	u16	retMons;								// 選択ポケモン
}ZUKANLIST_DATA;

// 呼び出しモード
enum {
	ZKNLIST_CALL_NORMAL = 0,	// 通常
	ZKNLIST_CALL_SEARCH,			// 検索モード
};

// 終了モード
enum {
	ZKNLIST_RET_EXIT = 0,			// 図鑑終了
	ZKNLIST_RET_EXIT_X,				// 図鑑を終了してメニューを閉じる
	ZKNLIST_RET_INFO,					// 詳細画面へ
	ZKNLIST_RET_SEARCH,				// 検索画面へ
};


#define	ZKNLIST_ITEM_MAX		( 7 )			// 画面上に表示されているリスト項目数


//============================================================================================
//	グローバル
//============================================================================================

// 図鑑PROCデータ
extern const GFL_PROC_DATA ZUKANLIST_ProcData;


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

FS_EXTERN_OVERLAY(zukan_list);
