//============================================================================
/**
 *
 *	@file		event_battle_call.h
 *	@brief  イベント：バトル呼び出し
 *	@author hosaka genya
 *	@data		2010.01.22
 *
 */
//============================================================================
#pragma once

#include <gflib.h>

#include "gamesystem/gamesystem.h"
#include "gamesystem/game_init.h"
#include "gamesystem/game_event.h"
#include "gamesystem/game_data.h"

#include "battle/battle.h"
#include "demo/comm_btl_demo.h"

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================
enum
{ 
  EVENT_BATTLE_ADD_CMD_TBL_TIMING = 1192, ///< 同期NO
};

//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================
//==============================================================================
//  構造体定義
//==============================================================================
typedef struct{
  GAMESYS_WORK * gsys;
  FIELDMAP_WORK * fieldmap;
  BATTLE_SETUP_PARAM  btl_setup_prm;
  COMM_BTL_DEMO_PARAM demo_prm;
}EVENT_BATTLE_CALL_WORK;

//=============================================================================
/**
 *								EXTERN宣言
 */
//=============================================================================

//-----------------------------------------------------------------------------
/**
 *	@brief  イベント：通信バトル呼び出し
 *
 *	@param	* event
 *	@param	*  seq
 *	@param	* work
 *
 *	@retval
 */
//-----------------------------------------------------------------------------
extern GMEVENT_RESULT EVENT_CommBattleMain(GMEVENT * event, int *  seq, void * work);

