//======================================================================
/**
 * @file	fieldmap_proc.h
 * @brief フィールドマップ　プロセス
 * @date	2008.11.18
 * @author	tamada GAME FREAK inc.
 */
//======================================================================
#pragma once
#include <gflib.h>
#include "system/gfl_use.h"
#include "gamesystem/gamesystem.h"

//======================================================================
//	define
//======================================================================

//======================================================================
//	struct
//======================================================================
///FIELDMAP
typedef struct _FIELDMAP_WORK FIELDMAP_WORK;
///旧構造体名FIELD_MAIN_WORKに対する仮対処 いずれ消しますので使用禁止
typedef struct _FIELDMAP_WORK FIELD_MAIN_WORK;

//======================================================================
//	extern
//======================================================================
//--------------------------------------------------------------
/**
 * フィールドマップの生成処理
 */
//--------------------------------------------------------------
extern FIELDMAP_WORK * FIELDMAP_Create( GAMESYS_WORK *gsys, HEAPID heapID );

//--------------------------------------------------------------
/**
 * フィールドマップの消去処理
 */
//--------------------------------------------------------------
extern void	FIELDMAP_Delete( FIELDMAP_WORK *fieldWork );

//--------------------------------------------------------------
/**
 * フィールドマップのメイン処理
 */
//--------------------------------------------------------------
extern BOOL	FIELDMAP_Main( GAMESYS_WORK *gsys, FIELDMAP_WORK *fieldWork );

//--------------------------------------------------------------
/**
 * フィールドマップの終了リクエスト
 */
//--------------------------------------------------------------
extern void FIELDMAP_Close( FIELDMAP_WORK *fieldWork );

//--------------------------------------------------------------
/**
 * フィールドマップの準備状態取得
 */
//--------------------------------------------------------------
extern const BOOL FIELDMAP_IsReady( const FIELDMAP_WORK *fieldWork );

//--------------------------------------------------------------
/**
 * フィールドマップの強制更新
 */
//--------------------------------------------------------------
extern void FIELDMAP_ForceUpdate( FIELDMAP_WORK *fieldWork );
