//============================================================================================
/**
 * @file	field_status.h
 * @brief フィールドマップ管理情報
 * @author  tamada GAMEFREAK inc.
 * @date    2009.10.03
 *
 * @note
 * field_status.hとfield_status_local.hとは対になっている。
 * field_status.hは、FIELD_STATUSというオブジェクトをメンバに持ったり、
 * 取得したりするためだけのヘッダ。（現状gamedata.hのみを想定）
 * field_status_local.hは、FIELD_STATUSの操作関数が含まれるヘッダ。
 * src/field以下のソースファイルのみでインクルードされることを想定している。
 */
//============================================================================================
#pragma once

#include "gamesystem/game_data.h"
//======================================================================
//======================================================================
//------------------------------------------------------------------
/**
 * @brief フィールドマップ情報への不完全型定義
 */
//------------------------------------------------------------------
typedef struct _FIELD_STATUS FIELD_STATUS;

//======================================================================
//======================================================================
//------------------------------------------------------------------
//------------------------------------------------------------------
extern FIELD_STATUS * FIELD_STATUS_Create(HEAPID heapID);

//------------------------------------------------------------------
//------------------------------------------------------------------
extern void FIELD_STATUS_Delete(FIELD_STATUS * fldstatus);

//==================================================================
/**
 * @brief
 * @param   gamedata		GAMEDATAへのポインタ
 * @return  FIELD_STATUS
 *
 * 実態はgamesystem/game_data.cにあるが、アクセス制限のため
 * こちらに配置する
 */
//==================================================================
extern FIELD_STATUS * GAMEDATA_GetFieldStatus(GAMEDATA * gamedata);

