//======================================================================
/**
 * @file	fieldmap_call.h
 * @brief フィールドマップ　プロセス呼び出し
 * @date	2008.11.18
 * @author	tamada GAME FREAK inc.
 *
 * 2009.09.20 fieldmap_proc.hから、FIELDMAPプロセスをよぶ部分を独立させた
 */
//======================================================================
#pragma once
#include <gflib.h>

#include "gamesystem/gamesystem.h"  //GAMESYS_WORK

#include "field/fieldmap_proc.h"  //FIELDMAP_WORK
//======================================================================
//	define
//======================================================================

//======================================================================
//	extern
//======================================================================
//--------------------------------------------------------------
/**
 * フィールドマップの生成処理
 */
//--------------------------------------------------------------
extern FIELDMAP_WORK * FIELDMAP_Create( GAMESYS_WORK *gsys, HEAPID heapID );

//--------------------------------------------------------------
/**
 * フィールドマップの消去処理
 */
//--------------------------------------------------------------
extern void	FIELDMAP_Delete( FIELDMAP_WORK *fieldWork );

//--------------------------------------------------------------
/**
 * フィールドマップのメイン処理
 */
//--------------------------------------------------------------
extern BOOL	FIELDMAP_Main( GAMESYS_WORK *gsys, FIELDMAP_WORK *fieldWork );

//--------------------------------------------------------------
/**
 * フィールドマップの終了リクエスト
 */
//--------------------------------------------------------------
extern void FIELDMAP_Close( FIELDMAP_WORK *fieldWork );

//--------------------------------------------------------------
/**
 * フィールドマップの準備状態取得
 */
//--------------------------------------------------------------
extern const BOOL FIELDMAP_IsReady( const FIELDMAP_WORK *fieldWork );

