//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		field_const.h
 *	@brief	フィールド外部公開定数
 *	@author	...
 *	@date		2009.07.23
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#ifdef _cplusplus
extern "C"{
#endif


//-----------------------------------------------------------------------------
/**
 *					グリッド幅単位(UNIT)
*/
//-----------------------------------------------------------------------------
#define FLD_CONST_GRID_SIZE					(16)
#define FLD_CONST_GRID_FX32_SIZE		(16<<FX32_SHIFT)

#ifdef _cplusplus
}	// extern "C"{
#endif



