//======================================================================
/**
 * @file	fieldmap_proc.h
 * @brief フィールドマップ　プロセス
 * @date	2008.11.18
 * @author	tamada GAME FREAK inc.
 *
 * @note
 * 2009.09.20 tamada  FIELDMAP_WORKへの参照とPROCアクセスのみを残して
 * 利用関数のexternはinclude/field/fieldmap_call.hに移動した
 */
//======================================================================
#pragma once
#include <gflib.h>

//======================================================================
//	define
//======================================================================

//======================================================================
//	struct
//======================================================================
///FIELDMAP
typedef struct _FIELDMAP_WORK FIELDMAP_WORK;


//======================================================================
//	extern
//======================================================================

extern const GFL_PROC_DATA FieldProcData;

FS_EXTERN_OVERLAY(fieldmap);

