//======================================================================
/**
 * @file	fieldmap_proc.h
 * @brief フィールドマップ　プロセス
 * @date	2008.11.18
 * @author	tamada GAME FREAK inc.
 *
 * @note
 * 2009.09.20 tamada  FIELDMAP_WORKへの参照とPROCアクセスのみを残して
 * 利用関数のexternはinclude/field/fieldmap_call.hに移動した
 */
//======================================================================
#pragma once
#include <gflib.h>

//======================================================================
//	define
//======================================================================
//--------------------------------------------------------------
///	フィールドマップ　コントロールタイプ
//--------------------------------------------------------------
typedef enum
{
	FLDMAP_CTRLTYPE_GRID = 0, ///<グリッドタイプ
	FLDMAP_CTRLTYPE_NOGRID, ///<非グリッドタイプ
	FLDMAP_CTRLTYPE_HYBRID, ///<グリッド、非グリッドハイブリット
	FLDMAP_CTRLTYPE_MAX,
}FLDMAP_CTRLTYPE;


//--------------------------------------------------------------
///	フィールドマップ　ベースシステムタイプ
//--------------------------------------------------------------
typedef enum
{
	FLDMAP_BASESYS_GRID = 0,  ///<ベースシステム　グリッド移動
	FLDMAP_BASESYS_RAIL,      ///<ベースシステム　レール移動
	FLDMAP_BASESYS_MAX,
}FLDMAP_BASESYS_TYPE;

//======================================================================
//	struct
//======================================================================
///FIELDMAP
typedef struct _FIELDMAP_WORK FIELDMAP_WORK;

//======================================================================
//	extern
//======================================================================
extern const GFL_PROC_DATA FieldProcData;

FS_EXTERN_OVERLAY(fieldmap);
