//==============================================================================
/**
 * @file    intrude_secret_item.h
 * @brief   侵入隠しアイテム
 * @author  matsuda
 * @date    2010.02.01(月)
 */
//==============================================================================
#pragma once

#include "gamesystem/gamesystem.h"


//==============================================================================
//  定数定義
//==============================================================================
///隠しアイテム配置場所テーブルにヒットしなかった場合の戻り値
#define ISC_SEARCH_NONE   (0xff)


//==============================================================================
//  構造体定義
//==============================================================================
///侵入隠しアイテム配置データ
typedef struct{
  u16 grid_x;
  u16 grid_y;
  u16 grid_z;
  u16 zone_id;
}INTRUDE_SECRET_ITEM_POSDATA;


//==============================================================================
//  外部データ
//==============================================================================
extern const INTRUDE_SECRET_ITEM_POSDATA IntrudeSecretItemPosDataTbl[];


//==============================================================================
//  外部関数宣言
//==============================================================================
//==================================================================
/**
 * 隠しアイテム配置テーブルに載っている座標かチェック
 *
 * @param   zone_id		ゾーンID
 * @param   grid_x		グリッド座標X
 * @param   grid_y		グリッド座標Y
 * @param   grid_z		グリッド座標Z
 *
 * @retval  int		    ヒットした場合：テーブル位置
 * @retval  int		    ヒットしなかった場合：ISC_SEARCH_NONE
 */
//==================================================================
extern int ISC_TblSearch(u16 zone_id, u16 grid_x, u16 grid_y, u16 grid_z);

//==================================================================
/**
 * 隠すアイテムを送信スタックへ載せる
 *
 * @param   gsys		ゲームシステムワークへのポインタ
 * @param   tblno		配置テーブル番号(ISC_TblSearchで取得した値)
 * @param   item		隠すアイテムの番号
 */
//==================================================================
extern void ISC_ItemSendStack(GAMESYS_WORK *gsys, int tblno, u16 item);
