//============================================================================================
/**
 *
 *
 * @file	field_func_nogrid_file.h
 * @brief	データを処理する関数群
 *
 *
 *
 */
//============================================================================================
#include "map\dp3format.h"
#include "../field_g3d_map.h"

enum {
	NOGRIDPACK_HEADER = 'N' + 'G' * 0x100,
};
//============================================================================================
/**
 * @brief	マップデータ読み込み
 */
//============================================================================================
extern BOOL FieldLoadMapData_NoGridFile( FLD_G3D_MAP* g3Dmap, void * exWork );
//============================================================================================
/**
 * @brief	３Ｄマップ情報取得
 */
//============================================================================================
extern void FieldGetAttr_NoGridFile( FLD_G3D_MAP_ATTRINFO* attrInfo,
									const void* mapdata, const VecFx32* posInBlock, 
									const fx32 map_width, const fx32 map_height );

