//============================================================================================
/**
 *
 *
 * @file	field_func_bridge_file.h
 * @brief	データを処理する関数群
 *
 *
 *
 */
//============================================================================================
#include "map\dp3format.h"

enum {
	BRIDGEPACK_HEADER = 'B' + 'R' * 0x100,
};
//============================================================================================
/**
 * @brief	マップデータ読み込み
 */
//============================================================================================
extern BOOL FieldLoadMapData_BridgeFile( GFL_G3D_MAP* g3Dmap );
//============================================================================================
/**
 * @brief	３Ｄマップ情報取得
 */
//============================================================================================
extern void FieldGetAttr_BridgeFile( GFL_G3D_MAP_ATTRINFO* attrInfo,
									const void* mapdata, const VecFx32* posInBlock, 
									const fx32 map_width, const fx32 map_height );

