//============================================================================
/**
 *  @file   pms_answer.h
 *  @brief  クイズの答えを記したヘッダーファイル
 *  @author pmsconv.pl
 *  @date   
 *  @note   pmsconv.plで生成されました。
 *
 *  モジュール名：
 */
//============================================================================
#pragma once

#define answer00 (1011) // アームハンマー
#define answer01 (1436) // おじいさん
#define answer02 (1680) // ダウジング
#define answer03 (1683) // デジタル
#define answer04 (1683) // デジタル
