////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @file   iss_city_sys.h
 * @brief  街ISSシステム
 * @author obata_toshihiro
 * @date   2009.07.16
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma once
#include <gflib.h>
#include "gamesystem/playerwork.h"


// 街ISSシステム構造体の不完全型の宣言
typedef struct _ISS_CITY_SYS ISS_CITY_SYS;


//----------------------------------------------------------------------------
/**
 * @brief  街ISSシステムを作成する
 *
 * @param  p_player 監視対象のプレイヤー
 * @param  heap_id  使用するヒープID
 * 
 * @return 街ISSシステム
 */
//----------------------------------------------------------------------------
extern ISS_CITY_SYS* ISS_CITY_SYS_Create( PLAYER_WORK* p_player, HEAPID heap_id );

//----------------------------------------------------------------------------
/**
 * @brief  街ISSシステムを破棄する
 *
 * @param p_sys 破棄する街ISSシステム 
 */
//----------------------------------------------------------------------------
extern void ISS_CITY_SYS_Delete( ISS_CITY_SYS* p_sys );

//----------------------------------------------------------------------------
/**
 * @brief プレイヤーを監視し, 音量を調整する
 *
 * @param p_sys 操作対象のシステム
 */
//----------------------------------------------------------------------------
extern void ISS_CITY_SYS_Update( ISS_CITY_SYS* p_sys );

//----------------------------------------------------------------------------
/**
 * @brief ゾーン切り替えを通知する
 *
 * @param p_sys       通知対象の街ISSシステム
 * @param next_zone_id 新しいゾーンID
 */
//----------------------------------------------------------------------------
extern void ISS_CITY_SYS_ZoneChange( ISS_CITY_SYS* p_sys, u16 next_zone_id );

//----------------------------------------------------------------------------
/**
 * @brief システムを起動する
 *
 * @param p_sys 起動するシステム
 */
//----------------------------------------------------------------------------
extern void ISS_CITY_SYS_On( ISS_CITY_SYS* p_sys );

//----------------------------------------------------------------------------
/**
 * @brief システムを停止させる
 *
 * @param p_sys 停止させるシステム
 */
//----------------------------------------------------------------------------
extern void ISS_CITY_SYS_Off( ISS_CITY_SYS* p_sys );

//----------------------------------------------------------------------------
/**
 * @breif 動作状態を取得する
 *
 * @param p_sys 状態を調べるISSシステム
 * 
 * @return 動作中かどうか
 */
//----------------------------------------------------------------------------
extern BOOL ISS_CITY_SYS_IsOn( const ISS_CITY_SYS* p_sys );
