$reverse_seed_poke_hash = {
	"フシギダネ" => [
		"フシギダネ",
		"フシギソウ",
		"フシギバナ",
	],
	"フシギソウ" => [
	],
	"フシギバナ" => [
	],
	"ヒトカゲ" => [
		"ヒトカゲ",
		"リザード",
		"リザードン",
	],
	"リザード" => [
	],
	"リザードン" => [
	],
	"ゼニガメ" => [
		"ゼニガメ",
		"カメール",
		"カメックス",
	],
	"カメール" => [
	],
	"カメックス" => [
	],
	"キャタピー" => [
		"キャタピー",
		"トランセル",
		"バタフリー",
	],
	"トランセル" => [
	],
	"バタフリー" => [
	],
	"ビードル" => [
		"ビードル",
		"コクーン",
		"スピアー",
	],
	"コクーン" => [
	],
	"スピアー" => [
	],
	"ポッポ" => [
		"ポッポ",
		"ピジョン",
		"ピジョット",
	],
	"ピジョン" => [
	],
	"ピジョット" => [
	],
	"コラッタ" => [
		"コラッタ",
		"ラッタ",
	],
	"ラッタ" => [
	],
	"オニスズメ" => [
		"オニスズメ",
		"オニドリル",
	],
	"オニドリル" => [
	],
	"アーボ" => [
		"アーボ",
		"アーボック",
	],
	"アーボック" => [
	],
	"ピカチュウ" => [
	],
	"ライチュウ" => [
	],
	"サンド" => [
		"サンド",
		"サンドパン",
	],
	"サンドパン" => [
	],
	"ニドラン♀" => [
		"ニドラン♀",
		"ニドリーナ",
		"ニドクイン",
		"ニドラン♂",
		"ニドリーノ",
		"ニドキング",
		"ニドラン♂",
		"ニドリーノ",
		"ニドキング",
	],
	"ニドリーナ" => [
	],
	"ニドクイン" => [
	],
	"ニドラン♂" => [
		"ニドラン♀",
		"ニドラン♂",
		"ニドリーノ",
		"ニドキング",
		"ニドラン♀",
	],
	"ニドリーノ" => [
	],
	"ニドキング" => [
	],
	"ピッピ" => [
	],
	"ピクシー" => [
	],
	"ロコン" => [
		"ロコン",
		"キュウコン",
	],
	"キュウコン" => [
	],
	"プリン" => [
	],
	"プクリン" => [
	],
	"ズバット" => [
		"ズバット",
		"ゴルバット",
		"クロバット",
	],
	"ゴルバット" => [
	],
	"ナゾノクサ" => [
		"ナゾノクサ",
		"クサイハナ",
		"ラフレシア",
		"キレイハナ",
	],
	"クサイハナ" => [
	],
	"ラフレシア" => [
	],
	"パラス" => [
		"パラス",
		"パラセクト",
	],
	"パラセクト" => [
	],
	"コンパン" => [
		"コンパン",
		"モルフォン",
	],
	"モルフォン" => [
	],
	"ディグダ" => [
		"ディグダ",
		"ダグトリオ",
	],
	"ダグトリオ" => [
	],
	"ニャース" => [
		"ニャース",
		"ペルシアン",
	],
	"ペルシアン" => [
	],
	"コダック" => [
		"コダック",
		"ゴルダック",
	],
	"ゴルダック" => [
	],
	"マンキー" => [
		"マンキー",
		"オコリザル",
	],
	"オコリザル" => [
	],
	"ガーディ" => [
		"ガーディ",
		"ウインディ",
	],
	"ウインディ" => [
	],
	"ニョロモ" => [
		"ニョロモ",
		"ニョロゾ",
		"ニョロボン",
		"ニョロトノ",
	],
	"ニョロゾ" => [
	],
	"ニョロボン" => [
	],
	"ケーシィ" => [
		"ケーシィ",
		"ユンゲラー",
		"フーディン",
	],
	"ユンゲラー" => [
	],
	"フーディン" => [
	],
	"ワンリキー" => [
		"ワンリキー",
		"ゴーリキー",
		"カイリキー",
	],
	"ゴーリキー" => [
	],
	"カイリキー" => [
	],
	"マダツボミ" => [
		"マダツボミ",
		"ウツドン",
		"ウツボット",
	],
	"ウツドン" => [
	],
	"ウツボット" => [
	],
	"メノクラゲ" => [
		"メノクラゲ",
		"ドククラゲ",
	],
	"ドククラゲ" => [
	],
	"イシツブテ" => [
		"イシツブテ",
		"ゴローン",
		"ゴローニャ",
	],
	"ゴローン" => [
	],
	"ゴローニャ" => [
	],
	"ポニータ" => [
		"ポニータ",
		"ギャロップ",
	],
	"ギャロップ" => [
	],
	"ヤドン" => [
		"ヤドン",
		"ヤドラン",
		"ヤドキング",
	],
	"ヤドラン" => [
	],
	"コイル" => [
		"コイル",
		"レアコイル",
		"ジバコイル",
	],
	"レアコイル" => [
	],
	"カモネギ" => [
		"カモネギ",
	],
	"ドードー" => [
		"ドードー",
		"ドードリオ",
	],
	"ドードリオ" => [
	],
	"パウワウ" => [
		"パウワウ",
		"ジュゴン",
	],
	"ジュゴン" => [
	],
	"ベトベター" => [
		"ベトベター",
		"ベトベトン",
	],
	"ベトベトン" => [
	],
	"シェルダー" => [
		"シェルダー",
		"パルシェン",
	],
	"パルシェン" => [
	],
	"ゴース" => [
		"ゴース",
		"ゴースト",
		"ゲンガー",
	],
	"ゴースト" => [
	],
	"ゲンガー" => [
	],
	"イワーク" => [
		"イワーク",
		"ハガネール",
	],
	"スリープ" => [
		"スリープ",
		"スリーパー",
	],
	"スリーパー" => [
	],
	"クラブ" => [
		"クラブ",
		"キングラー",
	],
	"キングラー" => [
	],
	"ビリリダマ" => [
		"ビリリダマ",
		"マルマイン",
	],
	"マルマイン" => [
	],
	"タマタマ" => [
		"タマタマ",
		"ナッシー",
	],
	"ナッシー" => [
	],
	"カラカラ" => [
		"カラカラ",
		"ガラガラ",
	],
	"ガラガラ" => [
	],
	"サワムラー" => [
	],
	"エビワラー" => [
	],
	"ベロリンガ" => [
		"ベロリンガ",
		"ベロベルト",
	],
	"ドガース" => [
		"ドガース",
		"マタドガス",
	],
	"マタドガス" => [
	],
	"サイホーン" => [
		"サイホーン",
		"サイドン",
		"ドサイドン",
	],
	"サイドン" => [
	],
	"ラッキー" => [
		"ラッキー",
		"ハピナス",
	],
	"モンジャラ" => [
		"モンジャラ",
		"モジャンボ",
	],
	"ガルーラ" => [
		"ガルーラ",
	],
	"タッツー" => [
		"タッツー",
		"シードラ",
		"キングドラ",
	],
	"シードラ" => [
	],
	"トサキント" => [
		"トサキント",
		"アズマオウ",
	],
	"アズマオウ" => [
	],
	"ヒトデマン" => [
		"ヒトデマン",
		"スターミー",
	],
	"スターミー" => [
	],
	"バリヤード" => [
		"バリヤード",
	],
	"ストライク" => [
		"ストライク",
		"ハッサム",
	],
	"ルージュラ" => [
	],
	"エレブー" => [
	],
	"ブーバー" => [
	],
	"カイロス" => [
		"カイロス",
	],
	"ケンタロス" => [
		"ケンタロス",
	],
	"コイキング" => [
		"コイキング",
		"ギャラドス",
	],
	"ギャラドス" => [
	],
	"ラプラス" => [
		"ラプラス",
	],
	"メタモン" => [
		"メタモン",
	],
	"イーブイ" => [
		"イーブイ",
		"シャワーズ",
		"サンダース",
		"ブースター",
		"エーフィ",
		"ブラッキー",
		"リーフィア",
		"グレイシア",
	],
	"シャワーズ" => [
	],
	"サンダース" => [
	],
	"ブースター" => [
	],
	"ポリゴン" => [
		"ポリゴン",
		"ポリゴン２",
		"ポリゴンＺ",
	],
	"オムナイト" => [
		"オムナイト",
		"オムスター",
	],
	"オムスター" => [
	],
	"カブト" => [
		"カブト",
		"カブトプス",
	],
	"カブトプス" => [
	],
	"プテラ" => [
		"プテラ",
	],
	"カビゴン" => [
		"カビゴン",
	],
	"フリーザー" => [
		"フリーザー",
	],
	"サンダー" => [
		"サンダー",
	],
	"ファイヤー" => [
		"ファイヤー",
	],
	"ミニリュウ" => [
		"ミニリュウ",
		"ハクリュー",
		"カイリュー",
	],
	"ハクリュー" => [
	],
	"カイリュー" => [
	],
	"ミュウツー" => [
		"ミュウツー",
	],
	"ミュウ" => [
		"ミュウ",
	],
	"チコリータ" => [
		"チコリータ",
		"ベイリーフ",
		"メガニウム",
	],
	"ベイリーフ" => [
	],
	"メガニウム" => [
	],
	"ヒノアラシ" => [
		"ヒノアラシ",
		"マグマラシ",
		"バクフーン",
	],
	"マグマラシ" => [
	],
	"バクフーン" => [
	],
	"ワニノコ" => [
		"ワニノコ",
		"アリゲイツ",
		"オーダイル",
	],
	"アリゲイツ" => [
	],
	"オーダイル" => [
	],
	"オタチ" => [
		"オタチ",
		"オオタチ",
	],
	"オオタチ" => [
	],
	"ホーホー" => [
		"ホーホー",
		"ヨルノズク",
	],
	"ヨルノズク" => [
	],
	"レディバ" => [
		"レディバ",
		"レディアン",
	],
	"レディアン" => [
	],
	"イトマル" => [
		"イトマル",
		"アリアドス",
	],
	"アリアドス" => [
	],
	"クロバット" => [
	],
	"チョンチー" => [
		"チョンチー",
		"ランターン",
	],
	"ランターン" => [
	],
	"ピチュー" => [
		"ピカチュウ",
		"ライチュウ",
		"ピチュー",
	],
	"ピィ" => [
		"ピッピ",
		"ピクシー",
		"ピィ",
	],
	"ププリン" => [
		"プリン",
		"プクリン",
		"ププリン",
	],
	"トゲピー" => [
		"トゲピー",
		"トゲチック",
		"トゲキッス",
	],
	"トゲチック" => [
	],
	"ネイティ" => [
		"ネイティ",
		"ネイティオ",
	],
	"ネイティオ" => [
	],
	"メリープ" => [
		"メリープ",
		"モココ",
		"デンリュウ",
	],
	"モココ" => [
	],
	"デンリュウ" => [
	],
	"キレイハナ" => [
	],
	"マリル" => [
		"マリル",
		"マリルリ",
	],
	"マリルリ" => [
	],
	"ウソッキー" => [
		"ウソッキー",
	],
	"ニョロトノ" => [
	],
	"ハネッコ" => [
		"ハネッコ",
		"ポポッコ",
		"ワタッコ",
	],
	"ポポッコ" => [
	],
	"ワタッコ" => [
	],
	"エイパム" => [
		"エイパム",
		"エテボース",
	],
	"ヒマナッツ" => [
		"ヒマナッツ",
		"キマワリ",
	],
	"キマワリ" => [
	],
	"ヤンヤンマ" => [
		"ヤンヤンマ",
		"メガヤンマ",
	],
	"ウパー" => [
		"ウパー",
		"ヌオー",
	],
	"ヌオー" => [
	],
	"エーフィ" => [
	],
	"ブラッキー" => [
	],
	"ヤミカラス" => [
		"ヤミカラス",
		"ドンカラス",
	],
	"ヤドキング" => [
	],
	"ムウマ" => [
		"ムウマ",
		"ムウマージ",
	],
	"アンノーンuna" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunb" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunc" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンund" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンune" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunf" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンung" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunh" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuni" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunj" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunk" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunl" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunm" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunn" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuno" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunp" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunq" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunr" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuns" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunt" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunu" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunv" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunw" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunx" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuny" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunz" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンexc" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンque" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"ソーナンス" => [
		"ソーナンス",
	],
	"キリンリキ" => [
		"キリンリキ",
	],
	"クヌギダマ" => [
		"クヌギダマ",
		"フォレトス",
	],
	"フォレトス" => [
	],
	"ノコッチ" => [
		"ノコッチ",
	],
	"グライガー" => [
		"グライガー",
		"グライオン",
	],
	"ハガネール" => [
	],
	"ブルー" => [
		"ブルー",
		"グランブル",
	],
	"グランブル" => [
	],
	"ハリーセン" => [
		"ハリーセン",
	],
	"ハッサム" => [
	],
	"ツボツボ" => [
		"ツボツボ",
	],
	"ヘラクロス" => [
		"ヘラクロス",
	],
	"ニューラ" => [
		"ニューラ",
		"マニューラ",
	],
	"ヒメグマ" => [
		"ヒメグマ",
		"リングマ",
	],
	"リングマ" => [
	],
	"マグマッグ" => [
		"マグマッグ",
		"マグカルゴ",
	],
	"マグカルゴ" => [
	],
	"ウリムー" => [
		"ウリムー",
		"イノムー",
		"マンムー",
	],
	"イノムー" => [
	],
	"サニーゴ" => [
		"サニーゴ",
	],
	"テッポウオ" => [
		"テッポウオ",
		"オクタン",
	],
	"オクタン" => [
	],
	"デリバード" => [
		"デリバード",
	],
	"マンタイン" => [
		"マンタイン",
	],
	"エアームド" => [
		"エアームド",
	],
	"デルビル" => [
		"デルビル",
		"ヘルガー",
	],
	"ヘルガー" => [
	],
	"キングドラ" => [
	],
	"ゴマゾウ" => [
		"ゴマゾウ",
		"ドンファン",
	],
	"ドンファン" => [
	],
	"ポリゴン２" => [
	],
	"オドシシ" => [
		"オドシシ",
	],
	"ドーブル" => [
		"ドーブル",
	],
	"バルキー" => [
		"サワムラー",
		"エビワラー",
		"バルキー",
		"カポエラー",
	],
	"カポエラー" => [
	],
	"ムチュール" => [
		"ルージュラ",
		"ムチュール",
	],
	"エレキッド" => [
		"エレブー",
		"エレキッド",
		"エレキブル",
	],
	"ブビィ" => [
		"ブーバー",
		"ブビィ",
		"ブーバーン",
	],
	"ミルタンク" => [
		"ミルタンク",
	],
	"ハピナス" => [
	],
	"ライコウ" => [
		"ライコウ",
	],
	"エンテイ" => [
		"エンテイ",
	],
	"スイクン" => [
		"スイクン",
	],
	"ヨーギラス" => [
		"ヨーギラス",
		"サナギラス",
		"バンギラス",
	],
	"サナギラス" => [
	],
	"バンギラス" => [
	],
	"ルギア" => [
		"ルギア",
	],
	"ホウオウ" => [
		"ホウオウ",
	],
	"セレビィ" => [
		"セレビィ",
	],
	"キモリ" => [
		"キモリ",
		"ジュプトル",
		"ジュカイン",
	],
	"ジュプトル" => [
	],
	"ジュカイン" => [
	],
	"アチャモ" => [
		"アチャモ",
		"ワカシャモ",
		"バシャーモ",
	],
	"ワカシャモ" => [
	],
	"バシャーモ" => [
	],
	"ミズゴロウ" => [
		"ミズゴロウ",
		"ヌマクロー",
		"ラグラージ",
	],
	"ヌマクロー" => [
	],
	"ラグラージ" => [
	],
	"ポチエナ" => [
		"ポチエナ",
		"グラエナ",
	],
	"グラエナ" => [
	],
	"ジグザグマ" => [
		"ジグザグマ",
		"マッスグマ",
	],
	"マッスグマ" => [
	],
	"ケムッソ" => [
		"ケムッソ",
		"カラサリス",
		"アゲハント",
		"マユルド",
		"ドクケイル",
	],
	"カラサリス" => [
	],
	"アゲハント" => [
	],
	"マユルド" => [
	],
	"ドクケイル" => [
	],
	"ハスボー" => [
		"ハスボー",
		"ハスブレロ",
		"ルンパッパ",
	],
	"ハスブレロ" => [
	],
	"ルンパッパ" => [
	],
	"タネボー" => [
		"タネボー",
		"コノハナ",
		"ダーテング",
	],
	"コノハナ" => [
	],
	"ダーテング" => [
	],
	"スバメ" => [
		"スバメ",
		"オオスバメ",
	],
	"オオスバメ" => [
	],
	"キャモメ" => [
		"キャモメ",
		"ペリッパー",
	],
	"ペリッパー" => [
	],
	"ラルトス" => [
		"ラルトス",
		"キルリア",
		"サーナイト",
		"エルレイド",
	],
	"キルリア" => [
	],
	"サーナイト" => [
	],
	"アメタマ" => [
		"アメタマ",
		"アメモース",
	],
	"アメモース" => [
	],
	"キノココ" => [
		"キノココ",
		"キノガッサ",
	],
	"キノガッサ" => [
	],
	"ナマケロ" => [
		"ナマケロ",
		"ヤルキモノ",
		"ケッキング",
	],
	"ヤルキモノ" => [
	],
	"ケッキング" => [
	],
	"ツチニン" => [
		"ツチニン",
		"テッカニン",
		"ヌケニン",
	],
	"テッカニン" => [
	],
	"ヌケニン" => [
	],
	"ゴニョニョ" => [
		"ゴニョニョ",
		"ドゴーム",
		"バクオング",
	],
	"ドゴーム" => [
	],
	"バクオング" => [
	],
	"マクノシタ" => [
		"マクノシタ",
		"ハリテヤマ",
	],
	"ハリテヤマ" => [
	],
	"ルリリ" => [
		"マリル",
		"マリルリ",
		"ルリリ",
	],
	"ノズパス" => [
		"ノズパス",
		"ダイノーズ",
	],
	"エネコ" => [
		"エネコ",
		"エネコロロ",
	],
	"エネコロロ" => [
	],
	"ヤミラミ" => [
		"ヤミラミ",
	],
	"クチート" => [
		"クチート",
	],
	"ココドラ" => [
		"ココドラ",
		"コドラ",
		"ボスゴドラ",
	],
	"コドラ" => [
	],
	"ボスゴドラ" => [
	],
	"アサナン" => [
		"アサナン",
		"チャーレム",
	],
	"チャーレム" => [
	],
	"ラクライ" => [
		"ラクライ",
		"ライボルト",
	],
	"ライボルト" => [
	],
	"プラスル" => [
		"プラスル",
	],
	"マイナン" => [
		"マイナン",
	],
	"バルビート" => [
		"バルビート",
		"イルミーゼ",
		"イルミーゼ",
	],
	"イルミーゼ" => [
		"バルビート",
		"イルミーゼ",
		"バルビート",
	],
	"ロゼリア" => [
		"ロゼリア",
		"ロズレイド",
	],
	"ゴクリン" => [
		"ゴクリン",
		"マルノーム",
	],
	"マルノーム" => [
	],
	"キバニア" => [
		"キバニア",
		"サメハダー",
	],
	"サメハダー" => [
	],
	"ホエルコ" => [
		"ホエルコ",
		"ホエルオー",
	],
	"ホエルオー" => [
	],
	"ドンメル" => [
		"ドンメル",
		"バクーダ",
	],
	"バクーダ" => [
	],
	"コータス" => [
		"コータス",
	],
	"バネブー" => [
		"バネブー",
		"ブーピッグ",
	],
	"ブーピッグ" => [
	],
	"パッチール" => [
		"パッチール",
	],
	"ナックラー" => [
		"ナックラー",
		"ビブラーバ",
		"フライゴン",
	],
	"ビブラーバ" => [
	],
	"フライゴン" => [
	],
	"サボネア" => [
		"サボネア",
		"ノクタス",
	],
	"ノクタス" => [
	],
	"チルット" => [
		"チルット",
		"チルタリス",
	],
	"チルタリス" => [
	],
	"ザングース" => [
		"ザングース",
	],
	"ハブネーク" => [
		"ハブネーク",
	],
	"ルナトーン" => [
		"ルナトーン",
	],
	"ソルロック" => [
		"ソルロック",
	],
	"ドジョッチ" => [
		"ドジョッチ",
		"ナマズン",
	],
	"ナマズン" => [
	],
	"ヘイガニ" => [
		"ヘイガニ",
		"シザリガー",
	],
	"シザリガー" => [
	],
	"ヤジロン" => [
		"ヤジロン",
		"ネンドール",
	],
	"ネンドール" => [
	],
	"リリーラ" => [
		"リリーラ",
		"ユレイドル",
	],
	"ユレイドル" => [
	],
	"アノプス" => [
		"アノプス",
		"アーマルド",
	],
	"アーマルド" => [
	],
	"ヒンバス" => [
		"ヒンバス",
		"ミロカロス",
	],
	"ミロカロス" => [
	],
	"ポワルンnormal" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"ポワルンsun" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"ポワルンrain" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"ポワルンsnow" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"カクレオン" => [
		"カクレオン",
	],
	"カゲボウズ" => [
		"カゲボウズ",
		"ジュペッタ",
	],
	"ジュペッタ" => [
	],
	"ヨマワル" => [
		"ヨマワル",
		"サマヨール",
		"ヨノワール",
	],
	"サマヨール" => [
	],
	"トロピウス" => [
		"トロピウス",
	],
	"チリーン" => [
		"チリーン",
	],
	"アブソル" => [
		"アブソル",
	],
	"ソーナノ" => [
		"ソーナンス",
		"ソーナノ",
	],
	"ユキワラシ" => [
		"ユキワラシ",
		"オニゴーリ",
		"ユキメノコ",
	],
	"オニゴーリ" => [
	],
	"タマザラシ" => [
		"タマザラシ",
		"トドグラー",
		"トドゼルガ",
	],
	"トドグラー" => [
	],
	"トドゼルガ" => [
	],
	"パールル" => [
		"パールル",
		"ハンテール",
		"サクラビス",
	],
	"ハンテール" => [
	],
	"サクラビス" => [
	],
	"ジーランス" => [
		"ジーランス",
	],
	"ラブカス" => [
		"ラブカス",
	],
	"タツベイ" => [
		"タツベイ",
		"コモルー",
		"ボーマンダ",
	],
	"コモルー" => [
	],
	"ボーマンダ" => [
	],
	"ダンバル" => [
		"ダンバル",
		"メタング",
		"メタグロス",
	],
	"メタング" => [
	],
	"メタグロス" => [
	],
	"レジロック" => [
		"レジロック",
	],
	"レジアイス" => [
		"レジアイス",
	],
	"レジスチル" => [
		"レジスチル",
	],
	"ラティアス" => [
		"ラティアス",
	],
	"ラティオス" => [
		"ラティオス",
	],
	"カイオーガ" => [
		"カイオーガ",
	],
	"グラードン" => [
		"グラードン",
	],
	"レックウザ" => [
		"レックウザ",
	],
	"ジラーチ" => [
		"ジラーチ",
	],
	"デオキシスnormal" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"デオキシスattack" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"デオキシスdefence" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"デオキシスspeed" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"ナエトル" => [
		"ナエトル",
		"ハヤシガメ",
		"ドダイトス",
	],
	"ハヤシガメ" => [
	],
	"ドダイトス" => [
	],
	"ヒコザル" => [
		"ヒコザル",
		"モウカザル",
		"ゴウカザル",
	],
	"モウカザル" => [
	],
	"ゴウカザル" => [
	],
	"ポッチャマ" => [
		"ポッチャマ",
		"ポッタイシ",
		"エンペルト",
	],
	"ポッタイシ" => [
	],
	"エンペルト" => [
	],
	"ムックル" => [
		"ムックル",
		"ムクバード",
		"ムクホーク",
	],
	"ムクバード" => [
	],
	"ムクホーク" => [
	],
	"ビッパ" => [
		"ビッパ",
		"ビーダル",
	],
	"ビーダル" => [
	],
	"コロボーシ" => [
		"コロボーシ",
		"コロトック",
	],
	"コロトック" => [
	],
	"コリンク" => [
		"コリンク",
		"ルクシオ",
		"レントラー",
	],
	"ルクシオ" => [
	],
	"レントラー" => [
	],
	"スボミー" => [
		"ロゼリア",
		"スボミー",
		"ロズレイド",
	],
	"ロズレイド" => [
	],
	"ズガイドス" => [
		"ズガイドス",
		"ラムパルド",
	],
	"ラムパルド" => [
	],
	"タテトプス" => [
		"タテトプス",
		"トリデプス",
	],
	"トリデプス" => [
	],
	"ミノムッチkusa" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
		"ミノマダムkusa",
		"ミノマダムjimen",
		"ミノマダムhagane",
		"ガーメイル",
	],
	"ミノムッチsuna" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
		"ミノマダムkusa",
		"ミノマダムjimen",
		"ミノマダムhagane",
		"ガーメイル",
	],
	"ミノムッチgomi" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
		"ミノマダムkusa",
		"ミノマダムjimen",
		"ミノマダムhagane",
		"ガーメイル",
	],
	"ミノマダムkusa" => [
	],
	"ミノマダムjimen" => [
	],
	"ミノマダムhagane" => [
	],
	"ガーメイル" => [
	],
	"ミツハニー" => [
		"ミツハニー",
		"ビークイン",
	],
	"ビークイン" => [
	],
	"パチリス" => [
		"パチリス",
	],
	"ブイゼル" => [
		"ブイゼル",
		"フローゼル",
	],
	"フローゼル" => [
	],
	"チェリンボ" => [
		"チェリンボ",
		"チェリムnega",
		"チェリムposi",
	],
	"チェリムnega" => [
	],
	"チェリムposi" => [
	],
	"カラナクシwest" => [
		"カラナクシwest",
		"カラナクシeast",
		"トリトドンwest",
		"トリトドンeast",
	],
	"カラナクシeast" => [
		"カラナクシwest",
		"カラナクシeast",
		"トリトドンwest",
		"トリトドンeast",
	],
	"トリトドンwest" => [
	],
	"トリトドンeast" => [
	],
	"エテボース" => [
	],
	"フワンテ" => [
		"フワンテ",
		"フワライド",
	],
	"フワライド" => [
	],
	"ミミロル" => [
		"ミミロル",
		"ミミロップ",
	],
	"ミミロップ" => [
	],
	"ムウマージ" => [
	],
	"ドンカラス" => [
	],
	"ニャルマー" => [
		"ニャルマー",
		"ブニャット",
	],
	"ブニャット" => [
	],
	"リーシャン" => [
		"チリーン",
		"リーシャン",
	],
	"スカンプー" => [
		"スカンプー",
		"スカタンク",
	],
	"スカタンク" => [
	],
	"ドーミラー" => [
		"ドーミラー",
		"ドータクン",
	],
	"ドータクン" => [
	],
	"ウソハチ" => [
		"ウソッキー",
		"ウソハチ",
	],
	"マネネ" => [
		"バリヤード",
		"マネネ",
	],
	"ピンプク" => [
		"ラッキー",
		"ハピナス",
		"ピンプク",
	],
	"ペラップ" => [
		"ペラップ",
	],
	"ミカルゲ" => [
		"ミカルゲ",
	],
	"フカマル" => [
		"フカマル",
		"ガバイト",
		"ガブリアス",
	],
	"ガバイト" => [
	],
	"ガブリアス" => [
	],
	"ゴンベ" => [
		"カビゴン",
		"ゴンベ",
	],
	"リオル" => [
		"リオル",
		"ルカリオ",
	],
	"ルカリオ" => [
	],
	"ヒポポタス" => [
		"ヒポポタス",
		"カバルドン",
	],
	"カバルドン" => [
	],
	"スコルピ" => [
		"スコルピ",
		"ドラピオン",
	],
	"ドラピオン" => [
	],
	"グレッグル" => [
		"グレッグル",
		"ドクロッグ",
	],
	"ドクロッグ" => [
	],
	"マスキッパ" => [
		"マスキッパ",
	],
	"ケイコウオ" => [
		"ケイコウオ",
		"ネオラント",
	],
	"ネオラント" => [
	],
	"タマンタ" => [
		"マンタイン",
		"タマンタ",
	],
	"ユキカブリ" => [
		"ユキカブリ",
		"ユキノオー",
	],
	"ユキノオー" => [
	],
	"マニューラ" => [
	],
	"ジバコイル" => [
	],
	"ベロベルト" => [
	],
	"ドサイドン" => [
	],
	"モジャンボ" => [
	],
	"エレキブル" => [
	],
	"ブーバーン" => [
	],
	"トゲキッス" => [
	],
	"メガヤンマ" => [
	],
	"リーフィア" => [
	],
	"グレイシア" => [
	],
	"グライオン" => [
	],
	"マンムー" => [
	],
	"ポリゴンＺ" => [
	],
	"エルレイド" => [
	],
	"ダイノーズ" => [
	],
	"ヨノワール" => [
	],
	"ユキメノコ" => [
	],
	"ロトムnormal" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムhot" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムwash" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムcold" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムfan" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムcut" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ユクシー" => [
		"ユクシー",
	],
	"エムリット" => [
		"エムリット",
	],
	"アグノム" => [
		"アグノム",
	],
	"ディアルガ" => [
		"ディアルガ",
	],
	"パルキア" => [
		"パルキア",
	],
	"ヒードラン" => [
		"ヒードラン",
	],
	"レジギガス" => [
		"レジギガス",
	],
	"ギラティナanother" => [
		"ギラティナanother",
		"ギラティナorigin",
	],
	"ギラティナorigin" => [
		"ギラティナanother",
		"ギラティナorigin",
	],
	"クレセリア" => [
		"クレセリア",
	],
	"フィオネ" => [
		"フィオネ",
		"マナフィ",
	],
	"マナフィ" => [
		"マナフィ",
	],
	"ダークライ" => [
		"ダークライ",
	],
	"シェイミland" => [
		"シェイミland",
		"シェイミsky",
	],
	"シェイミsky" => [
		"シェイミland",
		"シェイミsky",
	],
	"アルセウスnormal" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスbattle" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスhikou" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスpoison" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスjimen" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスiwa" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスmushi" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスghost" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスmetal" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスfire" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスwater" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスkusa" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスelectric" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスesper" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスkoori" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスdragon" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスaku" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"ビクティニ" => [
		"ビクティニ",
	],
	"ツタージャ" => [
		"ツタージャ",
		"ジャノビー",
		"ジャローダ",
	],
	"ジャノビー" => [
	],
	"ジャローダ" => [
	],
	"ポカブ" => [
		"ポカブ",
		"チャオブー",
		"エンブオー",
	],
	"チャオブー" => [
	],
	"エンブオー" => [
	],
	"ミジュマル" => [
		"ミジュマル",
		"フタチマル",
		"ダイケンキ",
	],
	"フタチマル" => [
	],
	"ダイケンキ" => [
	],
	"ミネズミ" => [
		"ミネズミ",
		"ミルホッグ",
	],
	"ミルホッグ" => [
	],
	"ヨーテリー" => [
		"ヨーテリー",
		"ハーデリア",
		"ムーランド",
	],
	"ハーデリア" => [
	],
	"ムーランド" => [
	],
	"チョロネコ" => [
		"チョロネコ",
		"レパルダス",
	],
	"レパルダス" => [
	],
	"ヤナップ" => [
		"ヤナップ",
		"ヤナッキー",
	],
	"ヤナッキー" => [
	],
	"バオップ" => [
		"バオップ",
		"バオッキー",
	],
	"バオッキー" => [
	],
	"ヒヤップ" => [
		"ヒヤップ",
		"ヒヤッキー",
	],
	"ヒヤッキー" => [
	],
	"ムンナ" => [
		"ムンナ",
		"ムシャーナ",
	],
	"ムシャーナ" => [
	],
	"マメパト" => [
		"マメパト",
		"ハトーボー",
		"ケンホロウ",
	],
	"ハトーボー" => [
	],
	"ケンホロウ" => [
	],
	"シママ" => [
		"シママ",
		"ゼブライカ",
	],
	"ゼブライカ" => [
	],
	"ダンゴロ" => [
		"ダンゴロ",
		"ガントル",
		"ギガイアス",
	],
	"ガントル" => [
	],
	"ギガイアス" => [
	],
	"コロモリ" => [
		"コロモリ",
		"ココロモリ",
	],
	"ココロモリ" => [
	],
	"モグリュー" => [
		"モグリュー",
		"ドリュウズ",
	],
	"ドリュウズ" => [
	],
	"タブンネ" => [
		"タブンネ",
	],
	"ドッコラー" => [
		"ドッコラー",
		"ドテッコツ",
		"ローブシン",
	],
	"ドテッコツ" => [
	],
	"ローブシン" => [
	],
	"オタマロ" => [
		"オタマロ",
		"ガマガル",
		"ガマゲロゲ",
	],
	"ガマガル" => [
	],
	"ガマゲロゲ" => [
	],
	"ナゲキ" => [
		"ナゲキ",
	],
	"ダゲキ" => [
		"ダゲキ",
	],
	"クルミル" => [
		"クルミル",
		"クルマユ",
		"ハハコモリ",
	],
	"クルマユ" => [
	],
	"ハハコモリ" => [
	],
	"フシデ" => [
		"フシデ",
		"ホイーガ",
		"ペンドラー",
	],
	"ホイーガ" => [
	],
	"ペンドラー" => [
	],
	"モンメン" => [
		"モンメン",
		"エルフーン",
	],
	"エルフーン" => [
	],
	"チュリネ" => [
		"チュリネ",
		"ドレディア",
	],
	"ドレディア" => [
	],
	"バスラオblack" => [
		"バスラオblack",
		"バスラオwhite",
	],
	"バスラオwhite" => [
		"バスラオblack",
		"バスラオwhite",
	],
	"メグロコ" => [
		"メグロコ",
		"ワルビル",
		"ワルビアル",
	],
	"ワルビル" => [
	],
	"ワルビアル" => [
	],
	"ダルマッカ" => [
		"ダルマッカ",
		"ヒヒダルマaction",
		"ヒヒダルマmeditation",
	],
	"ヒヒダルマaction" => [
	],
	"ヒヒダルマmeditation" => [
	],
	"マラカッチ" => [
		"マラカッチ",
	],
	"イシズマイ" => [
		"イシズマイ",
		"イワパレス",
	],
	"イワパレス" => [
	],
	"ズルッグ" => [
		"ズルッグ",
		"ズルズキン",
	],
	"ズルズキン" => [
	],
	"シンボラー" => [
		"シンボラー",
	],
	"デスマス" => [
		"デスマス",
		"デスカーン",
	],
	"デスカーン" => [
	],
	"プロトーガ" => [
		"プロトーガ",
		"アバゴーラ",
	],
	"アバゴーラ" => [
	],
	"アーケン" => [
		"アーケン",
		"アーケオス",
	],
	"アーケオス" => [
	],
	"ヤブクロン" => [
		"ヤブクロン",
		"ダストダス",
	],
	"ダストダス" => [
	],
	"ゾロア" => [
		"ゾロア",
		"ゾロアーク",
	],
	"ゾロアーク" => [
	],
	"チラーミィ" => [
		"チラーミィ",
		"チラチーノ",
	],
	"チラチーノ" => [
	],
	"ゴチム" => [
		"ゴチム",
		"ゴチミル",
		"ゴチルゼル",
	],
	"ゴチミル" => [
	],
	"ゴチルゼル" => [
	],
	"ユニラン" => [
		"ユニラン",
		"ダブラン",
		"ランクルス",
	],
	"ダブラン" => [
	],
	"ランクルス" => [
	],
	"コアルヒー" => [
		"コアルヒー",
		"スワンナ",
	],
	"スワンナ" => [
	],
	"バニプッチ" => [
		"バニプッチ",
		"バニリッチ",
		"バイバニラ",
	],
	"バニリッチ" => [
	],
	"バイバニラ" => [
	],
	"シキジカspring" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
		"メブキジカspring",
		"メブキジカsummer",
		"メブキジカautumn",
		"メブキジカwinter",
	],
	"シキジカsummer" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
		"メブキジカspring",
		"メブキジカsummer",
		"メブキジカautumn",
		"メブキジカwinter",
	],
	"シキジカautumn" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
		"メブキジカspring",
		"メブキジカsummer",
		"メブキジカautumn",
		"メブキジカwinter",
	],
	"シキジカwinter" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
		"メブキジカspring",
		"メブキジカsummer",
		"メブキジカautumn",
		"メブキジカwinter",
	],
	"メブキジカspring" => [
	],
	"メブキジカsummer" => [
	],
	"メブキジカautumn" => [
	],
	"メブキジカwinter" => [
	],
	"エモンガ" => [
		"エモンガ",
	],
	"カブルモ" => [
		"カブルモ",
		"シュバルゴ",
	],
	"シュバルゴ" => [
	],
	"タマゲタケ" => [
		"タマゲタケ",
		"モロバレル",
	],
	"モロバレル" => [
	],
	"プルリル" => [
		"プルリル",
		"ブルンゲル",
	],
	"ブルンゲル" => [
	],
	"ママンボウ" => [
		"ママンボウ",
	],
	"バチュル" => [
		"バチュル",
		"デンチュラ",
	],
	"デンチュラ" => [
	],
	"テッシード" => [
		"テッシード",
		"ナットレイ",
	],
	"ナットレイ" => [
	],
	"ギアル" => [
		"ギアル",
		"ギギアル",
		"ギギギアル",
	],
	"ギギアル" => [
	],
	"ギギギアル" => [
	],
	"シビシラス" => [
		"シビシラス",
		"シビビール",
		"シビルドン",
	],
	"シビビール" => [
	],
	"シビルドン" => [
	],
	"リグレー" => [
		"リグレー",
		"オーベム",
	],
	"オーベム" => [
	],
	"ヒトモシ" => [
		"ヒトモシ",
		"ランプラー",
		"シャンデラ",
	],
	"ランプラー" => [
	],
	"シャンデラ" => [
	],
	"キバゴ" => [
		"キバゴ",
		"オノンド",
		"オノノクス",
	],
	"オノンド" => [
	],
	"オノノクス" => [
	],
	"クマシュン" => [
		"クマシュン",
		"ツンベアー",
	],
	"ツンベアー" => [
	],
	"フリージオ" => [
		"フリージオ",
	],
	"チョボマキ" => [
		"チョボマキ",
		"アギルダー",
	],
	"アギルダー" => [
	],
	"マッギョ" => [
		"マッギョ",
	],
	"コジョフー" => [
		"コジョフー",
		"コジョンド",
	],
	"コジョンド" => [
	],
	"クリムガン" => [
		"クリムガン",
	],
	"ゴビット" => [
		"ゴビット",
		"ゴルーグ",
	],
	"ゴルーグ" => [
	],
	"コマタナ" => [
		"コマタナ",
		"キリキザン",
	],
	"キリキザン" => [
	],
	"バッフロン" => [
		"バッフロン",
	],
	"ワシボン" => [
		"ワシボン",
		"ウォーグル",
	],
	"ウォーグル" => [
	],
	"バルチャイ" => [
		"バルチャイ",
		"バルジーナ",
	],
	"バルジーナ" => [
	],
	"クイタラン" => [
		"クイタラン",
	],
	"アイアント" => [
		"アイアント",
	],
	"モノズ" => [
		"モノズ",
		"ジヘッド",
		"サザンドラ",
	],
	"ジヘッド" => [
	],
	"サザンドラ" => [
	],
	"メラルバ" => [
		"メラルバ",
		"ウルガモス",
	],
	"ウルガモス" => [
	],
	"コバルオン" => [
		"コバルオン",
	],
	"テラキオン" => [
		"テラキオン",
	],
	"ビリジオン" => [
		"ビリジオン",
	],
	"トルネロス" => [
		"トルネロス",
	],
	"ボルトロス" => [
		"ボルトロス",
	],
	"レシラム" => [
		"レシラム",
	],
	"ゼクロム" => [
		"ゼクロム",
	],
	"ランドロス" => [
		"ランドロス",
	],
	"キュレムa" => [
		"キュレムa",
	],
	"ケルディオ" => [
		"ケルディオ",
	],
	"メロエッタvoice" => [
		"メロエッタvoice",
		"メロエッタstep",
	],
	"メロエッタstep" => [
		"メロエッタvoice",
		"メロエッタstep",
	],
	"ゲノセクトnormal" => [
		"ゲノセクトnormal",
		"ゲノセクトaqua",
		"ゲノセクトinazuma",
		"ゲノセクトblaze",
		"ゲノセクトfreeze",
	],
	"ゲノセクトaqua" => [
		"ゲノセクトnormal",
		"ゲノセクトaqua",
		"ゲノセクトinazuma",
		"ゲノセクトblaze",
		"ゲノセクトfreeze",
	],
	"ゲノセクトinazuma" => [
		"ゲノセクトnormal",
		"ゲノセクトaqua",
		"ゲノセクトinazuma",
		"ゲノセクトblaze",
		"ゲノセクトfreeze",
	],
	"ゲノセクトblaze" => [
		"ゲノセクトnormal",
		"ゲノセクトaqua",
		"ゲノセクトinazuma",
		"ゲノセクトblaze",
		"ゲノセクトfreeze",
	],
	"ゲノセクトfreeze" => [
		"ゲノセクトnormal",
		"ゲノセクトaqua",
		"ゲノセクトinazuma",
		"ゲノセクトblaze",
		"ゲノセクトfreeze",
	],
}
