$seed_poke_hash = {
	"フシギダネ" => [
		"フシギダネ",
	],
	"フシギソウ" => [
		"フシギダネ",
	],
	"フシギバナ" => [
		"フシギダネ",
	],
	"ヒトカゲ" => [
		"ヒトカゲ",
	],
	"リザード" => [
		"ヒトカゲ",
	],
	"リザードン" => [
		"ヒトカゲ",
	],
	"ゼニガメ" => [
		"ゼニガメ",
	],
	"カメール" => [
		"ゼニガメ",
	],
	"カメックス" => [
		"ゼニガメ",
	],
	"キャタピー" => [
		"キャタピー",
	],
	"トランセル" => [
		"キャタピー",
	],
	"バタフリー" => [
		"キャタピー",
	],
	"ビードル" => [
		"ビードル",
	],
	"コクーン" => [
		"ビードル",
	],
	"スピアー" => [
		"ビードル",
	],
	"ポッポ" => [
		"ポッポ",
	],
	"ピジョン" => [
		"ポッポ",
	],
	"ピジョット" => [
		"ポッポ",
	],
	"コラッタ" => [
		"コラッタ",
	],
	"ラッタ" => [
		"コラッタ",
	],
	"オニスズメ" => [
		"オニスズメ",
	],
	"オニドリル" => [
		"オニスズメ",
	],
	"アーボ" => [
		"アーボ",
	],
	"アーボック" => [
		"アーボ",
	],
	"ピカチュウ" => [
		"ピチュー",
	],
	"ライチュウ" => [
		"ピチュー",
	],
	"サンド" => [
		"サンド",
	],
	"サンドパン" => [
		"サンド",
	],
	"ニドラン♀" => [
		"ニドラン♀",
	],
	"ニドリーナ" => [
		"ニドラン♀",
	],
	"ニドクイン" => [
		"ニドラン♀",
	],
	"ニドラン♂" => [
		"ニドラン♂",
	],
	"ニドリーノ" => [
		"ニドラン♂",
	],
	"ニドキング" => [
		"ニドラン♂",
	],
	"ピッピ" => [
		"ピィ",
	],
	"ピクシー" => [
		"ピィ",
	],
	"ロコン" => [
		"ロコン",
	],
	"キュウコン" => [
		"ロコン",
	],
	"プリン" => [
		"ププリン",
	],
	"プクリン" => [
		"ププリン",
	],
	"ズバット" => [
		"ズバット",
	],
	"ゴルバット" => [
		"ズバット",
	],
	"ナゾノクサ" => [
		"ナゾノクサ",
	],
	"クサイハナ" => [
		"ナゾノクサ",
	],
	"ラフレシア" => [
		"ナゾノクサ",
	],
	"パラス" => [
		"パラス",
	],
	"パラセクト" => [
		"パラス",
	],
	"コンパン" => [
		"コンパン",
	],
	"モルフォン" => [
		"コンパン",
	],
	"ディグダ" => [
		"ディグダ",
	],
	"ダグトリオ" => [
		"ディグダ",
	],
	"ニャース" => [
		"ニャース",
	],
	"ペルシアン" => [
		"ニャース",
	],
	"コダック" => [
		"コダック",
	],
	"ゴルダック" => [
		"コダック",
	],
	"マンキー" => [
		"マンキー",
	],
	"オコリザル" => [
		"マンキー",
	],
	"ガーディ" => [
		"ガーディ",
	],
	"ウインディ" => [
		"ガーディ",
	],
	"ニョロモ" => [
		"ニョロモ",
	],
	"ニョロゾ" => [
		"ニョロモ",
	],
	"ニョロボン" => [
		"ニョロモ",
	],
	"ケーシィ" => [
		"ケーシィ",
	],
	"ユンゲラー" => [
		"ケーシィ",
	],
	"フーディン" => [
		"ケーシィ",
	],
	"ワンリキー" => [
		"ワンリキー",
	],
	"ゴーリキー" => [
		"ワンリキー",
	],
	"カイリキー" => [
		"ワンリキー",
	],
	"マダツボミ" => [
		"マダツボミ",
	],
	"ウツドン" => [
		"マダツボミ",
	],
	"ウツボット" => [
		"マダツボミ",
	],
	"メノクラゲ" => [
		"メノクラゲ",
	],
	"ドククラゲ" => [
		"メノクラゲ",
	],
	"イシツブテ" => [
		"イシツブテ",
	],
	"ゴローン" => [
		"イシツブテ",
	],
	"ゴローニャ" => [
		"イシツブテ",
	],
	"ポニータ" => [
		"ポニータ",
	],
	"ギャロップ" => [
		"ポニータ",
	],
	"ヤドン" => [
		"ヤドン",
	],
	"ヤドラン" => [
		"ヤドン",
	],
	"コイル" => [
		"コイル",
	],
	"レアコイル" => [
		"コイル",
	],
	"カモネギ" => [
		"カモネギ",
	],
	"ドードー" => [
		"ドードー",
	],
	"ドードリオ" => [
		"ドードー",
	],
	"パウワウ" => [
		"パウワウ",
	],
	"ジュゴン" => [
		"パウワウ",
	],
	"ベトベター" => [
		"ベトベター",
	],
	"ベトベトン" => [
		"ベトベター",
	],
	"シェルダー" => [
		"シェルダー",
	],
	"パルシェン" => [
		"シェルダー",
	],
	"ゴース" => [
		"ゴース",
	],
	"ゴースト" => [
		"ゴース",
	],
	"ゲンガー" => [
		"ゴース",
	],
	"イワーク" => [
		"イワーク",
	],
	"スリープ" => [
		"スリープ",
	],
	"スリーパー" => [
		"スリープ",
	],
	"クラブ" => [
		"クラブ",
	],
	"キングラー" => [
		"クラブ",
	],
	"ビリリダマ" => [
		"ビリリダマ",
	],
	"マルマイン" => [
		"ビリリダマ",
	],
	"タマタマ" => [
		"タマタマ",
	],
	"ナッシー" => [
		"タマタマ",
	],
	"カラカラ" => [
		"カラカラ",
	],
	"ガラガラ" => [
		"カラカラ",
	],
	"サワムラー" => [
		"バルキー",
	],
	"エビワラー" => [
		"バルキー",
	],
	"ベロリンガ" => [
		"ベロリンガ",
	],
	"ドガース" => [
		"ドガース",
	],
	"マタドガス" => [
		"ドガース",
	],
	"サイホーン" => [
		"サイホーン",
	],
	"サイドン" => [
		"サイホーン",
	],
	"ラッキー" => [
		"ピンプク",
	],
	"モンジャラ" => [
		"モンジャラ",
	],
	"ガルーラ" => [
		"ガルーラ",
	],
	"タッツー" => [
		"タッツー",
	],
	"シードラ" => [
		"タッツー",
	],
	"トサキント" => [
		"トサキント",
	],
	"アズマオウ" => [
		"トサキント",
	],
	"ヒトデマン" => [
		"ヒトデマン",
	],
	"スターミー" => [
		"ヒトデマン",
	],
	"バリヤード" => [
		"マネネ",
	],
	"ストライク" => [
		"ストライク",
	],
	"ルージュラ" => [
		"ムチュール",
	],
	"エレブー" => [
		"エレキッド",
	],
	"ブーバー" => [
		"ブビィ",
	],
	"カイロス" => [
		"カイロス",
	],
	"ケンタロス" => [
		"ケンタロス",
	],
	"コイキング" => [
		"コイキング",
	],
	"ギャラドス" => [
		"コイキング",
	],
	"ラプラス" => [
		"ラプラス",
	],
	"メタモン" => [
		"メタモン",
	],
	"イーブイ" => [
		"イーブイ",
	],
	"シャワーズ" => [
		"イーブイ",
	],
	"サンダース" => [
		"イーブイ",
	],
	"ブースター" => [
		"イーブイ",
	],
	"ポリゴン" => [
		"ポリゴン",
	],
	"オムナイト" => [
		"オムナイト",
	],
	"オムスター" => [
		"オムナイト",
	],
	"カブト" => [
		"カブト",
	],
	"カブトプス" => [
		"カブト",
	],
	"プテラ" => [
		"プテラ",
	],
	"カビゴン" => [
		"ゴンベ",
	],
	"フリーザー" => [
		"フリーザー",
	],
	"サンダー" => [
		"サンダー",
	],
	"ファイヤー" => [
		"ファイヤー",
	],
	"ミニリュウ" => [
		"ミニリュウ",
	],
	"ハクリュー" => [
		"ミニリュウ",
	],
	"カイリュー" => [
		"ミニリュウ",
	],
	"ミュウツー" => [
		"ミュウツー",
	],
	"ミュウ" => [
		"ミュウ",
	],
	"チコリータ" => [
		"チコリータ",
	],
	"ベイリーフ" => [
		"チコリータ",
	],
	"メガニウム" => [
		"チコリータ",
	],
	"ヒノアラシ" => [
		"ヒノアラシ",
	],
	"マグマラシ" => [
		"ヒノアラシ",
	],
	"バクフーン" => [
		"ヒノアラシ",
	],
	"ワニノコ" => [
		"ワニノコ",
	],
	"アリゲイツ" => [
		"ワニノコ",
	],
	"オーダイル" => [
		"ワニノコ",
	],
	"オタチ" => [
		"オタチ",
	],
	"オオタチ" => [
		"オタチ",
	],
	"ホーホー" => [
		"ホーホー",
	],
	"ヨルノズク" => [
		"ホーホー",
	],
	"レディバ" => [
		"レディバ",
	],
	"レディアン" => [
		"レディバ",
	],
	"イトマル" => [
		"イトマル",
	],
	"アリアドス" => [
		"イトマル",
	],
	"クロバット" => [
		"ズバット",
	],
	"チョンチー" => [
		"チョンチー",
	],
	"ランターン" => [
		"チョンチー",
	],
	"ピチュー" => [
		"ピチュー",
	],
	"ピィ" => [
		"ピィ",
	],
	"ププリン" => [
		"ププリン",
	],
	"トゲピー" => [
		"トゲピー",
	],
	"トゲチック" => [
		"トゲピー",
	],
	"ネイティ" => [
		"ネイティ",
	],
	"ネイティオ" => [
		"ネイティ",
	],
	"メリープ" => [
		"メリープ",
	],
	"モココ" => [
		"メリープ",
	],
	"デンリュウ" => [
		"メリープ",
	],
	"キレイハナ" => [
		"ナゾノクサ",
	],
	"マリル" => [
		"ルリリ",
	],
	"マリルリ" => [
		"ルリリ",
	],
	"ウソッキー" => [
		"ウソハチ",
	],
	"ニョロトノ" => [
		"ニョロモ",
	],
	"ハネッコ" => [
		"ハネッコ",
	],
	"ポポッコ" => [
		"ハネッコ",
	],
	"ワタッコ" => [
		"ハネッコ",
	],
	"エイパム" => [
		"エイパム",
	],
	"ヒマナッツ" => [
		"ヒマナッツ",
	],
	"キマワリ" => [
		"ヒマナッツ",
	],
	"ヤンヤンマ" => [
		"ヤンヤンマ",
	],
	"ウパー" => [
		"ウパー",
	],
	"ヌオー" => [
		"ウパー",
	],
	"エーフィ" => [
		"イーブイ",
	],
	"ブラッキー" => [
		"イーブイ",
	],
	"ヤミカラス" => [
		"ヤミカラス",
	],
	"ヤドキング" => [
		"ヤドン",
	],
	"ムウマ" => [
		"ムウマ",
	],
	"アンノーンuna" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunb" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunc" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンund" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンune" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunf" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンung" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunh" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuni" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunj" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunk" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunl" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunm" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunn" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuno" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunp" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunq" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunr" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuns" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunt" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunu" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunv" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunw" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunx" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンuny" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンunz" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンexc" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"アンノーンque" => [
		"アンノーンuna",
		"アンノーンunb",
		"アンノーンunc",
		"アンノーンund",
		"アンノーンune",
		"アンノーンunf",
		"アンノーンung",
		"アンノーンunh",
		"アンノーンuni",
		"アンノーンunj",
		"アンノーンunk",
		"アンノーンunl",
		"アンノーンunm",
		"アンノーンunn",
		"アンノーンuno",
		"アンノーンunp",
		"アンノーンunq",
		"アンノーンunr",
		"アンノーンuns",
		"アンノーンunt",
		"アンノーンunu",
		"アンノーンunv",
		"アンノーンunw",
		"アンノーンunx",
		"アンノーンuny",
		"アンノーンunz",
		"アンノーンexc",
		"アンノーンque",
	],
	"ソーナンス" => [
		"ソーナノ",
	],
	"キリンリキ" => [
		"キリンリキ",
	],
	"クヌギダマ" => [
		"クヌギダマ",
	],
	"フォレトス" => [
		"クヌギダマ",
	],
	"ノコッチ" => [
		"ノコッチ",
	],
	"グライガー" => [
		"グライガー",
	],
	"ハガネール" => [
		"イワーク",
	],
	"ブルー" => [
		"ブルー",
	],
	"グランブル" => [
		"ブルー",
	],
	"ハリーセン" => [
		"ハリーセン",
	],
	"ハッサム" => [
		"ストライク",
	],
	"ツボツボ" => [
		"ツボツボ",
	],
	"ヘラクロス" => [
		"ヘラクロス",
	],
	"ニューラ" => [
		"ニューラ",
	],
	"ヒメグマ" => [
		"ヒメグマ",
	],
	"リングマ" => [
		"ヒメグマ",
	],
	"マグマッグ" => [
		"マグマッグ",
	],
	"マグカルゴ" => [
		"マグマッグ",
	],
	"ウリムー" => [
		"ウリムー",
	],
	"イノムー" => [
		"ウリムー",
	],
	"サニーゴ" => [
		"サニーゴ",
	],
	"テッポウオ" => [
		"テッポウオ",
	],
	"オクタン" => [
		"テッポウオ",
	],
	"デリバード" => [
		"デリバード",
	],
	"マンタイン" => [
		"タマンタ",
	],
	"エアームド" => [
		"エアームド",
	],
	"デルビル" => [
		"デルビル",
	],
	"ヘルガー" => [
		"デルビル",
	],
	"キングドラ" => [
		"タッツー",
	],
	"ゴマゾウ" => [
		"ゴマゾウ",
	],
	"ドンファン" => [
		"ゴマゾウ",
	],
	"ポリゴン２" => [
		"ポリゴン",
	],
	"オドシシ" => [
		"オドシシ",
	],
	"ドーブル" => [
		"ドーブル",
	],
	"バルキー" => [
		"バルキー",
	],
	"カポエラー" => [
		"バルキー",
	],
	"ムチュール" => [
		"ムチュール",
	],
	"エレキッド" => [
		"エレキッド",
	],
	"ブビィ" => [
		"ブビィ",
	],
	"ミルタンク" => [
		"ミルタンク",
	],
	"ハピナス" => [
		"ピンプク",
	],
	"ライコウ" => [
		"ライコウ",
	],
	"エンテイ" => [
		"エンテイ",
	],
	"スイクン" => [
		"スイクン",
	],
	"ヨーギラス" => [
		"ヨーギラス",
	],
	"サナギラス" => [
		"ヨーギラス",
	],
	"バンギラス" => [
		"ヨーギラス",
	],
	"ルギア" => [
		"ルギア",
	],
	"ホウオウ" => [
		"ホウオウ",
	],
	"セレビィ" => [
		"セレビィ",
	],
	"キモリ" => [
		"キモリ",
	],
	"ジュプトル" => [
		"キモリ",
	],
	"ジュカイン" => [
		"キモリ",
	],
	"アチャモ" => [
		"アチャモ",
	],
	"ワカシャモ" => [
		"アチャモ",
	],
	"バシャーモ" => [
		"アチャモ",
	],
	"ミズゴロウ" => [
		"ミズゴロウ",
	],
	"ヌマクロー" => [
		"ミズゴロウ",
	],
	"ラグラージ" => [
		"ミズゴロウ",
	],
	"ポチエナ" => [
		"ポチエナ",
	],
	"グラエナ" => [
		"ポチエナ",
	],
	"ジグザグマ" => [
		"ジグザグマ",
	],
	"マッスグマ" => [
		"ジグザグマ",
	],
	"ケムッソ" => [
		"ケムッソ",
	],
	"カラサリス" => [
		"ケムッソ",
	],
	"アゲハント" => [
		"ケムッソ",
	],
	"マユルド" => [
		"ケムッソ",
	],
	"ドクケイル" => [
		"ケムッソ",
	],
	"ハスボー" => [
		"ハスボー",
	],
	"ハスブレロ" => [
		"ハスボー",
	],
	"ルンパッパ" => [
		"ハスボー",
	],
	"タネボー" => [
		"タネボー",
	],
	"コノハナ" => [
		"タネボー",
	],
	"ダーテング" => [
		"タネボー",
	],
	"スバメ" => [
		"スバメ",
	],
	"オオスバメ" => [
		"スバメ",
	],
	"キャモメ" => [
		"キャモメ",
	],
	"ペリッパー" => [
		"キャモメ",
	],
	"ラルトス" => [
		"ラルトス",
	],
	"キルリア" => [
		"ラルトス",
	],
	"サーナイト" => [
		"ラルトス",
	],
	"アメタマ" => [
		"アメタマ",
	],
	"アメモース" => [
		"アメタマ",
	],
	"キノココ" => [
		"キノココ",
	],
	"キノガッサ" => [
		"キノココ",
	],
	"ナマケロ" => [
		"ナマケロ",
	],
	"ヤルキモノ" => [
		"ナマケロ",
	],
	"ケッキング" => [
		"ナマケロ",
	],
	"ツチニン" => [
		"ツチニン",
	],
	"テッカニン" => [
		"ツチニン",
	],
	"ヌケニン" => [
		"ツチニン",
	],
	"ゴニョニョ" => [
		"ゴニョニョ",
	],
	"ドゴーム" => [
		"ゴニョニョ",
	],
	"バクオング" => [
		"ゴニョニョ",
	],
	"マクノシタ" => [
		"マクノシタ",
	],
	"ハリテヤマ" => [
		"マクノシタ",
	],
	"ルリリ" => [
		"ルリリ",
	],
	"ノズパス" => [
		"ノズパス",
	],
	"エネコ" => [
		"エネコ",
	],
	"エネコロロ" => [
		"エネコ",
	],
	"ヤミラミ" => [
		"ヤミラミ",
	],
	"クチート" => [
		"クチート",
	],
	"ココドラ" => [
		"ココドラ",
	],
	"コドラ" => [
		"ココドラ",
	],
	"ボスゴドラ" => [
		"ココドラ",
	],
	"アサナン" => [
		"アサナン",
	],
	"チャーレム" => [
		"アサナン",
	],
	"ラクライ" => [
		"ラクライ",
	],
	"ライボルト" => [
		"ラクライ",
	],
	"プラスル" => [
		"プラスル",
	],
	"マイナン" => [
		"マイナン",
	],
	"バルビート" => [
		"バルビート",
	],
	"イルミーゼ" => [
		"イルミーゼ",
	],
	"ロゼリア" => [
		"スボミー",
	],
	"ゴクリン" => [
		"ゴクリン",
	],
	"マルノーム" => [
		"ゴクリン",
	],
	"キバニア" => [
		"キバニア",
	],
	"サメハダー" => [
		"キバニア",
	],
	"ホエルコ" => [
		"ホエルコ",
	],
	"ホエルオー" => [
		"ホエルコ",
	],
	"ドンメル" => [
		"ドンメル",
	],
	"バクーダ" => [
		"ドンメル",
	],
	"コータス" => [
		"コータス",
	],
	"バネブー" => [
		"バネブー",
	],
	"ブーピッグ" => [
		"バネブー",
	],
	"パッチール" => [
		"パッチール",
	],
	"ナックラー" => [
		"ナックラー",
	],
	"ビブラーバ" => [
		"ナックラー",
	],
	"フライゴン" => [
		"ナックラー",
	],
	"サボネア" => [
		"サボネア",
	],
	"ノクタス" => [
		"サボネア",
	],
	"チルット" => [
		"チルット",
	],
	"チルタリス" => [
		"チルット",
	],
	"ザングース" => [
		"ザングース",
	],
	"ハブネーク" => [
		"ハブネーク",
	],
	"ルナトーン" => [
		"ルナトーン",
	],
	"ソルロック" => [
		"ソルロック",
	],
	"ドジョッチ" => [
		"ドジョッチ",
	],
	"ナマズン" => [
		"ドジョッチ",
	],
	"ヘイガニ" => [
		"ヘイガニ",
	],
	"シザリガー" => [
		"ヘイガニ",
	],
	"ヤジロン" => [
		"ヤジロン",
	],
	"ネンドール" => [
		"ヤジロン",
	],
	"リリーラ" => [
		"リリーラ",
	],
	"ユレイドル" => [
		"リリーラ",
	],
	"アノプス" => [
		"アノプス",
	],
	"アーマルド" => [
		"アノプス",
	],
	"ヒンバス" => [
		"ヒンバス",
	],
	"ミロカロス" => [
		"ヒンバス",
	],
	"ポワルンnormal" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"ポワルンsun" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"ポワルンrain" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"ポワルンsnow" => [
		"ポワルンnormal",
		"ポワルンsun",
		"ポワルンrain",
		"ポワルンsnow",
	],
	"カクレオン" => [
		"カクレオン",
	],
	"カゲボウズ" => [
		"カゲボウズ",
	],
	"ジュペッタ" => [
		"カゲボウズ",
	],
	"ヨマワル" => [
		"ヨマワル",
	],
	"サマヨール" => [
		"ヨマワル",
	],
	"トロピウス" => [
		"トロピウス",
	],
	"チリーン" => [
		"リーシャン",
	],
	"アブソル" => [
		"アブソル",
	],
	"ソーナノ" => [
		"ソーナノ",
	],
	"ユキワラシ" => [
		"ユキワラシ",
	],
	"オニゴーリ" => [
		"ユキワラシ",
	],
	"タマザラシ" => [
		"タマザラシ",
	],
	"トドグラー" => [
		"タマザラシ",
	],
	"トドゼルガ" => [
		"タマザラシ",
	],
	"パールル" => [
		"パールル",
	],
	"ハンテール" => [
		"パールル",
	],
	"サクラビス" => [
		"パールル",
	],
	"ジーランス" => [
		"ジーランス",
	],
	"ラブカス" => [
		"ラブカス",
	],
	"タツベイ" => [
		"タツベイ",
	],
	"コモルー" => [
		"タツベイ",
	],
	"ボーマンダ" => [
		"タツベイ",
	],
	"ダンバル" => [
		"ダンバル",
	],
	"メタング" => [
		"ダンバル",
	],
	"メタグロス" => [
		"ダンバル",
	],
	"レジロック" => [
		"レジロック",
	],
	"レジアイス" => [
		"レジアイス",
	],
	"レジスチル" => [
		"レジスチル",
	],
	"ラティアス" => [
		"ラティアス",
	],
	"ラティオス" => [
		"ラティオス",
	],
	"カイオーガ" => [
		"カイオーガ",
	],
	"グラードン" => [
		"グラードン",
	],
	"レックウザ" => [
		"レックウザ",
	],
	"ジラーチ" => [
		"ジラーチ",
	],
	"デオキシスnormal" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"デオキシスattack" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"デオキシスdefence" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"デオキシスspeed" => [
		"デオキシスnormal",
		"デオキシスattack",
		"デオキシスdefence",
		"デオキシスspeed",
	],
	"ナエトル" => [
		"ナエトル",
	],
	"ハヤシガメ" => [
		"ナエトル",
	],
	"ドダイトス" => [
		"ナエトル",
	],
	"ヒコザル" => [
		"ヒコザル",
	],
	"モウカザル" => [
		"ヒコザル",
	],
	"ゴウカザル" => [
		"ヒコザル",
	],
	"ポッチャマ" => [
		"ポッチャマ",
	],
	"ポッタイシ" => [
		"ポッチャマ",
	],
	"エンペルト" => [
		"ポッチャマ",
	],
	"ムックル" => [
		"ムックル",
	],
	"ムクバード" => [
		"ムックル",
	],
	"ムクホーク" => [
		"ムックル",
	],
	"ビッパ" => [
		"ビッパ",
	],
	"ビーダル" => [
		"ビッパ",
	],
	"コロボーシ" => [
		"コロボーシ",
	],
	"コロトック" => [
		"コロボーシ",
	],
	"コリンク" => [
		"コリンク",
	],
	"ルクシオ" => [
		"コリンク",
	],
	"レントラー" => [
		"コリンク",
	],
	"スボミー" => [
		"スボミー",
	],
	"ロズレイド" => [
		"スボミー",
	],
	"ズガイドス" => [
		"ズガイドス",
	],
	"ラムパルド" => [
		"ズガイドス",
	],
	"タテトプス" => [
		"タテトプス",
	],
	"トリデプス" => [
		"タテトプス",
	],
	"ミノムッチkusa" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
	],
	"ミノムッチsuna" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
	],
	"ミノムッチgomi" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
	],
	"ミノマダムkusa" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
	],
	"ミノマダムjimen" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
	],
	"ミノマダムhagane" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
	],
	"ガーメイル" => [
		"ミノムッチkusa",
		"ミノムッチsuna",
		"ミノムッチgomi",
	],
	"ミツハニー" => [
		"ミツハニー",
	],
	"ビークイン" => [
		"ミツハニー",
	],
	"パチリス" => [
		"パチリス",
	],
	"ブイゼル" => [
		"ブイゼル",
	],
	"フローゼル" => [
		"ブイゼル",
	],
	"チェリンボ" => [
		"チェリンボ",
	],
	"チェリムnega" => [
		"チェリンボ",
	],
	"チェリムposi" => [
		"チェリンボ",
	],
	"カラナクシwest" => [
		"カラナクシwest",
		"カラナクシeast",
	],
	"カラナクシeast" => [
		"カラナクシwest",
		"カラナクシeast",
	],
	"トリトドンwest" => [
		"カラナクシwest",
		"カラナクシeast",
	],
	"トリトドンeast" => [
		"カラナクシwest",
		"カラナクシeast",
	],
	"エテボース" => [
		"エイパム",
	],
	"フワンテ" => [
		"フワンテ",
	],
	"フワライド" => [
		"フワンテ",
	],
	"ミミロル" => [
		"ミミロル",
	],
	"ミミロップ" => [
		"ミミロル",
	],
	"ムウマージ" => [
		"ムウマ",
	],
	"ドンカラス" => [
		"ヤミカラス",
	],
	"ニャルマー" => [
		"ニャルマー",
	],
	"ブニャット" => [
		"ニャルマー",
	],
	"リーシャン" => [
		"リーシャン",
	],
	"スカンプー" => [
		"スカンプー",
	],
	"スカタンク" => [
		"スカンプー",
	],
	"ドーミラー" => [
		"ドーミラー",
	],
	"ドータクン" => [
		"ドーミラー",
	],
	"ウソハチ" => [
		"ウソハチ",
	],
	"マネネ" => [
		"マネネ",
	],
	"ピンプク" => [
		"ピンプク",
	],
	"ペラップ" => [
		"ペラップ",
	],
	"ミカルゲ" => [
		"ミカルゲ",
	],
	"フカマル" => [
		"フカマル",
	],
	"ガバイト" => [
		"フカマル",
	],
	"ガブリアス" => [
		"フカマル",
	],
	"ゴンベ" => [
		"ゴンベ",
	],
	"リオル" => [
		"リオル",
	],
	"ルカリオ" => [
		"リオル",
	],
	"ヒポポタス" => [
		"ヒポポタス",
	],
	"カバルドン" => [
		"ヒポポタス",
	],
	"スコルピ" => [
		"スコルピ",
	],
	"ドラピオン" => [
		"スコルピ",
	],
	"グレッグル" => [
		"グレッグル",
	],
	"ドクロッグ" => [
		"グレッグル",
	],
	"マスキッパ" => [
		"マスキッパ",
	],
	"ケイコウオ" => [
		"ケイコウオ",
	],
	"ネオラント" => [
		"ケイコウオ",
	],
	"タマンタ" => [
		"タマンタ",
	],
	"ユキカブリ" => [
		"ユキカブリ",
	],
	"ユキノオー" => [
		"ユキカブリ",
	],
	"マニューラ" => [
		"ニューラ",
	],
	"ジバコイル" => [
		"コイル",
	],
	"ベロベルト" => [
		"ベロリンガ",
	],
	"ドサイドン" => [
		"サイホーン",
	],
	"モジャンボ" => [
		"モンジャラ",
	],
	"エレキブル" => [
		"エレキッド",
	],
	"ブーバーン" => [
		"ブビィ",
	],
	"トゲキッス" => [
		"トゲピー",
	],
	"メガヤンマ" => [
		"ヤンヤンマ",
	],
	"リーフィア" => [
		"イーブイ",
	],
	"グレイシア" => [
		"イーブイ",
	],
	"グライオン" => [
		"グライガー",
	],
	"マンムー" => [
		"ウリムー",
	],
	"ポリゴンＺ" => [
		"ポリゴン",
	],
	"エルレイド" => [
		"ラルトス",
	],
	"ダイノーズ" => [
		"ノズパス",
	],
	"ヨノワール" => [
		"ヨマワル",
	],
	"ユキメノコ" => [
		"ユキワラシ",
	],
	"ロトムnormal" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムhot" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムwash" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムcold" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムfan" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ロトムcut" => [
		"ロトムnormal",
		"ロトムhot",
		"ロトムwash",
		"ロトムcold",
		"ロトムfan",
		"ロトムcut",
	],
	"ユクシー" => [
		"ユクシー",
	],
	"エムリット" => [
		"エムリット",
	],
	"アグノム" => [
		"アグノム",
	],
	"ディアルガ" => [
		"ディアルガ",
	],
	"パルキア" => [
		"パルキア",
	],
	"ヒードラン" => [
		"ヒードラン",
	],
	"レジギガス" => [
		"レジギガス",
	],
	"ギラティナanother" => [
		"ギラティナanother",
		"ギラティナorigin",
	],
	"ギラティナorigin" => [
		"ギラティナanother",
		"ギラティナorigin",
	],
	"クレセリア" => [
		"クレセリア",
	],
	"フィオネ" => [
		"フィオネ",
	],
	"マナフィ" => [
		"マナフィ",
	],
	"ダークライ" => [
		"ダークライ",
	],
	"シェイミland" => [
		"シェイミland",
		"シェイミsky",
	],
	"シェイミsky" => [
		"シェイミland",
		"シェイミsky",
	],
	"アルセウスnormal" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスbattle" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスhikou" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスpoison" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスjimen" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスiwa" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスmushi" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスghost" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスmetal" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスfire" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスwater" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスkusa" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスelectric" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスesper" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスkoori" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスdragon" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"アルセウスaku" => [
		"アルセウスnormal",
		"アルセウスbattle",
		"アルセウスhikou",
		"アルセウスpoison",
		"アルセウスjimen",
		"アルセウスiwa",
		"アルセウスmushi",
		"アルセウスghost",
		"アルセウスmetal",
		"アルセウスfire",
		"アルセウスwater",
		"アルセウスkusa",
		"アルセウスelectric",
		"アルセウスesper",
		"アルセウスkoori",
		"アルセウスdragon",
		"アルセウスaku",
	],
	"ビクティニ" => [
		"ビクティニ",
	],
	"ツタージャ" => [
		"ツタージャ",
	],
	"ジャノビー" => [
		"ツタージャ",
	],
	"ジャローダ" => [
		"ツタージャ",
	],
	"ポカブ" => [
		"ポカブ",
	],
	"チャオブー" => [
		"ポカブ",
	],
	"エンブオー" => [
		"ポカブ",
	],
	"ミジュマル" => [
		"ミジュマル",
	],
	"フタチマル" => [
		"ミジュマル",
	],
	"ダイケンキ" => [
		"ミジュマル",
	],
	"ミネズミ" => [
		"ミネズミ",
	],
	"ミルホッグ" => [
		"ミネズミ",
	],
	"ヨーテリー" => [
		"ヨーテリー",
	],
	"ハーデリア" => [
		"ヨーテリー",
	],
	"ムーランド" => [
		"ヨーテリー",
	],
	"チョロネコ" => [
		"チョロネコ",
	],
	"レパルダス" => [
		"チョロネコ",
	],
	"ヤナップ" => [
		"ヤナップ",
	],
	"ヤナッキー" => [
		"ヤナップ",
	],
	"バオップ" => [
		"バオップ",
	],
	"バオッキー" => [
		"バオップ",
	],
	"ヒヤップ" => [
		"ヒヤップ",
	],
	"ヒヤッキー" => [
		"ヒヤップ",
	],
	"ムンナ" => [
		"ムンナ",
	],
	"ムシャーナ" => [
		"ムンナ",
	],
	"マメパト" => [
		"マメパト",
	],
	"ハトーボー" => [
		"マメパト",
	],
	"ケンホロウ" => [
		"マメパト",
	],
	"シママ" => [
		"シママ",
	],
	"ゼブライカ" => [
		"シママ",
	],
	"ダンゴロ" => [
		"ダンゴロ",
	],
	"ガントル" => [
		"ダンゴロ",
	],
	"ギガイアス" => [
		"ダンゴロ",
	],
	"コロモリ" => [
		"コロモリ",
	],
	"ココロモリ" => [
		"コロモリ",
	],
	"モグリュー" => [
		"モグリュー",
	],
	"ドリュウズ" => [
		"モグリュー",
	],
	"タブンネ" => [
		"タブンネ",
	],
	"ドッコラー" => [
		"ドッコラー",
	],
	"ドテッコツ" => [
		"ドッコラー",
	],
	"ローブシン" => [
		"ドッコラー",
	],
	"オタマロ" => [
		"オタマロ",
	],
	"ガマガル" => [
		"オタマロ",
	],
	"ガマゲロゲ" => [
		"オタマロ",
	],
	"ナゲキ" => [
		"ナゲキ",
	],
	"ダゲキ" => [
		"ダゲキ",
	],
	"クルミル" => [
		"クルミル",
	],
	"クルマユ" => [
		"クルミル",
	],
	"ハハコモリ" => [
		"クルミル",
	],
	"フシデ" => [
		"フシデ",
	],
	"ホイーガ" => [
		"フシデ",
	],
	"ペンドラー" => [
		"フシデ",
	],
	"モンメン" => [
		"モンメン",
	],
	"エルフーン" => [
		"モンメン",
	],
	"チュリネ" => [
		"チュリネ",
	],
	"ドレディア" => [
		"チュリネ",
	],
	"バスラオblack" => [
		"バスラオblack",
		"バスラオwhite",
	],
	"バスラオwhite" => [
		"バスラオblack",
		"バスラオwhite",
	],
	"メグロコ" => [
		"メグロコ",
	],
	"ワルビル" => [
		"メグロコ",
	],
	"ワルビアル" => [
		"メグロコ",
	],
	"ダルマッカ" => [
		"ダルマッカ",
	],
	"ヒヒダルマaction" => [
		"ダルマッカ",
	],
	"ヒヒダルマmeditation" => [
		"ダルマッカ",
	],
	"マラカッチ" => [
		"マラカッチ",
	],
	"イシズマイ" => [
		"イシズマイ",
	],
	"イワパレス" => [
		"イシズマイ",
	],
	"ズルッグ" => [
		"ズルッグ",
	],
	"ズルズキン" => [
		"ズルッグ",
	],
	"シンボラー" => [
		"シンボラー",
	],
	"デスマス" => [
		"デスマス",
	],
	"デスカーン" => [
		"デスマス",
	],
	"プロトーガ" => [
		"プロトーガ",
	],
	"アバゴーラ" => [
		"プロトーガ",
	],
	"アーケン" => [
		"アーケン",
	],
	"アーケオス" => [
		"アーケン",
	],
	"ヤブクロン" => [
		"ヤブクロン",
	],
	"ダストダス" => [
		"ヤブクロン",
	],
	"ゾロア" => [
		"ゾロア",
	],
	"ゾロアーク" => [
		"ゾロア",
	],
	"チラーミィ" => [
		"チラーミィ",
	],
	"チラチーノ" => [
		"チラーミィ",
	],
	"ゴチム" => [
		"ゴチム",
	],
	"ゴチミル" => [
		"ゴチム",
	],
	"ゴチルゼル" => [
		"ゴチム",
	],
	"ユニラン" => [
		"ユニラン",
	],
	"ダブラン" => [
		"ユニラン",
	],
	"ランクルス" => [
		"ユニラン",
	],
	"コアルヒー" => [
		"コアルヒー",
	],
	"スワンナ" => [
		"コアルヒー",
	],
	"バニプッチ" => [
		"バニプッチ",
	],
	"バニリッチ" => [
		"バニプッチ",
	],
	"バイバニラ" => [
		"バニプッチ",
	],
	"シキジカspring" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"シキジカsummer" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"シキジカautumn" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"シキジカwinter" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"メブキジカspring" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"メブキジカsummer" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"メブキジカautumn" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"メブキジカwinter" => [
		"シキジカspring",
		"シキジカsummer",
		"シキジカautumn",
		"シキジカwinter",
	],
	"エモンガ" => [
		"エモンガ",
	],
	"カブルモ" => [
		"カブルモ",
	],
	"シュバルゴ" => [
		"カブルモ",
	],
	"タマゲタケ" => [
		"タマゲタケ",
	],
	"モロバレル" => [
		"タマゲタケ",
	],
	"プルリル" => [
		"プルリル",
	],
	"ブルンゲル" => [
		"プルリル",
	],
	"ママンボウ" => [
		"ママンボウ",
	],
	"バチュル" => [
		"バチュル",
	],
	"デンチュラ" => [
		"バチュル",
	],
	"テッシード" => [
		"テッシード",
	],
	"ナットレイ" => [
		"テッシード",
	],
	"ギアル" => [
		"ギアル",
	],
	"ギギアル" => [
		"ギアル",
	],
	"ギギギアル" => [
		"ギアル",
	],
	"シビシラス" => [
		"シビシラス",
	],
	"シビビール" => [
		"シビシラス",
	],
	"シビルドン" => [
		"シビシラス",
	],
	"リグレー" => [
		"リグレー",
	],
	"オーベム" => [
		"リグレー",
	],
	"ヒトモシ" => [
		"ヒトモシ",
	],
	"ランプラー" => [
		"ヒトモシ",
	],
	"シャンデラ" => [
		"ヒトモシ",
	],
	"キバゴ" => [
		"キバゴ",
	],
	"オノンド" => [
		"キバゴ",
	],
	"オノノクス" => [
		"キバゴ",
	],
	"クマシュン" => [
		"クマシュン",
	],
	"ツンベアー" => [
		"クマシュン",
	],
	"フリージオ" => [
		"フリージオ",
	],
	"チョボマキ" => [
		"チョボマキ",
	],
	"アギルダー" => [
		"チョボマキ",
	],
	"マッギョ" => [
		"マッギョ",
	],
	"コジョフー" => [
		"コジョフー",
	],
	"コジョンド" => [
		"コジョフー",
	],
	"クリムガン" => [
		"クリムガン",
	],
	"ゴビット" => [
		"ゴビット",
	],
	"ゴルーグ" => [
		"ゴビット",
	],
	"コマタナ" => [
		"コマタナ",
	],
	"キリキザン" => [
		"コマタナ",
	],
	"バッフロン" => [
		"バッフロン",
	],
	"ワシボン" => [
		"ワシボン",
	],
	"ウォーグル" => [
		"ワシボン",
	],
	"バルチャイ" => [
		"バルチャイ",
	],
	"バルジーナ" => [
		"バルチャイ",
	],
	"クイタラン" => [
		"クイタラン",
	],
	"アイアント" => [
		"アイアント",
	],
	"モノズ" => [
		"モノズ",
	],
	"ジヘッド" => [
		"モノズ",
	],
	"サザンドラ" => [
		"モノズ",
	],
	"メラルバ" => [
		"メラルバ",
	],
	"ウルガモス" => [
		"メラルバ",
	],
	"コバルオン" => [
		"コバルオン",
	],
	"テラキオン" => [
		"テラキオン",
	],
	"ビリジオン" => [
		"ビリジオン",
	],
	"トルネロス" => [
		"トルネロス",
	],
	"ボルトロス" => [
		"ボルトロス",
	],
	"レシラム" => [
		"レシラム",
	],
	"ゼクロム" => [
		"ゼクロム",
	],
	"ランドロス" => [
		"ランドロス",
	],
	"キュレムa" => [
		"キュレムa",
	],
	"ケルディオ" => [
		"ケルディオ",
	],
	"メロイアvoice" => [
		"メロイアvoice",
		"メロイアstep",
	],
	"メロイアstep" => [
		"メロイアvoice",
		"メロイアstep",
	],
	"インセクタnormal" => [
		"インセクタnormal",
		"インセクタaqua",
		"インセクタinazuma",
		"インセクタblaze",
		"インセクタfreeze",
	],
	"インセクタaqua" => [
		"インセクタnormal",
		"インセクタaqua",
		"インセクタinazuma",
		"インセクタblaze",
		"インセクタfreeze",
	],
	"インセクタinazuma" => [
		"インセクタnormal",
		"インセクタaqua",
		"インセクタinazuma",
		"インセクタblaze",
		"インセクタfreeze",
	],
	"インセクタblaze" => [
		"インセクタnormal",
		"インセクタaqua",
		"インセクタinazuma",
		"インセクタblaze",
		"インセクタfreeze",
	],
	"インセクタfreeze" => [
		"インセクタnormal",
		"インセクタaqua",
		"インセクタinazuma",
		"インセクタblaze",
		"インセクタfreeze",
	],
}
