$tokusei_hash = {
	"フシギダネ" => [
		"しんりょく",
		"",
		"ようりょくそ",
	],
	"フシギソウ" => [
		"しんりょく",
		"",
		"ようりょくそ",
	],
	"フシギバナ" => [
		"しんりょく",
		"",
		"ようりょくそ",
	],
	"ヒトカゲ" => [
		"もうか",
		"",
		"サンパワー",
	],
	"リザード" => [
		"もうか",
		"",
		"サンパワー",
	],
	"リザードン" => [
		"もうか",
		"",
		"サンパワー",
	],
	"ゼニガメ" => [
		"げきりゅう",
		"",
		"あめうけざら",
	],
	"カメール" => [
		"げきりゅう",
		"",
		"あめうけざら",
	],
	"カメックス" => [
		"げきりゅう",
		"",
		"あめうけざら",
	],
	"キャタピー" => [
		"りんぷん",
		"",
		"にげあし",
	],
	"トランセル" => [
		"だっぴ",
		"",
		"だっぴ",
	],
	"バタフリー" => [
		"ふくがん",
		"",
		"いろめがね",
	],
	"ビードル" => [
		"りんぷん",
		"",
		"にげあし",
	],
	"コクーン" => [
		"だっぴ",
		"",
		"だっぴ",
	],
	"スピアー" => [
		"むしのしらせ",
		"",
		"スナイパー",
	],
	"ポッポ" => [
		"するどいめ",
		"ちどりあし",
		"はとむね",
	],
	"ピジョン" => [
		"するどいめ",
		"ちどりあし",
		"はとむね",
	],
	"ピジョット" => [
		"するどいめ",
		"ちどりあし",
		"はとむね",
	],
	"コラッタ" => [
		"にげあし",
		"こんじょう",
		"はりきり",
	],
	"ラッタ" => [
		"にげあし",
		"こんじょう",
		"はりきり",
	],
	"オニスズメ" => [
		"するどいめ",
		"",
		"スナイパー",
	],
	"オニドリル" => [
		"するどいめ",
		"",
		"スナイパー",
	],
	"アーボ" => [
		"いかく",
		"だっぴ",
		"きんちょうかん",
	],
	"アーボック" => [
		"いかく",
		"だっぴ",
		"きんちょうかん",
	],
	"ピカチュウ" => [
		"せいでんき",
		"",
		"ひらいしん",
	],
	"ライチュウ" => [
		"せいでんき",
		"",
		"ひらいしん",
	],
	"サンド" => [
		"すながくれ",
		"",
		"すなかき",
	],
	"サンドパン" => [
		"すながくれ",
		"",
		"すなかき",
	],
	"ニドラン♀" => [
		"どくのトゲ",
		"とうそうしん",
		"はりきり",
	],
	"ニドリーナ" => [
		"どくのトゲ",
		"とうそうしん",
		"はりきり",
	],
	"ニドクイン" => [
		"どくのトゲ",
		"とうそうしん",
		"ちからずく",
	],
	"ニドラン♂" => [
		"どくのトゲ",
		"とうそうしん",
		"はりきり",
	],
	"ニドリーノ" => [
		"どくのトゲ",
		"とうそうしん",
		"はりきり",
	],
	"ニドキング" => [
		"どくのトゲ",
		"とうそうしん",
		"ちからずく",
	],
	"ピッピ" => [
		"メロメロボディ",
		"マジックガード",
		"フレンドガード",
	],
	"ピクシー" => [
		"メロメロボディ",
		"マジックガード",
		"てんねん",
	],
	"ロコン" => [
		"もらいび",
		"",
		"ひでり",
	],
	"キュウコン" => [
		"もらいび",
		"",
		"ひでり",
	],
	"プリン" => [
		"メロメロボディ",
		"",
		"フレンドガード",
	],
	"プクリン" => [
		"メロメロボディ",
		"",
		"おみとおし",
	],
	"ズバット" => [
		"せいしんりょく",
		"",
		"すりぬけ",
	],
	"ゴルバット" => [
		"せいしんりょく",
		"",
		"すりぬけ",
	],
	"ナゾノクサ" => [
		"ようりょくそ",
		"",
		"にげあし",
	],
	"クサイハナ" => [
		"ようりょくそ",
		"",
		"あくしゅう",
	],
	"ラフレシア" => [
		"ようりょくそ",
		"",
		"ほうし",
	],
	"パラス" => [
		"ほうし",
		"かんそうはだ",
		"しめりけ",
	],
	"パラセクト" => [
		"ほうし",
		"かんそうはだ",
		"しめりけ",
	],
	"コンパン" => [
		"ふくがん",
		"いろめがね",
		"にげあし",
	],
	"モルフォン" => [
		"りんぷん",
		"いろめがね",
		"ミラクルスキン",
	],
	"ディグダ" => [
		"すながくれ",
		"ありじごく",
		"すなのちから",
	],
	"ダグトリオ" => [
		"すながくれ",
		"ありじごく",
		"すなのちから",
	],
	"ニャース" => [
		"ものひろい",
		"テクニシャン",
		"きんちょうかん",
	],
	"ペルシアン" => [
		"じゅうなん",
		"テクニシャン",
		"きんちょうかん",
	],
	"コダック" => [
		"しめりけ",
		"ノーてんき",
		"すいすい",
	],
	"ゴルダック" => [
		"しめりけ",
		"ノーてんき",
		"すいすい",
	],
	"マンキー" => [
		"やるき",
		"いかりのつぼ",
		"まけんき",
	],
	"オコリザル" => [
		"やるき",
		"いかりのつぼ",
		"まけんき",
	],
	"ガーディ" => [
		"いかく",
		"もらいび",
		"せいぎのこころ",
	],
	"ウインディ" => [
		"いかく",
		"もらいび",
		"せいぎのこころ",
	],
	"ニョロモ" => [
		"ちょすい",
		"しめりけ",
		"すいすい",
	],
	"ニョロゾ" => [
		"ちょすい",
		"しめりけ",
		"すいすい",
	],
	"ニョロボン" => [
		"ちょすい",
		"しめりけ",
		"すいすい",
	],
	"ケーシィ" => [
		"シンクロ",
		"せいしんりょく",
		"マジックガード",
	],
	"ユンゲラー" => [
		"シンクロ",
		"せいしんりょく",
		"マジックガード",
	],
	"フーディン" => [
		"シンクロ",
		"せいしんりょく",
		"マジックガード",
	],
	"ワンリキー" => [
		"こんじょう",
		"ノーガード",
		"ふくつのこころ",
	],
	"ゴーリキー" => [
		"こんじょう",
		"ノーガード",
		"ふくつのこころ",
	],
	"カイリキー" => [
		"こんじょう",
		"ノーガード",
		"ふくつのこころ",
	],
	"マダツボミ" => [
		"ようりょくそ",
		"",
		"くいしんぼう",
	],
	"ウツドン" => [
		"ようりょくそ",
		"",
		"くいしんぼう",
	],
	"ウツボット" => [
		"ようりょくそ",
		"",
		"くいしんぼう",
	],
	"メノクラゲ" => [
		"クリアボディ",
		"ヘドロえき",
		"あめうけざら",
	],
	"ドククラゲ" => [
		"クリアボディ",
		"ヘドロえき",
		"あめうけざら",
	],
	"イシツブテ" => [
		"いしあたま",
		"がんじょう",
		"すながくれ",
	],
	"ゴローン" => [
		"いしあたま",
		"がんじょう",
		"すながくれ",
	],
	"ゴローニャ" => [
		"いしあたま",
		"がんじょう",
		"すながくれ",
	],
	"ポニータ" => [
		"にげあし",
		"もらいび",
		"ほのおのからだ",
	],
	"ギャロップ" => [
		"にげあし",
		"もらいび",
		"ほのおのからだ",
	],
	"ヤドン" => [
		"どんかん",
		"マイペース",
		"さいせいりょく",
	],
	"ヤドラン" => [
		"どんかん",
		"マイペース",
		"さいせいりょく",
	],
	"コイル" => [
		"じりょく",
		"がんじょう",
		"アナライズ",
	],
	"レアコイル" => [
		"じりょく",
		"がんじょう",
		"アナライズ",
	],
	"カモネギ" => [
		"するどいめ",
		"せいしんりょく",
		"まけんき",
	],
	"ドードー" => [
		"にげあし",
		"はやおき",
		"ちどりあし",
	],
	"ドードリオ" => [
		"にげあし",
		"はやおき",
		"ちどりあし",
	],
	"パウワウ" => [
		"あついしぼう",
		"うるおいボディ",
		"アイスボディ",
	],
	"ジュゴン" => [
		"あついしぼう",
		"うるおいボディ",
		"アイスボディ",
	],
	"ベトベター" => [
		"あくしゅう",
		"ねんちゃく",
		"どくしゅ",
	],
	"ベトベトン" => [
		"あくしゅう",
		"ねんちゃく",
		"どくしゅ",
	],
	"シェルダー" => [
		"シェルアーマー",
		"スキルリンク",
		"ぼうじん",
	],
	"パルシェン" => [
		"シェルアーマー",
		"スキルリンク",
		"ぼうじん",
	],
	"ゴース" => [
		"ふゆう",
		"",
		"",
	],
	"ゴースト" => [
		"ふゆう",
		"",
		"",
	],
	"ゲンガー" => [
		"ふゆう",
		"",
		"",
	],
	"イワーク" => [
		"いしあたま",
		"がんじょう",
		"くだけるよろい",
	],
	"スリープ" => [
		"ふみん",
		"よちむ",
		"せいしんりょく",
	],
	"スリーパー" => [
		"ふみん",
		"よちむ",
		"せいしんりょく",
	],
	"クラブ" => [
		"かいりきバサミ",
		"シェルアーマー",
		"ちからずく",
	],
	"キングラー" => [
		"かいりきバサミ",
		"シェルアーマー",
		"ちからずく",
	],
	"ビリリダマ" => [
		"ぼうおん",
		"せいでんき",
		"ゆうばく",
	],
	"マルマイン" => [
		"ぼうおん",
		"せいでんき",
		"ゆうばく",
	],
	"タマタマ" => [
		"ようりょくそ",
		"",
		"しゅうかく",
	],
	"ナッシー" => [
		"ようりょくそ",
		"",
		"しゅうかく",
	],
	"カラカラ" => [
		"いしあたま",
		"ひらいしん",
		"カブトアーマー",
	],
	"ガラガラ" => [
		"いしあたま",
		"ひらいしん",
		"カブトアーマー",
	],
	"サワムラー" => [
		"じゅうなん",
		"すてみ",
		"かるわざ",
	],
	"エビワラー" => [
		"するどいめ",
		"てつのこぶし",
		"せいしんりょく",
	],
	"ベロリンガ" => [
		"マイペース",
		"どんかん",
		"ノーてんき",
	],
	"ドガース" => [
		"ふゆう",
		"",
		"",
	],
	"マタドガス" => [
		"ふゆう",
		"",
		"",
	],
	"サイホーン" => [
		"ひらいしん",
		"いしあたま",
		"すてみ",
	],
	"サイドン" => [
		"ひらいしん",
		"いしあたま",
		"すてみ",
	],
	"ラッキー" => [
		"しぜんかいふく",
		"てんのめぐみ",
		"いやしのこころ",
	],
	"モンジャラ" => [
		"ようりょくそ",
		"リーフガード",
		"さいせいりょく",
	],
	"ガルーラ" => [
		"はやおき",
		"きもったま",
		"せいしんりょく",
	],
	"タッツー" => [
		"すいすい",
		"スナイパー",
		"しめりけ",
	],
	"シードラ" => [
		"どくのトゲ",
		"スナイパー",
		"しめりけ",
	],
	"トサキント" => [
		"すいすい",
		"みずのベール",
		"ひらいしん",
	],
	"アズマオウ" => [
		"すいすい",
		"みずのベール",
		"ひらいしん",
	],
	"ヒトデマン" => [
		"はっこう",
		"しぜんかいふく",
		"アナライズ",
	],
	"スターミー" => [
		"はっこう",
		"しぜんかいふく",
		"アナライズ",
	],
	"バリヤード" => [
		"ぼうおん",
		"フィルター",
		"テクニシャン",
	],
	"ストライク" => [
		"むしのしらせ",
		"テクニシャン",
		"ふくつのこころ",
	],
	"ルージュラ" => [
		"どんかん",
		"よちむ",
		"かんそうはだ",
	],
	"エレブー" => [
		"せいでんき",
		"",
		"やるき",
	],
	"ブーバー" => [
		"ほのおのからだ",
		"",
		"やるき",
	],
	"カイロス" => [
		"かいりきバサミ",
		"かたやぶり",
		"じしんかじょう",
	],
	"ケンタロス" => [
		"いかく",
		"いかりのつぼ",
		"ちからずく",
	],
	"コイキング" => [
		"すいすい",
		"",
		"びびり",
	],
	"ギャラドス" => [
		"いかく",
		"",
		"じしんかじょう",
	],
	"ラプラス" => [
		"ちょすい",
		"シェルアーマー",
		"うるおいボディ",
	],
	"メタモン" => [
		"じゅうなん",
		"",
		"かわりもの",
	],
	"イーブイ" => [
		"にげあし",
		"てきおうりょく",
		"きけんよち",
	],
	"シャワーズ" => [
		"ちょすい",
		"ちょすい",
		"うるおいボディ",
	],
	"サンダース" => [
		"ちくでん",
		"ちくでん",
		"はやあし",
	],
	"ブースター" => [
		"もらいび",
		"もらいび",
		"こんじょう",
	],
	"ポリゴン" => [
		"トレース",
		"ダウンロード",
		"アナライズ",
	],
	"オムナイト" => [
		"すいすい",
		"シェルアーマー",
		"くだけるよろい",
	],
	"オムスター" => [
		"すいすい",
		"シェルアーマー",
		"くだけるよろい",
	],
	"カブト" => [
		"すいすい",
		"カブトアーマー",
		"くだけるよろい",
	],
	"カブトプス" => [
		"すいすい",
		"カブトアーマー",
		"くだけるよろい",
	],
	"プテラ" => [
		"いしあたま",
		"プレッシャー",
		"きんちょうかん",
	],
	"カビゴン" => [
		"めんえき",
		"あついしぼう",
		"くいしんぼう",
	],
	"フリーザー" => [
		"プレッシャー",
		"",
		"ゆきがくれ",
	],
	"サンダー" => [
		"プレッシャー",
		"",
		"ひらいしん",
	],
	"ファイヤー" => [
		"プレッシャー",
		"",
		"ほのおのからだ",
	],
	"ミニリュウ" => [
		"だっぴ",
		"",
		"ふしぎなうろこ",
	],
	"ハクリュー" => [
		"だっぴ",
		"",
		"ふしぎなうろこ",
	],
	"カイリュー" => [
		"せいしんりょく",
		"",
		"マルチスケイル",
	],
	"ミュウツー" => [
		"プレッシャー",
		"",
		"きんちょうかん",
	],
	"ミュウ" => [
		"シンクロ",
		"",
		"",
	],
	"チコリータ" => [
		"しんりょく",
		"",
		"リーフガード",
	],
	"ベイリーフ" => [
		"しんりょく",
		"",
		"リーフガード",
	],
	"メガニウム" => [
		"しんりょく",
		"",
		"リーフガード",
	],
	"ヒノアラシ" => [
		"もうか",
		"",
		"もらいび",
	],
	"マグマラシ" => [
		"もうか",
		"",
		"もらいび",
	],
	"バクフーン" => [
		"もうか",
		"",
		"もらいび",
	],
	"ワニノコ" => [
		"げきりゅう",
		"",
		"ちからずく",
	],
	"アリゲイツ" => [
		"げきりゅう",
		"",
		"ちからずく",
	],
	"オーダイル" => [
		"げきりゅう",
		"",
		"ちからずく",
	],
	"オタチ" => [
		"にげあし",
		"するどいめ",
		"おみとおし",
	],
	"オオタチ" => [
		"にげあし",
		"するどいめ",
		"おみとおし",
	],
	"ホーホー" => [
		"ふみん",
		"するどいめ",
		"いろめがね",
	],
	"ヨルノズク" => [
		"ふみん",
		"するどいめ",
		"いろめがね",
	],
	"レディバ" => [
		"むしのしらせ",
		"はやおき",
		"びびり",
	],
	"レディアン" => [
		"むしのしらせ",
		"はやおき",
		"てつのこぶし",
	],
	"イトマル" => [
		"むしのしらせ",
		"ふみん",
		"スナイパー",
	],
	"アリアドス" => [
		"むしのしらせ",
		"ふみん",
		"スナイパー",
	],
	"クロバット" => [
		"せいしんりょく",
		"",
		"すりぬけ",
	],
	"チョンチー" => [
		"ちくでん",
		"はっこう",
		"ちょすい",
	],
	"ランターン" => [
		"ちくでん",
		"はっこう",
		"ちょすい",
	],
	"ピチュー" => [
		"せいでんき",
		"",
		"ひらいしん",
	],
	"ピィ" => [
		"メロメロボディ",
		"マジックガード",
		"フレンドガード",
	],
	"ププリン" => [
		"メロメロボディ",
		"",
		"フレンドガード",
	],
	"トゲピー" => [
		"はりきり",
		"てんのめぐみ",
		"きょううん",
	],
	"トゲチック" => [
		"はりきり",
		"てんのめぐみ",
		"きょううん",
	],
	"ネイティ" => [
		"シンクロ",
		"はやおき",
		"マジックミラー",
	],
	"ネイティオ" => [
		"シンクロ",
		"はやおき",
		"マジックミラー",
	],
	"メリープ" => [
		"せいでんき",
		"",
		"プラス",
	],
	"モココ" => [
		"せいでんき",
		"",
		"プラス",
	],
	"デンリュウ" => [
		"せいでんき",
		"",
		"プラス",
	],
	"キレイハナ" => [
		"ようりょくそ",
		"",
		"いやしのこころ",
	],
	"マリル" => [
		"あついしぼう",
		"ちからもち",
		"そうしょく",
	],
	"マリルリ" => [
		"あついしぼう",
		"ちからもち",
		"そうしょく",
	],
	"ウソッキー" => [
		"がんじょう",
		"いしあたま",
		"びびり",
	],
	"ニョロトノ" => [
		"ちょすい",
		"しめりけ",
		"あめふらし",
	],
	"ハネッコ" => [
		"ようりょくそ",
		"リーフガード",
		"すりぬけ",
	],
	"ポポッコ" => [
		"ようりょくそ",
		"リーフガード",
		"すりぬけ",
	],
	"ワタッコ" => [
		"ようりょくそ",
		"リーフガード",
		"すりぬけ",
	],
	"エイパム" => [
		"にげあし",
		"ものひろい",
		"スキルリンク",
	],
	"ヒマナッツ" => [
		"ようりょくそ",
		"サンパワー",
		"はやおき",
	],
	"キマワリ" => [
		"ようりょくそ",
		"サンパワー",
		"はやおき",
	],
	"ヤンヤンマ" => [
		"かそく",
		"ふくがん",
		"おみとおし",
	],
	"ウパー" => [
		"しめりけ",
		"ちょすい",
		"てんねん",
	],
	"ヌオー" => [
		"しめりけ",
		"ちょすい",
		"てんねん",
	],
	"エーフィ" => [
		"シンクロ",
		"シンクロ",
		"マジックミラー",
	],
	"ブラッキー" => [
		"シンクロ",
		"シンクロ",
		"せいしんりょく",
	],
	"ヤミカラス" => [
		"ふみん",
		"きょううん",
		"いたずらごころ",
	],
	"ヤドキング" => [
		"どんかん",
		"マイペース",
		"さいせいりょく",
	],
	"ムウマ" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンuna" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunb" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunc" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンund" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンune" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunf" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンung" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunh" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンuni" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunj" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunk" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunl" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunm" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunn" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンuno" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunp" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunq" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunr" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンuns" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunt" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunu" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunv" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunw" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunx" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンuny" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンunz" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンexc" => [
		"ふゆう",
		"",
		"",
	],
	"アンノーンque" => [
		"ふゆう",
		"",
		"",
	],
	"ソーナンス" => [
		"かげふみ",
		"",
		"テレパシー",
	],
	"キリンリキ" => [
		"せいしんりょく",
		"はやおき",
		"そうしょく",
	],
	"クヌギダマ" => [
		"がんじょう",
		"",
		"ぼうじん",
	],
	"フォレトス" => [
		"がんじょう",
		"",
		"ぼうじん",
	],
	"ノコッチ" => [
		"てんのめぐみ",
		"にげあし",
		"びびり",
	],
	"グライガー" => [
		"かいりきバサミ",
		"すながくれ",
		"めんえき",
	],
	"ハガネール" => [
		"いしあたま",
		"がんじょう",
		"ちからずく",
	],
	"ブルー" => [
		"いかく",
		"にげあし",
		"びびり",
	],
	"グランブル" => [
		"いかく",
		"はやあし",
		"びびり",
	],
	"ハリーセン" => [
		"どくのトゲ",
		"すいすい",
		"いかく",
	],
	"ハッサム" => [
		"むしのしらせ",
		"テクニシャン",
		"ライトメタル",
	],
	"ツボツボ" => [
		"がんじょう",
		"くいしんぼう",
		"あまのじゃく",
	],
	"ヘラクロス" => [
		"むしのしらせ",
		"こんじょう",
		"じしんかじょう",
	],
	"ニューラ" => [
		"せいしんりょく",
		"するどいめ",
		"わるいてぐせ",
	],
	"ヒメグマ" => [
		"ものひろい",
		"はやあし",
		"みつあつめ",
	],
	"リングマ" => [
		"こんじょう",
		"はやあし",
		"きんちょうかん",
	],
	"マグマッグ" => [
		"マグマのよろい",
		"ほのおのからだ",
		"くだけるよろい",
	],
	"マグカルゴ" => [
		"マグマのよろい",
		"ほのおのからだ",
		"くだけるよろい",
	],
	"ウリムー" => [
		"どんかん",
		"ゆきがくれ",
		"あついしぼう",
	],
	"イノムー" => [
		"どんかん",
		"ゆきがくれ",
		"あついしぼう",
	],
	"サニーゴ" => [
		"はりきり",
		"しぜんかいふく",
		"さいせいりょく",
	],
	"テッポウオ" => [
		"はりきり",
		"スナイパー",
		"ムラっけ",
	],
	"オクタン" => [
		"きゅうばん",
		"スナイパー",
		"ムラっけ",
	],
	"デリバード" => [
		"やるき",
		"はりきり",
		"ふみん",
	],
	"マンタイン" => [
		"すいすい",
		"ちょすい",
		"みずのベール",
	],
	"エアームド" => [
		"するどいめ",
		"がんじょう",
		"くだけるよろい",
	],
	"デルビル" => [
		"はやおき",
		"もらいび",
		"きんちょうかん",
	],
	"ヘルガー" => [
		"はやおき",
		"もらいび",
		"きんちょうかん",
	],
	"キングドラ" => [
		"すいすい",
		"スナイパー",
		"しめりけ",
	],
	"ゴマゾウ" => [
		"ものひろい",
		"",
		"すながくれ",
	],
	"ドンファン" => [
		"がんじょう",
		"",
		"すながくれ",
	],
	"ポリゴン２" => [
		"トレース",
		"ダウンロード",
		"アナライズ",
	],
	"オドシシ" => [
		"いかく",
		"おみとおし",
		"そうしょく",
	],
	"ドーブル" => [
		"マイペース",
		"テクニシャン",
		"ムラっけ",
	],
	"バルキー" => [
		"こんじょう",
		"ふくつのこころ",
		"やるき",
	],
	"カポエラー" => [
		"いかく",
		"テクニシャン",
		"ふくつのこころ",
	],
	"ムチュール" => [
		"どんかん",
		"よちむ",
		"うるおいボディ",
	],
	"エレキッド" => [
		"せいでんき",
		"",
		"やるき",
	],
	"ブビィ" => [
		"ほのおのからだ",
		"",
		"やるき",
	],
	"ミルタンク" => [
		"あついしぼう",
		"きもったま",
		"そうしょく",
	],
	"ハピナス" => [
		"しぜんかいふく",
		"てんのめぐみ",
		"いやしのこころ",
	],
	"ライコウ" => [
		"プレッシャー",
		"",
		"ちくでん",
	],
	"エンテイ" => [
		"プレッシャー",
		"",
		"もらいび",
	],
	"スイクン" => [
		"プレッシャー",
		"",
		"ちょすい",
	],
	"ヨーギラス" => [
		"こんじょう",
		"",
		"すながくれ",
	],
	"サナギラス" => [
		"だっぴ",
		"",
		"だっぴ",
	],
	"バンギラス" => [
		"すなおこし",
		"",
		"きんちょうかん",
	],
	"ルギア" => [
		"プレッシャー",
		"",
		"マルチスケイル",
	],
	"ホウオウ" => [
		"プレッシャー",
		"",
		"さいせいりょく",
	],
	"セレビィ" => [
		"しぜんかいふく",
		"",
		"",
	],
	"キモリ" => [
		"しんりょく",
		"",
		"かるわざ",
	],
	"ジュプトル" => [
		"しんりょく",
		"",
		"かるわざ",
	],
	"ジュカイン" => [
		"しんりょく",
		"",
		"かるわざ",
	],
	"アチャモ" => [
		"もうか",
		"",
		"かそく",
	],
	"ワカシャモ" => [
		"もうか",
		"",
		"かそく",
	],
	"バシャーモ" => [
		"もうか",
		"",
		"かそく",
	],
	"ミズゴロウ" => [
		"げきりゅう",
		"",
		"しめりけ",
	],
	"ヌマクロー" => [
		"げきりゅう",
		"",
		"しめりけ",
	],
	"ラグラージ" => [
		"げきりゅう",
		"",
		"しめりけ",
	],
	"ポチエナ" => [
		"にげあし",
		"はやあし",
		"びびり",
	],
	"グラエナ" => [
		"いかく",
		"はやあし",
		"じしんかじょう",
	],
	"ジグザグマ" => [
		"ものひろい",
		"くいしんぼう",
		"はやあし",
	],
	"マッスグマ" => [
		"ものひろい",
		"くいしんぼう",
		"はやあし",
	],
	"ケムッソ" => [
		"りんぷん",
		"",
		"にげあし",
	],
	"カラサリス" => [
		"だっぴ",
		"",
		"だっぴ",
	],
	"アゲハント" => [
		"むしのしらせ",
		"",
		"とうそうしん",
	],
	"マユルド" => [
		"だっぴ",
		"",
		"だっぴ",
	],
	"ドクケイル" => [
		"りんぷん",
		"",
		"ふくがん",
	],
	"ハスボー" => [
		"すいすい",
		"あめうけざら",
		"マイペース",
	],
	"ハスブレロ" => [
		"すいすい",
		"あめうけざら",
		"マイペース",
	],
	"ルンパッパ" => [
		"すいすい",
		"あめうけざら",
		"マイペース",
	],
	"タネボー" => [
		"ようりょくそ",
		"はやおき",
		"わるいてぐせ",
	],
	"コノハナ" => [
		"ようりょくそ",
		"はやおき",
		"わるいてぐせ",
	],
	"ダーテング" => [
		"ようりょくそ",
		"はやおき",
		"わるいてぐせ",
	],
	"スバメ" => [
		"こんじょう",
		"",
		"きもったま",
	],
	"オオスバメ" => [
		"こんじょう",
		"",
		"きもったま",
	],
	"キャモメ" => [
		"するどいめ",
		"",
		"あめうけざら",
	],
	"ペリッパー" => [
		"するどいめ",
		"",
		"あめうけざら",
	],
	"ラルトス" => [
		"シンクロ",
		"トレース",
		"テレパシー",
	],
	"キルリア" => [
		"シンクロ",
		"トレース",
		"テレパシー",
	],
	"サーナイト" => [
		"シンクロ",
		"トレース",
		"テレパシー",
	],
	"アメタマ" => [
		"すいすい",
		"",
		"あめうけざら",
	],
	"アメモース" => [
		"いかく",
		"",
		"きんちょうかん",
	],
	"キノココ" => [
		"ほうし",
		"ポイズンヒール",
		"はやあし",
	],
	"キノガッサ" => [
		"ほうし",
		"ポイズンヒール",
		"テクニシャン",
	],
	"ナマケロ" => [
		"なまけ",
		"",
		"",
	],
	"ヤルキモノ" => [
		"やるき",
		"",
		"",
	],
	"ケッキング" => [
		"なまけ",
		"",
		"",
	],
	"ツチニン" => [
		"ふくがん",
		"",
		"にげあし",
	],
	"テッカニン" => [
		"かそく",
		"",
		"すりぬけ",
	],
	"ヌケニン" => [
		"ふしぎなまもり",
		"",
		"ふしぎなまもり",
	],
	"ゴニョニョ" => [
		"ぼうおん",
		"",
		"びびり",
	],
	"ドゴーム" => [
		"ぼうおん",
		"",
		"きもったま",
	],
	"バクオング" => [
		"ぼうおん",
		"",
		"きもったま",
	],
	"マクノシタ" => [
		"あついしぼう",
		"こんじょう",
		"ちからずく",
	],
	"ハリテヤマ" => [
		"あついしぼう",
		"こんじょう",
		"ちからずく",
	],
	"ルリリ" => [
		"あついしぼう",
		"ちからもち",
		"そうしょく",
	],
	"ノズパス" => [
		"がんじょう",
		"じりょく",
		"すなのちから",
	],
	"エネコ" => [
		"メロメロボディ",
		"ノーマルスキン",
		"ミラクルスキン",
	],
	"エネコロロ" => [
		"メロメロボディ",
		"ノーマルスキン",
		"ミラクルスキン",
	],
	"ヤミラミ" => [
		"するどいめ",
		"あとだし",
		"いたずらごころ",
	],
	"クチート" => [
		"かいりきバサミ",
		"いかく",
		"ちからずく",
	],
	"ココドラ" => [
		"がんじょう",
		"いしあたま",
		"ヘヴィメタル",
	],
	"コドラ" => [
		"がんじょう",
		"いしあたま",
		"ヘヴィメタル",
	],
	"ボスゴドラ" => [
		"がんじょう",
		"いしあたま",
		"ヘヴィメタル",
	],
	"アサナン" => [
		"ヨガパワー",
		"",
		"テレパシー",
	],
	"チャーレム" => [
		"ヨガパワー",
		"",
		"テレパシー",
	],
	"ラクライ" => [
		"せいでんき",
		"ひらいしん",
		"マイナス",
	],
	"ライボルト" => [
		"せいでんき",
		"ひらいしん",
		"マイナス",
	],
	"プラスル" => [
		"プラス",
		"",
		"",
	],
	"マイナン" => [
		"マイナス",
		"",
		"",
	],
	"バルビート" => [
		"はっこう",
		"むしのしらせ",
		"いたずらごころ",
	],
	"イルミーゼ" => [
		"どんかん",
		"いろめがね",
		"いたずらごころ",
	],
	"ロゼリア" => [
		"しぜんかいふく",
		"どくのトゲ",
		"リーフガード",
	],
	"ゴクリン" => [
		"ヘドロえき",
		"ねんちゃく",
		"くいしんぼう",
	],
	"マルノーム" => [
		"ヘドロえき",
		"ねんちゃく",
		"くいしんぼう",
	],
	"キバニア" => [
		"さめはだ",
		"",
		"かそく",
	],
	"サメハダー" => [
		"さめはだ",
		"",
		"かそく",
	],
	"ホエルコ" => [
		"みずのベール",
		"どんかん",
		"プレッシャー",
	],
	"ホエルオー" => [
		"みずのベール",
		"どんかん",
		"プレッシャー",
	],
	"ドンメル" => [
		"どんかん",
		"たんじゅん",
		"マイペース",
	],
	"バクーダ" => [
		"マグマのよろい",
		"ハードロック",
		"いかりのつぼ",
	],
	"コータス" => [
		"しろいけむり",
		"",
		"シェルアーマー",
	],
	"バネブー" => [
		"あついしぼう",
		"マイペース",
		"くいしんぼう",
	],
	"ブーピッグ" => [
		"あついしぼう",
		"マイペース",
		"くいしんぼう",
	],
	"パッチール" => [
		"マイペース",
		"ちどりあし",
		"あまのじゃく",
	],
	"ナックラー" => [
		"かいりきバサミ",
		"ありじごく",
		"ちからずく",
	],
	"ビブラーバ" => [
		"ふゆう",
		"ふゆう",
		"ふゆう",
	],
	"フライゴン" => [
		"ふゆう",
		"ふゆう",
		"ふゆう",
	],
	"サボネア" => [
		"すながくれ",
		"",
		"ちょすい",
	],
	"ノクタス" => [
		"すながくれ",
		"",
		"ちょすい",
	],
	"チルット" => [
		"しぜんかいふく",
		"",
		"ノーてんき",
	],
	"チルタリス" => [
		"しぜんかいふく",
		"",
		"ノーてんき",
	],
	"ザングース" => [
		"めんえき",
		"",
		"どくぼうそう",
	],
	"ハブネーク" => [
		"だっぴ",
		"",
		"すりぬけ",
	],
	"ルナトーン" => [
		"ふゆう",
		"",
		"",
	],
	"ソルロック" => [
		"ふゆう",
		"",
		"",
	],
	"ドジョッチ" => [
		"どんかん",
		"きけんよち",
		"うるおいボディ",
	],
	"ナマズン" => [
		"どんかん",
		"きけんよち",
		"うるおいボディ",
	],
	"ヘイガニ" => [
		"かいりきバサミ",
		"シェルアーマー",
		"てきおうりょく",
	],
	"シザリガー" => [
		"かいりきバサミ",
		"シェルアーマー",
		"てきおうりょく",
	],
	"ヤジロン" => [
		"ふゆう",
		"",
		"",
	],
	"ネンドール" => [
		"ふゆう",
		"",
		"",
	],
	"リリーラ" => [
		"きゅうばん",
		"",
		"よびみず",
	],
	"ユレイドル" => [
		"きゅうばん",
		"",
		"よびみず",
	],
	"アノプス" => [
		"カブトアーマー",
		"",
		"すいすい",
	],
	"アーマルド" => [
		"カブトアーマー",
		"",
		"すいすい",
	],
	"ヒンバス" => [
		"すいすい",
		"",
		"てきおうりょく",
	],
	"ミロカロス" => [
		"ふしぎなうろこ",
		"",
		"メロメロボディ",
	],
	"ポワルンnormal" => [
		"てんきや",
		"",
		"",
	],
	"ポワルンsun" => [
		"てんきや",
		"",
		"",
	],
	"ポワルンrain" => [
		"てんきや",
		"",
		"",
	],
	"ポワルンsnow" => [
		"てんきや",
		"",
		"",
	],
	"カクレオン" => [
		"へんしょく",
		"",
		"",
	],
	"カゲボウズ" => [
		"ふみん",
		"おみとおし",
		"のろわれボディ",
	],
	"ジュペッタ" => [
		"ふみん",
		"おみとおし",
		"のろわれボディ",
	],
	"ヨマワル" => [
		"ふゆう",
		"",
		"",
	],
	"サマヨール" => [
		"プレッシャー",
		"",
		"",
	],
	"トロピウス" => [
		"ようりょくそ",
		"サンパワー",
		"しゅうかく",
	],
	"チリーン" => [
		"ふゆう",
		"",
		"",
	],
	"アブソル" => [
		"プレッシャー",
		"きょううん",
		"せいぎのこころ",
	],
	"ソーナノ" => [
		"かげふみ",
		"",
		"テレパシー",
	],
	"ユキワラシ" => [
		"せいしんりょく",
		"アイスボディ",
		"ムラっけ",
	],
	"オニゴーリ" => [
		"せいしんりょく",
		"アイスボディ",
		"ムラっけ",
	],
	"タマザラシ" => [
		"あついしぼう",
		"アイスボディ",
		"どんかん",
	],
	"トドグラー" => [
		"あついしぼう",
		"アイスボディ",
		"どんかん",
	],
	"トドゼルガ" => [
		"あついしぼう",
		"アイスボディ",
		"どんかん",
	],
	"パールル" => [
		"シェルアーマー",
		"",
		"びびり",
	],
	"ハンテール" => [
		"すいすい",
		"",
		"みずのベール",
	],
	"サクラビス" => [
		"すいすい",
		"",
		"うるおいボディ",
	],
	"ジーランス" => [
		"すいすい",
		"いしあたま",
		"がんじょう",
	],
	"ラブカス" => [
		"すいすい",
		"",
		"うるおいボディ",
	],
	"タツベイ" => [
		"いしあたま",
		"",
		"ちからずく",
	],
	"コモルー" => [
		"いしあたま",
		"",
		"ぼうじん",
	],
	"ボーマンダ" => [
		"いかく",
		"",
		"じしんかじょう",
	],
	"ダンバル" => [
		"クリアボディ",
		"",
		"ライトメタル",
	],
	"メタング" => [
		"クリアボディ",
		"",
		"ライトメタル",
	],
	"メタグロス" => [
		"クリアボディ",
		"",
		"ライトメタル",
	],
	"レジロック" => [
		"クリアボディ",
		"",
		"がんじょう",
	],
	"レジアイス" => [
		"クリアボディ",
		"",
		"アイスボディ",
	],
	"レジスチル" => [
		"クリアボディ",
		"",
		"ライトメタル",
	],
	"ラティアス" => [
		"ふゆう",
		"",
		"",
	],
	"ラティオス" => [
		"ふゆう",
		"",
		"",
	],
	"カイオーガ" => [
		"あめふらし",
		"",
		"",
	],
	"グラードン" => [
		"ひでり",
		"",
		"",
	],
	"レックウザ" => [
		"エアロック",
		"",
		"",
	],
	"ジラーチ" => [
		"てんのめぐみ",
		"",
		"",
	],
	"デオキシスnormal" => [
		"プレッシャー",
		"",
		"",
	],
	"デオキシスattack" => [
		"プレッシャー",
		"",
		"",
	],
	"デオキシスdefence" => [
		"プレッシャー",
		"",
		"",
	],
	"デオキシスspeed" => [
		"プレッシャー",
		"",
		"",
	],
	"ナエトル" => [
		"しんりょく",
		"",
		"シェルアーマー",
	],
	"ハヤシガメ" => [
		"しんりょく",
		"",
		"シェルアーマー",
	],
	"ドダイトス" => [
		"しんりょく",
		"",
		"シェルアーマー",
	],
	"ヒコザル" => [
		"もうか",
		"",
		"てつのこぶし",
	],
	"モウカザル" => [
		"もうか",
		"",
		"てつのこぶし",
	],
	"ゴウカザル" => [
		"もうか",
		"",
		"てつのこぶし",
	],
	"ポッチャマ" => [
		"げきりゅう",
		"",
		"まけんき",
	],
	"ポッタイシ" => [
		"げきりゅう",
		"",
		"まけんき",
	],
	"エンペルト" => [
		"げきりゅう",
		"",
		"まけんき",
	],
	"ムックル" => [
		"するどいめ",
		"",
		"するどいめ",
	],
	"ムクバード" => [
		"いかく",
		"",
		"すてみ",
	],
	"ムクホーク" => [
		"いかく",
		"",
		"すてみ",
	],
	"ビッパ" => [
		"たんじゅん",
		"てんねん",
		"ムラっけ",
	],
	"ビーダル" => [
		"たんじゅん",
		"てんねん",
		"ムラっけ",
	],
	"コロボーシ" => [
		"だっぴ",
		"",
		"にげあし",
	],
	"コロトック" => [
		"むしのしらせ",
		"",
		"テクニシャン",
	],
	"コリンク" => [
		"とうそうしん",
		"いかく",
		"こんじょう",
	],
	"ルクシオ" => [
		"とうそうしん",
		"いかく",
		"こんじょう",
	],
	"レントラー" => [
		"とうそうしん",
		"いかく",
		"こんじょう",
	],
	"スボミー" => [
		"しぜんかいふく",
		"どくのトゲ",
		"リーフガード",
	],
	"ロズレイド" => [
		"しぜんかいふく",
		"どくのトゲ",
		"テクニシャン",
	],
	"ズガイドス" => [
		"かたやぶり",
		"",
		"ちからずく",
	],
	"ラムパルド" => [
		"かたやぶり",
		"",
		"ちからずく",
	],
	"タテトプス" => [
		"がんじょう",
		"",
		"ぼうおん",
	],
	"トリデプス" => [
		"がんじょう",
		"",
		"ぼうおん",
	],
	"ミノムッチkusa" => [
		"だっぴ",
		"",
		"ぼうじん",
	],
	"ミノムッチsuna" => [
		"だっぴ",
		"",
		"ぼうじん",
	],
	"ミノムッチgomi" => [
		"だっぴ",
		"",
		"ぼうじん",
	],
	"ミノマダムkusa" => [
		"きけんよち",
		"",
		"ぼうじん",
	],
	"ミノマダムjimen" => [
		"きけんよち",
		"",
		"ぼうじん",
	],
	"ミノマダムhagane" => [
		"きけんよち",
		"",
		"ぼうじん",
	],
	"ガーメイル" => [
		"むしのしらせ",
		"",
		"いろめがね",
	],
	"ミツハニー" => [
		"みつあつめ",
		"",
		"はりきり",
	],
	"ビークイン" => [
		"プレッシャー",
		"",
		"きんちょうかん",
	],
	"パチリス" => [
		"にげあし",
		"ものひろい",
		"ちくでん",
	],
	"ブイゼル" => [
		"すいすい",
		"",
		"みずのベール",
	],
	"フローゼル" => [
		"すいすい",
		"",
		"みずのベール",
	],
	"チェリンボ" => [
		"ようりょくそ",
		"",
		"",
	],
	"チェリムnega" => [
		"フラワーギフト",
		"",
		"",
	],
	"チェリムposi" => [
		"フラワーギフト",
		"",
		"",
	],
	"カラナクシwest" => [
		"ねんちゃく",
		"よびみず",
		"すなのちから",
	],
	"カラナクシeast" => [
		"ねんちゃく",
		"よびみず",
		"すなのちから",
	],
	"トリトドンwest" => [
		"ねんちゃく",
		"よびみず",
		"すなのちから",
	],
	"トリトドンeast" => [
		"ねんちゃく",
		"よびみず",
		"すなのちから",
	],
	"エテボース" => [
		"テクニシャン",
		"ものひろい",
		"スキルリンク",
	],
	"フワンテ" => [
		"ゆうばく",
		"かるわざ",
		"ねつぼうそう",
	],
	"フワライド" => [
		"ゆうばく",
		"かるわざ",
		"ねつぼうそう",
	],
	"ミミロル" => [
		"にげあし",
		"ぶきよう",
		"じゅうなん",
	],
	"ミミロップ" => [
		"メロメロボディ",
		"ぶきよう",
		"じゅうなん",
	],
	"ムウマージ" => [
		"ふゆう",
		"",
		"",
	],
	"ドンカラス" => [
		"ふみん",
		"きょううん",
		"じしんかじょう",
	],
	"ニャルマー" => [
		"じゅうなん",
		"マイペース",
		"するどいめ",
	],
	"ブニャット" => [
		"あついしぼう",
		"マイペース",
		"まけんき",
	],
	"リーシャン" => [
		"ふゆう",
		"",
		"",
	],
	"スカンプー" => [
		"あくしゅう",
		"ゆうばく",
		"するどいめ",
	],
	"スカタンク" => [
		"あくしゅう",
		"ゆうばく",
		"するどいめ",
	],
	"ドーミラー" => [
		"ふゆう",
		"たいねつ",
		"ヘヴィメタル",
	],
	"ドータクン" => [
		"ふゆう",
		"たいねつ",
		"ヘヴィメタル",
	],
	"ウソハチ" => [
		"がんじょう",
		"いしあたま",
		"びびり",
	],
	"マネネ" => [
		"ぼうおん",
		"フィルター",
		"テクニシャン",
	],
	"ピンプク" => [
		"しぜんかいふく",
		"てんのめぐみ",
		"フレンドガード",
	],
	"ペラップ" => [
		"するどいめ",
		"ちどりあし",
		"はとむね",
	],
	"ミカルゲ" => [
		"プレッシャー",
		"",
		"すりぬけ",
	],
	"フカマル" => [
		"すながくれ",
		"",
		"さめはだ",
	],
	"ガバイト" => [
		"すながくれ",
		"",
		"さめはだ",
	],
	"ガブリアス" => [
		"すながくれ",
		"",
		"さめはだ",
	],
	"ゴンベ" => [
		"ものひろい",
		"あついしぼう",
		"くいしんぼう",
	],
	"リオル" => [
		"ふくつのこころ",
		"せいしんりょく",
		"いたずらごころ",
	],
	"ルカリオ" => [
		"ふくつのこころ",
		"せいしんりょく",
		"せいぎのこころ",
	],
	"ヒポポタス" => [
		"すなおこし",
		"",
		"すなのちから",
	],
	"カバルドン" => [
		"すなおこし",
		"",
		"すなのちから",
	],
	"スコルピ" => [
		"カブトアーマー",
		"スナイパー",
		"するどいめ",
	],
	"ドラピオン" => [
		"カブトアーマー",
		"スナイパー",
		"するどいめ",
	],
	"グレッグル" => [
		"きけんよち",
		"かんそうはだ",
		"どくしゅ",
	],
	"ドクロッグ" => [
		"きけんよち",
		"かんそうはだ",
		"どくしゅ",
	],
	"マスキッパ" => [
		"ふゆう",
		"",
		"",
	],
	"ケイコウオ" => [
		"すいすい",
		"よびみず",
		"みずのベール",
	],
	"ネオラント" => [
		"すいすい",
		"よびみず",
		"みずのベール",
	],
	"タマンタ" => [
		"すいすい",
		"ちょすい",
		"みずのベール",
	],
	"ユキカブリ" => [
		"ゆきふらし",
		"",
		"ぼうおん",
	],
	"ユキノオー" => [
		"ゆきふらし",
		"",
		"ぼうおん",
	],
	"マニューラ" => [
		"プレッシャー",
		"プレッシャー",
		"わるいてぐせ",
	],
	"ジバコイル" => [
		"じりょく",
		"がんじょう",
		"アナライズ",
	],
	"ベロベルト" => [
		"マイペース",
		"どんかん",
		"ノーてんき",
	],
	"ドサイドン" => [
		"ひらいしん",
		"ハードロック",
		"すてみ",
	],
	"モジャンボ" => [
		"ようりょくそ",
		"リーフガード",
		"さいせいりょく",
	],
	"エレキブル" => [
		"でんきエンジン",
		"",
		"やるき",
	],
	"ブーバーン" => [
		"ほのおのからだ",
		"",
		"やるき",
	],
	"トゲキッス" => [
		"はりきり",
		"てんのめぐみ",
		"きょううん",
	],
	"メガヤンマ" => [
		"かそく",
		"いろめがね",
		"おみとおし",
	],
	"リーフィア" => [
		"リーフガード",
		"リーフガード",
		"ようりょくそ",
	],
	"グレイシア" => [
		"ゆきがくれ",
		"ゆきがくれ",
		"アイスボディ",
	],
	"グライオン" => [
		"かいりきバサミ",
		"すながくれ",
		"ポイズンヒール",
	],
	"マンムー" => [
		"どんかん",
		"ゆきがくれ",
		"あついしぼう",
	],
	"ポリゴンＺ" => [
		"てきおうりょく",
		"ダウンロード",
		"アナライズ",
	],
	"エルレイド" => [
		"ふくつのこころ",
		"ふくつのこころ",
		"せいぎのこころ",
	],
	"ダイノーズ" => [
		"がんじょう",
		"じりょく",
		"すなのちから",
	],
	"ヨノワール" => [
		"プレッシャー",
		"",
		"",
	],
	"ユキメノコ" => [
		"ゆきがくれ",
		"ゆきがくれ",
		"のろわれボディ",
	],
	"ロトムnormal" => [
		"ふゆう",
		"",
		"",
	],
	"ロトムhot" => [
		"ふゆう",
		"",
		"",
	],
	"ロトムwash" => [
		"ふゆう",
		"",
		"",
	],
	"ロトムcold" => [
		"ふゆう",
		"",
		"",
	],
	"ロトムfan" => [
		"ふゆう",
		"",
		"",
	],
	"ロトムcut" => [
		"ふゆう",
		"",
		"",
	],
	"ユクシー" => [
		"ふゆう",
		"",
		"",
	],
	"エムリット" => [
		"ふゆう",
		"",
		"",
	],
	"アグノム" => [
		"ふゆう",
		"",
		"",
	],
	"ディアルガ" => [
		"プレッシャー",
		"",
		"テレパシー",
	],
	"パルキア" => [
		"プレッシャー",
		"",
		"テレパシー",
	],
	"ヒードラン" => [
		"もらいび",
		"",
		"ほのおのからだ",
	],
	"レジギガス" => [
		"スロースタート",
		"",
		"",
	],
	"ギラティナanother" => [
		"プレッシャー",
		"",
		"テレパシー",
	],
	"ギラティナorigin" => [
		"ふゆう",
		"",
		"ふゆう",
	],
	"クレセリア" => [
		"ふゆう",
		"",
		"",
	],
	"フィオネ" => [
		"うるおいボディ",
		"",
		"",
	],
	"マナフィ" => [
		"うるおいボディ",
		"",
		"",
	],
	"ダークライ" => [
		"ナイトメア",
		"",
		"",
	],
	"シェイミland" => [
		"しぜんかいふく",
		"",
		"",
	],
	"シェイミsky" => [
		"てんのめぐみ",
		"",
		"",
	],
	"アルセウスnormal" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスbattle" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスhikou" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスpoison" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスjimen" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスiwa" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスmushi" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスghost" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスmetal" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスfire" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスwater" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスkusa" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスelectric" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスesper" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスkoori" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスdragon" => [
		"マルチタイプ",
		"",
		"",
	],
	"アルセウスaku" => [
		"マルチタイプ",
		"",
		"",
	],
	"ビクティニ" => [
		"しょうりのほし",
		"",
		"",
	],
	"ツタージャ" => [
		"しんりょく",
		"しんりょく",
		"あまのじゃく",
	],
	"ジャノビー" => [
		"しんりょく",
		"しんりょく",
		"あまのじゃく",
	],
	"ジャローダ" => [
		"しんりょく",
		"しんりょく",
		"あまのじゃく",
	],
	"ポカブ" => [
		"もうか",
		"もうか",
		"あついしぼう",
	],
	"チャオブー" => [
		"もうか",
		"もうか",
		"あついしぼう",
	],
	"エンブオー" => [
		"もうか",
		"もうか",
		"すてみ",
	],
	"ミジュマル" => [
		"げきりゅう",
		"げきりゅう",
		"シェルアーマー",
	],
	"フタチマル" => [
		"げきりゅう",
		"げきりゅう",
		"シェルアーマー",
	],
	"ダイケンキ" => [
		"げきりゅう",
		"げきりゅう",
		"シェルアーマー",
	],
	"ミネズミ" => [
		"にげあし",
		"するどいめ",
		"アナライズ",
	],
	"ミルホッグ" => [
		"はっこう",
		"するどいめ",
		"アナライズ",
	],
	"ヨーテリー" => [
		"やるき",
		"ものひろい",
		"にげあし",
	],
	"ハーデリア" => [
		"いかく",
		"すなかき",
		"きもったま",
	],
	"ムーランド" => [
		"いかく",
		"すなかき",
		"きもったま",
	],
	"チョロネコ" => [
		"じゅうなん",
		"かるわざ",
		"いたずらごころ",
	],
	"レパルダス" => [
		"じゅうなん",
		"かるわざ",
		"いたずらごころ",
	],
	"ヤナップ" => [
		"くいしんぼう",
		"",
		"しんりょく",
	],
	"ヤナッキー" => [
		"くいしんぼう",
		"",
		"しんりょく",
	],
	"バオップ" => [
		"くいしんぼう",
		"",
		"もうか",
	],
	"バオッキー" => [
		"くいしんぼう",
		"",
		"もうか",
	],
	"ヒヤップ" => [
		"くいしんぼう",
		"",
		"げきりゅう",
	],
	"ヒヤッキー" => [
		"くいしんぼう",
		"",
		"げきりゅう",
	],
	"ムンナ" => [
		"よちむ",
		"シンクロ",
		"テレパシー",
	],
	"ムシャーナ" => [
		"よちむ",
		"シンクロ",
		"テレパシー",
	],
	"マメパト" => [
		"はとむね",
		"きょううん",
		"とうそうしん",
	],
	"ハトーボー" => [
		"はとむね",
		"きょううん",
		"とうそうしん",
	],
	"ケンホロウ" => [
		"はとむね",
		"きょううん",
		"とうそうしん",
	],
	"シママ" => [
		"ひらいしん",
		"でんきエンジン",
		"そうしょく",
	],
	"ゼブライカ" => [
		"ひらいしん",
		"でんきエンジン",
		"そうしょく",
	],
	"ダンゴロ" => [
		"がんじょう",
		"",
		"すなのちから",
	],
	"ガントル" => [
		"がんじょう",
		"",
		"すなのちから",
	],
	"ギガイアス" => [
		"がんじょう",
		"",
		"すなのちから",
	],
	"コロモリ" => [
		"てんねん",
		"ぶきよう",
		"たんじゅん",
	],
	"ココロモリ" => [
		"てんねん",
		"ぶきよう",
		"たんじゅん",
	],
	"モグリュー" => [
		"すなかき",
		"すなのちから",
		"かたやぶり",
	],
	"ドリュウズ" => [
		"すなかき",
		"すなのちから",
		"かたやぶり",
	],
	"タブンネ" => [
		"いやしのこころ",
		"さいせいりょく",
		"ぶきよう",
	],
	"ドッコラー" => [
		"こんじょう",
		"ちからずく",
		"てつのこぶし",
	],
	"ドテッコツ" => [
		"こんじょう",
		"ちからずく",
		"てつのこぶし",
	],
	"ローブシン" => [
		"こんじょう",
		"ちからずく",
		"てつのこぶし",
	],
	"オタマロ" => [
		"すいすい",
		"うるおいボディ",
		"ちょすい",
	],
	"ガマガル" => [
		"すいすい",
		"うるおいボディ",
		"ちょすい",
	],
	"ガマゲロゲ" => [
		"すいすい",
		"どくしゅ",
		"ちょすい",
	],
	"ナゲキ" => [
		"こんじょう",
		"せいしんりょく",
		"かたやぶり",
	],
	"ダゲキ" => [
		"がんじょう",
		"せいしんりょく",
		"かたやぶり",
	],
	"クルミル" => [
		"むしのしらせ",
		"ようりょくそ",
		"ぼうじん",
	],
	"クルマユ" => [
		"リーフガード",
		"ようりょくそ",
		"ぼうじん",
	],
	"ハハコモリ" => [
		"むしのしらせ",
		"ようりょくそ",
		"ぼうじん",
	],
	"フシデ" => [
		"どくのトゲ",
		"むしのしらせ",
		"はやあし",
	],
	"ホイーガ" => [
		"どくのトゲ",
		"むしのしらせ",
		"はやあし",
	],
	"ペンドラー" => [
		"どくのトゲ",
		"むしのしらせ",
		"はやあし",
	],
	"モンメン" => [
		"いたずらごころ",
		"すりぬけ",
		"ようりょくそ",
	],
	"エルフーン" => [
		"いたずらごころ",
		"すりぬけ",
		"ようりょくそ",
	],
	"チュリネ" => [
		"ようりょくそ",
		"マイペース",
		"リーフガード",
	],
	"ドレディア" => [
		"ようりょくそ",
		"マイペース",
		"リーフガード",
	],
	"バスラオblack" => [
		"すてみ",
		"てきおうりょく",
		"かたやぶり",
	],
	"バスラオwhite" => [
		"いしあたま",
		"てきおうりょく",
		"かたやぶり",
	],
	"メグロコ" => [
		"いかく",
		"じしんかじょう",
		"いかりのつぼ",
	],
	"ワルビル" => [
		"いかく",
		"じしんかじょう",
		"いかりのつぼ",
	],
	"ワルビアル" => [
		"いかく",
		"じしんかじょう",
		"いかりのつぼ",
	],
	"ダルマッカ" => [
		"はりきり",
		"",
		"せいしんりょく",
	],
	"ヒヒダルマaction" => [
		"ちからずく",
		"",
		"ダルマモード",
	],
	"ヒヒダルマmeditation" => [
		"ちからずく",
		"",
		"ダルマモード",
	],
	"マラカッチ" => [
		"ちょすい",
		"ようりょくそ",
		"よびみず",
	],
	"イシズマイ" => [
		"がんじょう",
		"シェルアーマー",
		"くだけるよろい",
	],
	"イワパレス" => [
		"がんじょう",
		"シェルアーマー",
		"くだけるよろい",
	],
	"ズルッグ" => [
		"だっぴ",
		"じしんかじょう",
		"いかく",
	],
	"ズルズキン" => [
		"だっぴ",
		"じしんかじょう",
		"いかく",
	],
	"シンボラー" => [
		"ミラクルスキン",
		"マジックガード",
		"いろめがね",
	],
	"デスマス" => [
		"ミイラ",
		"",
		"",
	],
	"デスカーン" => [
		"ミイラ",
		"",
		"",
	],
	"プロトーガ" => [
		"ハードロック",
		"がんじょう",
		"すいすい",
	],
	"アバゴーラ" => [
		"ハードロック",
		"がんじょう",
		"すいすい",
	],
	"アーケン" => [
		"よわき",
		"",
		"",
	],
	"アーケオス" => [
		"よわき",
		"",
		"",
	],
	"ヤブクロン" => [
		"あくしゅう",
		"ねんちゃく",
		"ゆうばく",
	],
	"ダストダス" => [
		"あくしゅう",
		"くだけるよろい",
		"ゆうばく",
	],
	"ゾロア" => [
		"イリュージョン",
		"",
		"",
	],
	"ゾロアーク" => [
		"イリュージョン",
		"",
		"",
	],
	"チラーミィ" => [
		"メロメロボディ",
		"テクニシャン",
		"スキルリンク",
	],
	"チラチーノ" => [
		"メロメロボディ",
		"テクニシャン",
		"スキルリンク",
	],
	"ゴチム" => [
		"おみとおし",
		"",
		"かげふみ",
	],
	"ゴチミル" => [
		"おみとおし",
		"",
		"かげふみ",
	],
	"ゴチルゼル" => [
		"おみとおし",
		"",
		"かげふみ",
	],
	"ユニラン" => [
		"ぼうじん",
		"マジックガード",
		"さいせいりょく",
	],
	"ダブラン" => [
		"ぼうじん",
		"マジックガード",
		"さいせいりょく",
	],
	"ランクルス" => [
		"ぼうじん",
		"マジックガード",
		"さいせいりょく",
	],
	"コアルヒー" => [
		"するどいめ",
		"はとむね",
		"うるおいボディ",
	],
	"スワンナ" => [
		"するどいめ",
		"はとむね",
		"うるおいボディ",
	],
	"バニプッチ" => [
		"アイスボディ",
		"",
		"くだけるよろい",
	],
	"バニリッチ" => [
		"アイスボディ",
		"",
		"くだけるよろい",
	],
	"バイバニラ" => [
		"アイスボディ",
		"",
		"くだけるよろい",
	],
	"シキジカspring" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"シキジカsummer" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"シキジカautumn" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"シキジカwinter" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"メブキジカspring" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"メブキジカsummer" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"メブキジカautumn" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"メブキジカwinter" => [
		"ようりょくそ",
		"そうしょく",
		"てんのめぐみ",
	],
	"エモンガ" => [
		"せいでんき",
		"",
		"でんきエンジン",
	],
	"カブルモ" => [
		"むしのしらせ",
		"だっぴ",
		"ノーガード",
	],
	"シュバルゴ" => [
		"むしのしらせ",
		"シェルアーマー",
		"ぼうじん",
	],
	"タマゲタケ" => [
		"ほうし",
		"",
		"さいせいりょく",
	],
	"モロバレル" => [
		"ほうし",
		"",
		"さいせいりょく",
	],
	"プルリル" => [
		"ちょすい",
		"のろわれボディ",
		"しめりけ",
	],
	"ブルンゲル" => [
		"ちょすい",
		"のろわれボディ",
		"しめりけ",
	],
	"ママンボウ" => [
		"いやしのこころ",
		"うるおいボディ",
		"さいせいりょく",
	],
	"バチュル" => [
		"ふくがん",
		"きんちょうかん",
		"むしのしらせ",
	],
	"デンチュラ" => [
		"ふくがん",
		"きんちょうかん",
		"むしのしらせ",
	],
	"テッシード" => [
		"てつのトゲ",
		"",
		"",
	],
	"ナットレイ" => [
		"てつのトゲ",
		"",
		"",
	],
	"ギアル" => [
		"プラス",
		"マイナス",
		"クリアボディ",
	],
	"ギギアル" => [
		"プラス",
		"マイナス",
		"クリアボディ",
	],
	"ギギギアル" => [
		"プラス",
		"マイナス",
		"クリアボディ",
	],
	"シビシラス" => [
		"ふゆう",
		"",
		"",
	],
	"シビビール" => [
		"ふゆう",
		"",
		"",
	],
	"シビルドン" => [
		"ふゆう",
		"",
		"",
	],
	"リグレー" => [
		"テレパシー",
		"シンクロ",
		"アナライズ",
	],
	"オーベム" => [
		"テレパシー",
		"シンクロ",
		"アナライズ",
	],
	"ヒトモシ" => [
		"もらいび",
		"ほのおのからだ",
		"かげふみ",
	],
	"ランプラー" => [
		"もらいび",
		"ほのおのからだ",
		"かげふみ",
	],
	"シャンデラ" => [
		"もらいび",
		"ほのおのからだ",
		"かげふみ",
	],
	"キバゴ" => [
		"とうそうしん",
		"かたやぶり",
		"きんちょうかん",
	],
	"オノンド" => [
		"とうそうしん",
		"かたやぶり",
		"きんちょうかん",
	],
	"オノノクス" => [
		"とうそうしん",
		"かたやぶり",
		"きんちょうかん",
	],
	"クマシュン" => [
		"ゆきがくれ",
		"",
		"びびり",
	],
	"ツンベアー" => [
		"ゆきがくれ",
		"",
		"すいすい",
	],
	"フリージオ" => [
		"ふゆう",
		"",
		"",
	],
	"チョボマキ" => [
		"うるおいボディ",
		"シェルアーマー",
		"ぼうじん",
	],
	"アギルダー" => [
		"うるおいボディ",
		"ねんちゃく",
		"かるわざ",
	],
	"マッギョ" => [
		"せいでんき",
		"じゅうなん",
		"すながくれ",
	],
	"コジョフー" => [
		"せいしんりょく",
		"さいせいりょく",
		"すてみ",
	],
	"コジョンド" => [
		"せいしんりょく",
		"さいせいりょく",
		"すてみ",
	],
	"クリムガン" => [
		"さめはだ",
		"ちからずく",
		"かたやぶり",
	],
	"ゴビット" => [
		"てつのこぶし",
		"ぶきよう",
		"ノーガード",
	],
	"ゴルーグ" => [
		"てつのこぶし",
		"ぶきよう",
		"ノーガード",
	],
	"コマタナ" => [
		"まけんき",
		"せいしんりょく",
		"プレッシャー",
	],
	"キリキザン" => [
		"まけんき",
		"せいしんりょく",
		"プレッシャー",
	],
	"バッフロン" => [
		"すてみ",
		"そうしょく",
		"ぼうおん",
	],
	"ワシボン" => [
		"するどいめ",
		"ちからずく",
		"はりきり",
	],
	"ウォーグル" => [
		"するどいめ",
		"ちからずく",
		"まけんき",
	],
	"バルチャイ" => [
		"はとむね",
		"ぼうじん",
		"くだけるよろい",
	],
	"バルジーナ" => [
		"はとむね",
		"ぼうじん",
		"くだけるよろい",
	],
	"クイタラン" => [
		"くいしんぼう",
		"もらいび",
		"しろいけむり",
	],
	"アイアント" => [
		"むしのしらせ",
		"はりきり",
		"なまけ",
	],
	"モノズ" => [
		"はりきり",
		"",
		"",
	],
	"ジヘッド" => [
		"はりきり",
		"",
		"",
	],
	"サザンドラ" => [
		"ふゆう",
		"",
		"",
	],
	"メラルバ" => [
		"ほのおのからだ",
		"",
		"むしのしらせ",
	],
	"ウルガモス" => [
		"ほのおのからだ",
		"",
		"むしのしらせ",
	],
	"コバルオン" => [
		"せいぎのこころ",
		"",
		"",
	],
	"テラキオン" => [
		"せいぎのこころ",
		"",
		"",
	],
	"ビリジオン" => [
		"せいぎのこころ",
		"",
		"",
	],
	"トルネロス" => [
		"いたずらごころ",
		"",
		"まけんき",
	],
	"ボルトロス" => [
		"いたずらごころ",
		"",
		"まけんき",
	],
	"レシラム" => [
		"ターボブレイズ",
		"",
		"",
	],
	"ゼクロム" => [
		"テラボルテージ",
		"",
		"",
	],
	"ランドロス" => [
		"すなのちから",
		"",
		"ちからずく",
	],
	"キュレムa" => [
		"プレッシャー",
		"",
		"",
	],
	"ケルディオ" => [
		"せいぎのこころ",
		"",
		"",
	],
	"メロエッタvoice" => [
		"てんのめぐみ",
		"",
		"",
	],
	"メロエッタstep" => [
		"てんのめぐみ",
		"",
		"",
	],
	"ゲノセクトnormal" => [
		"ダウンロード",
		"",
		"",
	],
	"ゲノセクトaqua" => [
		"ダウンロード",
		"",
		"",
	],
	"ゲノセクトinazuma" => [
		"ダウンロード",
		"",
		"",
	],
	"ゲノセクトblaze" => [
		"ダウンロード",
		"",
		"",
	],
	"ゲノセクトfreeze" => [
		"ダウンロード",
		"",
		"",
	],
}
