//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		br_bvdelete_proc.h
 *	@brief	バトルビデオ保存プロセス
 *	@author	Toru=Nagihashi
 *	@date		2009.11.13
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include "br_proc_sys.h"
#include "br_res.h"
#include "br_fade.h"
#include "br_net.h"
#include "br_inner.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体
*/
//=============================================================================
//-------------------------------------
///	バトルビデオ送信プロセス引数
//=====================================
typedef struct 
{
  BR_FADE_WORK      *p_fade;      //[in ]フェード
	GFL_CLUNIT			  *p_unit;			//[in ]ユニット
	BR_RES_WORK			  *p_res;				//[in ]リソース管理
  BR_NET_WORK       *p_net;       //[in ]通信管理
	BR_PROC_SYS			  *p_procsys;		//[in ]プロセス管理
  GAMEDATA          *p_gamedata;  //[in ]ゲームデータ
  const BR_SAVE_INFO*cp_rec_saveinfo;//[in ]自分の録画保存状況
  u64               video_number; //[in ]保存するビデオナンバー
  BOOL              is_secure;    //[in ]視聴済みかどうか
  BOOL              is_save;      //[out]セーブしたかどうか
  BR_SAVEDATA_IDX   save_idx;     //[out]どこにセーブしたのか()
} BR_BVSAVE_PROC_PARAM;


//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================
//-------------------------------------
///	バトルビデオ送信プロセスデータ
//=====================================
extern const GFL_PROC_DATA	BR_BVSAVE_ProcData;
