//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		br_musicalsend_proc.h
 *	@brief	ミュージカル送信プロセス
 *	@author	Toru=Nagihashi
 *	@date		2009.11.13
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include "br_proc_sys.h"
#include "br_res.h"
#include "br_graphic.h"
#include "br_fade.h"
#include "br_net.h"
#include "br_sidebar.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
//-------------------------------------
///	戻り値
//=====================================
typedef enum
{
  BR_MUSICALSEND_RET_RETURN,  //戻った
  BR_MUSICALSEND_RET_SEND,    //送信した
} BR_MUSICALSEND_RET;

//=============================================================================
/**
 *					構造体
*/
//=============================================================================
//-------------------------------------
///	ミュージカル送信プロセス引数
//=====================================
typedef struct 
{
  BR_FADE_WORK    *p_fade;      //[in ]フェード
  BR_SIDEBAR_WORK *p_sidebar;   //[in ]サイドバー
  BR_GRAPHIC_WORK	*p_graphic;	  //[in ]グラフィック管理
	BR_RES_WORK			*p_res;				//[in ]リソース管理
	BR_PROC_SYS			*p_procsys;		//[in ]プロセス管理
  BR_NET_WORK     *p_net;       //[in ]通信管理
  GAMEDATA        *p_gamedata;  //[in ]ゲームデータ
  BR_MUSICALSEND_RET  ret;      //[out]戻り値
} BR_MUSICALSEND_PROC_PARAM;


//=============================================================================
/**
 *					外部公開関数
*/
//=============================================================================
//-------------------------------------
///	ミュージカル送信プロセスデータ
//=====================================
extern const GFL_PROC_DATA	BR_MUSICALSEND_ProcData;
