//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		br_res.h
 *	@brief	バトルレコーダーリソース管理
 *	@author	Toru=Nagihashi
 *	@date		2009.11.11
 *
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "br_inner.h"	//BR_PROCID
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
//-------------------------------------
///	OBJ
//=====================================
typedef enum
{
	BR_RES_OBJ_TAG,	//タグ、ライン
	BR_RES_OBJ_LINE,	//タグ、ライン

	BR_RES_OBJ_MAX
} BR_RES_OBJID;

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	OBJ用リソース
//=====================================
typedef struct
{
	u32 nce;
	u32 ncg;
	u32 ncl;
}BR_RES_OBJ_DATA;

//-------------------------------------
///	リソースワーク
//=====================================
typedef struct _BR_RES_WORK BR_RES_WORK;

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
///	リソース管理作成
//=====================================
extern BR_RES_WORK *BR_RES_Init( HEAPID heapID );
extern void BR_RES_Exit( BR_RES_WORK *p_wk );

//-------------------------------------
///	リソース読み込み
//=====================================
//BGはメニューにあったものを読み込む
extern void BR_RES_LoadBG( BR_RES_WORK *p_wk, BR_PROCID procID, HEAPID heapID );
extern void BR_RES_UnLoadBG( BR_RES_WORK *p_wk, BR_PROCID procID );

//OBJは個別に読み込む
extern void BR_RES_LoadOBJ( BR_RES_WORK *p_wk, BR_RES_OBJID objID, HEAPID heapID, BR_RES_OBJ_DATA *p_res );
extern void BR_RES_UnLoadOBJ( BR_RES_WORK *p_wk, BR_RES_OBJID objID );

