//==============================================================================
/**
 * @file    anketo_save.c
 * @brief   すれ違いアンケート用セーブデータ
 * @author  matsuda
 * @date    2010.01.20(水)
 */
//==============================================================================
#include <gflib.h>
#include "savedata/save_control.h"
#include "savedata/save_tbl.h"
#include "savedata/anketo_save.h"


//==============================================================================
//  定数定義
//==============================================================================
///質問のバリエーション数
#define ANKETO_ITEM_NUM       (30)
///回答のバリエーション数
#define ANKETO_ANSWER_NUM     (150)


//==============================================================================
//  構造体定義
//==============================================================================
struct _ANKETO_SAVE_WORK{
  u16 today_count[ANKETO_ITEM_NUM];        ///<今日の調査人数
  u8 today_answer[ANKETO_ANSWER_NUM];      ///<今日の答え(項目分)
  u8 mine_answer[ANKETO_ITEM_NUM];         ///<自分の答え
  u32 total_count[ANKETO_ITEM_NUM];        ///<今までの調査人数の合計
  u16 total_answer[ANKETO_ANSWER_NUM];     ///<今までの答えの合計(項目分)
};



//==============================================================================
//
//  
//
//==============================================================================
//------------------------------------------------------------------
/**
 * セーブデータサイズを返す
 *
 * @retval  int		
 */
//------------------------------------------------------------------
u32 AnketoSave_GetWorkSize( void )
{
	return sizeof(ANKETO_SAVE_WORK);
}

//--------------------------------------------------------------
/**
 * @brief   ワーク初期化
 *
 * @param   rec		
 */
//--------------------------------------------------------------
void AnketoSave_WorkInit(void *work)
{
  ANKETO_SAVE_WORK *anketo_save = work;
  
  GFL_STD_MemClear(anketo_save, sizeof(ANKETO_SAVE_WORK));
}


