//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		prog\src\savedata\battle_savedata_def.h
 *	@brief  バトル大会用  プライベートヘッダ
 *	@author	Toru=Nagihashi
 *	@date		2010.03.08
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "savedata/rndmatch_savedata.h"
#include "savedata/livematch_savedata.h"
//=============================================================================
/**
 *					ランダムマッチの構造体
*/
//=============================================================================
//-------------------------------------
///	セーブデータ不完全型
//=====================================
struct _RNDMATCH_DATA
{ 
  u16 data  [RNDMATCH_TYPE_MAX][RNDMATCH_PARAM_IDX_MAX];
};


//=============================================================================
/**
 *					ライブ大会の構造体
*/
//=============================================================================
//-------------------------------------
///	対戦相手情報
//=====================================
typedef struct 
{
  u8  mac_addr[6];
  u8  param[LIVEMATCH_FOEDATA_PARAM_MAX];
} LIVEMATCH_FOEDATA;

//-------------------------------------
///	セーブデータ不完全型
//=====================================
struct _LIVEMATCH_DATA
{ 
  //自分の情報
  u8  mac_addr[6];
  u8  param[LIVEMATCH_MYDATA_PARAM_MAX];
  
  //対戦相手のデータ
  LIVEMATCH_FOEDATA foe[LIVEMATCH_FOEDATA_MAX];
};
