//==============================================================================
/**
 * @file	contest_savedata.c
 * @brief	ボックスセーブデータ
 * @author	ariizumi
 * @date	2008.11.07
 */
//==============================================================================

//　※中は仮です Ari081107

#include <gflib.h>

#include "savedata/box_savedata.h"

//======================================================================
//	define
//======================================================================

//======================================================================
//	enum
//======================================================================

//======================================================================
//	typedef struct
//======================================================================
struct _BOX_DATA{
	//プラチナから
	u32		currentTrayNumber;
//	POKEMON_PASO_PARAM	ppp[BOX_MAX_TRAY][BOX_MAX_POS];
	u8		ppp[18][30][0x88];
	STRCODE trayName[18];
	u8		wallPaper[18];
	u8		daisukiBitFlg;
};
//======================================================================
//	proto
//======================================================================

//---------------------------------------------------------------------------
/**
 * @brief	ボックスデータのサイズ取得
 * @retval	u32		サイズ
 */
//---------------------------------------------------------------------------
u32	BOXDAT_GetTotalSize(void)
{
	return sizeof( BOX_DATA );
}

//---------------------------------------------------------------------------
/**
 * @brief	ボックスデータの初期化処理
 * @param	boxData		ボックスセーブデータへのポインタ
 */
//---------------------------------------------------------------------------
void	BOXDAT_Init( BOX_DATA *boxData )
{
	u8 bi,pi,i;

	boxData->currentTrayNumber = 0;
	for( bi=0 ; bi<18 ; bi++ ){
		for( pi=0 ; pi<30 ; pi++ ){
			for( i=0 ; i<88 ; i++ ){
				boxData->ppp[bi][pi][i] = 0;
			}
		}
	}
}

//---------------------------------------------------------------------------
/**
 * @brief	ボックスデータのセット(1ボックス単位(30匹))
 * @param	trayIdx		ボックス番号
 * @param	dataPtr		保存するデータのポインタ
 * @param	boxData		ボックスセーブデータへのポインタ
 */
//---------------------------------------------------------------------------
void BOXDAT_SetPPPData_Tray( u8 trayIdx , void *dataPtr , BOX_DATA *boxData )
{
	//通信用に切り分け、解読シーケンスをはさむか？
	GFL_STD_MemCopy( dataPtr , (void*)boxData->ppp[trayIdx] , 0x88*30 );

}


