
//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	未分類セーブデータ
//	・どこに分類するべきか判断に迷うもの。
//	・規模が小さくそのためにブロック確保をするのがもったいないもの
//=====================================
struct _MISC
{	
  u32 gold;         //お金
  u32 badge;     //バッチBIT

  u16 favorite_monsno;		//お気に入りポケモン
	u8  favorite_form_no:7;		//お気に入りポケモンのフォルム番号
	u8  favorite_egg_flag:1;	//お気に入りポケモンのタマゴフラグ
	u8	namein_mode[NAMEIN_MAX];	//5つ

	//パルパーク
	u32 palpark_highscore:28;
	u32 palpark_finish_state:4;
};

