//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		rndmatch_savedata.c
 *	@brief	ランダムバトルマッチ用セーブデータ
 *	@author	Toru=Nagihashi
 *	@data		2009.12.19
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
//ライブラリ
#include <gflib.h>

//セーブデータ
#include "savedata/save_tbl.h"

//外部公開
#include "savedata/rndmatch_savedata.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	セーブデータ不完全型
//=====================================
struct _RNDMATCH_DATA
{ 
  u16 data  [RNDMATCH_TYPE_MAX][RNDMATCH_PARAM_IDX_MAX];
};

//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================

//=============================================================================
/**
 *          外部公開
 */
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  構造体のサイズ取得
 *
 *	@param	void 
 *	@retval 構造体のサイズ取得
 */
//-----------------------------------------------------------------------------
int RNDMATCH_GetWorkSize( void )
{ 
  return sizeof(RNDMATCH_DATA);
}

//----------------------------------------------------------------------------
/**
 *	@brief  初期化
 *
 *	@param	RNDMATCH_DATA *p_wk ワーク
 */
//-----------------------------------------------------------------------------
void RNDMATCH_Init( RNDMATCH_DATA *p_wk )
{ 
  GFL_STD_MemClear( p_wk, sizeof(RNDMATCH_DATA) );
}

//----------------------------------------------------------------------------
/**
 *	@brief  コンスト版のランダムバトルマッチ取得
 *
 *	@param	const SAVE_CONTROL_WORK * cp_sv   セーブデータ
 *
 *	@return コンスト版のランダムバトルマッチ
 */
//-----------------------------------------------------------------------------
const RNDMATCH_DATA * SaveData_GetRndMatchConst( const SAVE_CONTROL_WORK * cp_sv )
{ 
  return SaveData_GetRndMatch( (SAVE_CONTROL_WORK *)cp_sv );
}
//----------------------------------------------------------------------------
/**
 *	@brief  ランダムバトルマッチ取得
 *
 *	@param	const SAVE_CONTROL_WORK * cp_sv   セーブデータ
 *
 *	@return ランダムバトルマッチ
 */
//-----------------------------------------------------------------------------
RNDMATCH_DATA * SaveData_GetRndMatch( SAVE_CONTROL_WORK * p_sv )
{ 
  return SaveControl_DataPtrGet(p_sv, GMDATA_ID_RNDMATCH );
}

//----------------------------------------------------------------------------
/**
 *	@brief  データ取得
 *
 *	@param	const RNDMATCH_DATA *cp_wk ワーク
 *	@param	type                  ランダムマッチの種類
 *	@param	idx                   取得するデータ
 *
 *	@return データ
 */
//-----------------------------------------------------------------------------
u16 RNDMATCH_GetParam( const RNDMATCH_DATA *cp_wk, RNDMATCH_TYPE type, RNDMATCH_PARAM_IDX idx )
{ 
  return cp_wk->data[ type ][ idx ];
}
//----------------------------------------------------------------------------
/**
 *	@brief  データ設定
 *
 *	@param	RNDMATCH_DATA *p_wk   ワーク
 *	@param	type                  ランダムマッチの種類
 *	@param	idx                   取得するデータ
 *	@param  num                   設定するデータ            
 */
//-----------------------------------------------------------------------------
void RNDMATCH_SetParam( RNDMATCH_DATA *p_wk, RNDMATCH_TYPE type, RNDMATCH_PARAM_IDX idx, u16 num )
{ 
  p_wk->data[ type ][ idx ] = num;
}
//----------------------------------------------------------------------------
/**
 *	@brief  データをインクリメント
 *
 *	@param	RNDMATCH_DATA *p_wk   ワーク
 *	@param	type                  ランダムマッチの種類
 *	@param	idx                   取得するデータ
 */
//-----------------------------------------------------------------------------
void RNDMATCH_AddParam( RNDMATCH_DATA *p_wk, RNDMATCH_TYPE type, RNDMATCH_PARAM_IDX idx )
{ 
  p_wk->data[ type ][ idx ]++;
}
