//============================================================================================
/**
 * @file	situation.c
 * @brief	状況データアクセス
 * @author	tamada GAME FREAK inc.
 * @date	2005.12.03
 */
//============================================================================================
#include <gflib.h>
#include "savedata/save_tbl.h"
#include "savedata/situation.h"
#include "gamesystem/playerwork.h"


//============================================================================================
//============================================================================================
//----------------------------------------------------------
/**
 * @brief	状況データ型定義
 */
//----------------------------------------------------------
struct _SITUATION {
	LOCATION start_loc;
	LOCATION entrance_loc;
	LOCATION special_loc;

	//PLAYER_WORKからセーブに必要なものだけを抜粋
	ZONEID zoneID;
	VecFx32 position;
	u16 direction;
};


//============================================================================================
//
//	セーブデータシステムが依存する関数
//
//============================================================================================
//----------------------------------------------------------
/**
 * @brief	状況ワークのサイズ取得
 * @return	int		サイズ（バイト単位）
 */
//----------------------------------------------------------
int Situation_GetWorkSize(void)
{
	return sizeof(SITUATION);
}

//============================================================================================
//
//	状況データ操作のための関数
//
//============================================================================================
//----------------------------------------------------------
/**
 * @brief	状況データの初期化
 * @param	st	状況ワークへのポインタ
 */
//----------------------------------------------------------
void Situation_Init(SITUATION * st)
{
	GFL_STD_MemClear(st, sizeof(SITUATION));
}

//----------------------------------------------------------
/**
 * @brief	現在のLOCATIONを返す
 * @param	st	状況ワークへのポインタ
 * @return	LOCATIONへのポインタ
 */
//----------------------------------------------------------
LOCATION * Situation_GetStartLocation(SITUATION * st)
{
	return &st->start_loc;
}

//----------------------------------------------------------
/**
 * @brief	直前に入った出入口を示すLOCATIONへのポインタ
 * @param	st	状況ワークへのポインタ
 * @return	LOCATIONへのポインタ
 */
//----------------------------------------------------------
LOCATION * Situation_GetEntranceLocation(SITUATION * st)
{
	return &st->entrance_loc;
}

//----------------------------------------------------------
/**
 * @brief	特殊接続情報の取得
 * @param	st	状況ワークへのポインタ
 * @return	LOCATION	特殊接続情報へのポインタ
 */
//----------------------------------------------------------
LOCATION * Situation_GetSpecialLocation(SITUATION * st)
{
	return &st->special_loc;
}


//============================================================================================
//
//	セーブデータ取得のための関数
//
//============================================================================================
//----------------------------------------------------------
/**
 * @brief	状況データへのポインタ取得
 * @param	sv			セーブデータ保持ワークへのポインタ
 * @return	SITUATION	状況保持ワークへのポインタ
 */
//----------------------------------------------------------
SITUATION * SaveData_GetSituation(SAVE_CONTROL_WORK * sv)
{
	return SaveControl_DataPtrGet(sv, GMDATA_ID_SITUATION);
}


//==============================================================================
//	
//==============================================================================
//--------------------------------------------------------------
/**
 * @brief   PLAYER_WORK構造体のデータを元にSITUATIONを更新する
 *
 * @param   sv		セーブデータ保持ワークへのポインタ
 * @param   pw		PLAYER_DATA
 */
//--------------------------------------------------------------
void SaveData_SituationDataUpdate(SAVE_CONTROL_WORK *sv, const PLAYER_WORK *pw)
{
	SITUATION *st = SaveData_GetSituation(sv);
	
	st->zoneID = pw->zoneID;
	st->position = pw->position;
	st->direction = pw->direction;
}

//--------------------------------------------------------------
/**
 * @brief   セーブデータからPALYER_WORKが必要な情報をロードしてくる
 *
 * @param   sv		セーブデータ保持ワークへのポインタ
 * @param   pw		PLAYER_DATA
 */
//--------------------------------------------------------------
void SaveData_SituationDataLoad(SAVE_CONTROL_WORK *sv, PLAYER_WORK *pw)
{
	SITUATION *st = SaveData_GetSituation(sv);
	
	pw->zoneID = st->zoneID;
	pw->position = st->position;
	pw->direction = st->direction;
}
