//============================================================================================
/**
 * @file	sp_ribbon_save.c
 * @brief	配布リボン用セーブデータ
 * @author	Nobuhiko Ariizumi
 * @date	2009/07/16
 *
 * モジュール名：SP_RIBBON_SAVE
 */
//============================================================================================
#include <gflib.h>

#include "savedata/sp_ribbon_save.h"
#include "savedata/save_tbl.h"


//======================================================================
//	define
//======================================================================
#pragma mark [> define

//======================================================================
//	enum
//======================================================================
#pragma mark [> enum


//======================================================================
//	typedef struct
//======================================================================
#pragma mark [> struct

//======================================================================
//	proto
//======================================================================
#pragma mark [> proto
int SP_RIBBON_SAVE_GetWorkSize(void)
{
	return SP_RIBBON_SAVE_MAX;
}

void SP_RIBBON_SAVE_InitWork( u8 *save )
{
	GFL_STD_MemClear(save,SP_RIBBON_SAVE_MAX);
}

//----------------------------------------------------------
//	データ操作のための関数
//----------------------------------------------------------
u8* SP_RIBBON_SAVE_GetSaveData( SAVE_CONTROL_WORK *sv )
{
	return (u8*)SaveControl_DataPtrGet( sv , GMDATA_ID_SP_RIBBON );
}
