//==============================================================================
/**
 * @file    symbol_save_local.h
 * @brief   シンボルポケモンセーブ用ローカルヘッダ
 * @author  matsuda
 * @date    2010.03.03(水)
 */
//==============================================================================
#pragma once



//==============================================================================
//  構造体定義
//==============================================================================
///シンボルエンカウントセーブデータ
struct _SYMBOL_SAVE_WORK{
  struct _SYMBOL_POKEMON symbol_poke[SYMBOL_POKE_MAX]; ///<シンボルポケモン
  u8 map_level_large;   ///<シンボルマップ(64x64)の大きさ(SYMBOL_MAP_LEVEL_LARGE)
  u8 map_level_small;   ///<シンボルマップ(32x32)の大きさ(SYMBOL_MAP_LEVEL_SMALL)
  u8 padding[2];
};

