//==============================================================================
/**
 * @file	test_savedata.c
 * @brief	テスト用セーブ
 * @author	matsuda
 * @date	2008.08.28(木)
 */
//==============================================================================
#include <gflib.h>
#include "savedata/save_tbl.h"
#include "savedata/test_savedata.h"


//--------------------------------------------------------------
/**
 * @brief	松田デバッグ用セーブのサイズを取得
 *
 * @param	none	
 *
 * @retval	none	
 *
 */
//--------------------------------------------------------------
u32	DebugMatsuSave_GetWorkSize(void)
{
	return sizeof(int);
}

//---------------------------------------------------------------------------
/**
 * @brief	松田デバッグ用セーブデータの初期化処理
 * @param	condata		コンテストセーブデータへのポインタ
 */
//---------------------------------------------------------------------------
void DebugMatsuSave_Init(int *work)
{
	*work = 0;
}

