//============================================================================================
/**
 * @file	trialhouse_save.c
 * @brief	トライアルハウスセーブデータ
 * @author	saito
 *
 */
//============================================================================================
#include <gflib.h>
#include "savedata/save_tbl.h"
#include "savedata/trialhouse_save_local.h"
#include "savedata/trialhouse_save.h"

//---------------------------------------------------------------------------
/**
 * @brief	仕掛け用ワークのサイズ取得
 * @return	int		サイズ
 */
//---------------------------------------------------------------------------
int THSV_GetWorkSize(void)
{
	return sizeof(THSV_WORK);
}

//---------------------------------------------------------------------------
/**
 * @brief	ワークの初期化
 * @param	work		ワークへのポインタ
 */
//---------------------------------------------------------------------------
void THSV_Init(THSV_WORK * work)
{
	MI_CpuClear8(work, sizeof(THSV_WORK));
}

//---------------------------------------------------------------------------
/**
 * @brief	セーブポインタを返す
 * @param	work		ワークへのポインタ
 */
//---------------------------------------------------------------------------
THSV_WORK * THSV_GetSvPtr( SAVE_CONTROL_WORK *sv )
{
  return SaveControl_DataPtrGet(sv, GMDATA_ID_THSV);
}

