//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		ybtn_reg.c
 *	@brief	Yボタン登録セーブデータ
 *	@author	Toru=Nagihashi
 *	@data		2009.10.20
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#include <gflib.h>
#include "savedata/ybtn_reg.h"
#include "savedata/save_tbl.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	Yボタン登録用セーブデータ
//=====================================
struct _YBTN_REG
{	
	u8	data[YBTN_REG_MAX];
};

//=============================================================================
/**
 *					プロトタイプ
*/
//=============================================================================
static void YBtnReg_SortNull( YBTN_REG *p_wk );

//=============================================================================
/**
 *	セーブデータシステムに依存する関数
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief	YBTN_REG構造体のサイズ取得
 *
 *	@return	YBTN_REG構造体のサイズ
 */
//-----------------------------------------------------------------------------
int YBTN_REG_GetWorkSize( void )
{	
	return sizeof(YBTN_REG);
}
//----------------------------------------------------------------------------
/**
 *	@brief	YBTN_REG構造体初期化
 *
 *	@param	YBTN_REG *p_msc ワーク
 */
//-----------------------------------------------------------------------------
void YBTN_REG_Init( YBTN_REG *p_wk )
{	
	GFL_STD_MemFill( p_wk->data, YBTN_REG_NULL, sizeof(u8) * YBTN_REG_MAX );
}

//=============================================================================
/**
 *	セーブデータ取得のための関数
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief	未分類データのCONST版ポインタ取得
 *
 *	@param	SAVE_CONTROL_WORK * cp_sv	セーブデータ保持ワークへのポインタ
 *
 *	@return	YBTN_REG
 */
//-----------------------------------------------------------------------------
const YBTN_REG * SaveData_GetYBtnRegConst( const SAVE_CONTROL_WORK * cp_sv)
{	
	return (const YBTN_REG *)SaveData_GetYBtnReg( (SAVE_CONTROL_WORK *)cp_sv);
}
//----------------------------------------------------------------------------
/**
 *	@brief	未分類データのポインタ取得
 *
 *	@param	SAVE_CONTROL_WORK * p_sv	セーブデータ保持ワークへのポインタ
 *
 *	@return	YBTN_REG
 */
//-----------------------------------------------------------------------------
YBTN_REG * SaveData_GetYBtnReg( SAVE_CONTROL_WORK * p_sv)
{	
	YBTN_REG	*p_msc;
	p_msc = SaveControl_DataPtrGet(p_sv, GMDATA_ID_YBTN_REG);
	return p_msc;
}

//=============================================================================
/**
 *	各アプリ内での、Yボタン登録関数
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief	Yボタン登録設定
 *
 *	@param	YBTN_REG *p_wk	ワーク
 *	@param	type		登録タイプ
 *	@param	is_on		TRUEでYボタン登録	FALSEでYボタン登録解除
 */
//-----------------------------------------------------------------------------
void YBTN_REG_SetRegister( YBTN_REG *p_wk, YBTN_REG_TYPE type, BOOL is_on )
{	
	int i;
	if( is_on )
	{	
		//登録する処理
		//ソート済みと考え、NULLが来るまで後尾を検索
		for( i = 0; i < YBTN_REG_MAX; i++ )
		{
			//すでにあったら何もしない
			if( p_wk->data[ i ] == type )
			{
				return;
			}

			//後尾発見
			if( p_wk->data[ i ] == YBTN_REG_NULL )
			{	
				break;
			}
		}
		GF_ASSERT_MSG( i == YBTN_REG_MAX, "YBTN_REG_TYPEへの登録が不十分\n" );

		p_wk->data[ i ] = type;
	}
	else
	{	
		//消す処理
		for( i = 0; i < YBTN_REG_MAX; i++ )
		{	
			if( p_wk->data[ i ] == type )
			{	
				p_wk->data[ i ] = YBTN_REG_NULL;
			}
		}
	}


	//NULLをソート
	YBtnReg_SortNull( p_wk );
}
//----------------------------------------------------------------------------
/**
 *	@brief	Yボタン登録状態取得
 *	
 *	@param	const YBTN_REG *cp_wk	ワーク
 *	@param	type									登録タイプ
 *
 *	@return	TRUEならば登録されている	FALSEならば登録されていない
 */
//-----------------------------------------------------------------------------
BOOL YBTN_REG_GetRegister( const YBTN_REG *cp_wk, YBTN_REG_TYPE type )
{	
	int i;
	//消す処理
	for( i = 0; i < YBTN_REG_MAX; i++ )
	{	
		if( cp_wk->data[ i ] == type )
		{
			return TRUE;
		}
	}

	return FALSE;
}

//=============================================================================
/**
 *	Yボタンメニューで取得、操作する関数
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief	インデックスから登録されているものを取得
 *
 *	@param	const YBTN_REG *cp_wk		ワーク
 *	@param	idx											インデックス	
 *
 *	@return	登録されているタイプ	or YBTN_REG_NULLならば登録されていない
 */
//-----------------------------------------------------------------------------
YBTN_REG_TYPE YBTN_REG_GetType( const YBTN_REG *cp_wk, u8 idx )
{	
	GF_ASSERT_MSG( idx < YBTN_REG_MAX, "インデックスが最大を超えています\n" );
	return cp_wk->data[ idx ];
}
//----------------------------------------------------------------------------
/**
 *	@brief	入れ替え挿入
 *					指定されたタイプを指定したインデックスに移す処理
 *
 *	@param	const YBTN_REG *cp_wk		ワーク
 *	@param	type										
 *	@param	insert_idx							挿入されるインデックス
 *
 */
//-----------------------------------------------------------------------------
void YBTN_REG_Insert( YBTN_REG *p_wk, YBTN_REG_TYPE type, u8 insert_idx )
{	
	u16 i;
	u16 next;

	GF_ASSERT_MSG( insert_idx < YBTN_REG_MAX, "インデックスが最大を超えています\n" );
	
	//タイプを消す
	YBTN_REG_SetRegister( p_wk, type, FALSE );

	//挿入の以下を１つずつずらす
	for( i = YBTN_REG_MAX-1; i == insert_idx ; i-- )
	{	
		p_wk->data[ i ] = p_wk->data[ i - 1 ];
	}

	//挿入
	p_wk->data[ insert_idx ] = type;


}
//=============================================================================
/**
 *		PRIVATE
 */
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief	YBTN_REG_NULLがあればデータを詰める
 *
 *	@param	YBTN_REG *p_wk ワーク
 */
//-----------------------------------------------------------------------------
static void YBtnReg_SortNull( YBTN_REG *p_wk )
{	
	u16 i;
	u16 next;
	u8 tmp;
	for( i = 0; i < YBTN_REG_MAX; i++ )
	{
		next	= MATH_CLAMP( i, 0, YBTN_REG_MAX-1 );
		if( p_wk->data[ i ] == YBTN_REG_NULL )
		{	
			tmp	= p_wk->data[ i ];
			p_wk->data[ i ] = p_wk->data[ next ];
			p_wk->data[ next ] = tmp;
		}
	}
}
