//============================================================================================
/**
 * @file		zukan_wp_savedata.c
 * @brief		図鑑外部セーブデータ処理
 * @author	Hiroyuki Nakamura
 * @date		10.02.08
 *
 *	モジュール名：ZUKAN_WP_SAVEDATA
 */
//============================================================================================
#include <gflib.h>

#include "savedata/zukan_wp_savedata.h"


//============================================================================================
//	定数定義
//============================================================================================

// セーブデータ
struct _ZUKANWP_SAVEDATA {
	// カスタムグラフィックキャラ
	u8	customChar[ZUKANWP_SAVEDATA_CHAR_SIZE];
	// カスタムグラフィックパレット
	u16	customPalette[ZUKANWP_SAVEDATA_PAL_SIZE];
	// データ有無フラグ
	BOOL	flg;
};


//--------------------------------------------------------------------------------------------
/**
 * @brief		セーブデータのサイズ取得
 *
 * @param		none
 *
 * @return	セーブデータのサイズ
 */
//--------------------------------------------------------------------------------------------
int ZUKANWP_SAVEDATA_GetWorkSize(void)
{
	return sizeof(ZUKANWP_SAVEDATA);
}

//--------------------------------------------------------------------------------------------
/**
 * @brief		セーブデータ初期化
 *
 * @param		sv		セーブデータ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
void ZUKANWP_SAVEDATA_InitWork( ZUKANWP_SAVEDATA * sv )
{
	GFL_STD_MemClear( sv, ZUKANWP_SAVEDATA_GetWorkSize() );
}

//--------------------------------------------------------------------------------------------
/**
 * @brief		壁紙キャラ取得
 *
 * @param		sv		セーブデータ
 *
 * @return	キャラデータ
 */
//--------------------------------------------------------------------------------------------
u8 * ZUKANWP_SAVEDATA_GetCustomGraphicCharacter( ZUKANWP_SAVEDATA * sv )
{
	return sv->customChar;
}

//--------------------------------------------------------------------------------------------
/**
 * @brief		壁紙パレット取得
 *
 * @param		sv		セーブデータ
 *
 * @return	パレットデータ
 */
//--------------------------------------------------------------------------------------------
u16 * ZUKANWP_SAVEDATA_GetCustomGraphicPalette( ZUKANWP_SAVEDATA * sv )
{
	return sv->customPalette;
}

//--------------------------------------------------------------------------------------------
/**
 * @brief		データ有無フラグ取得
 *
 * @param		sv		セーブデータ
 *
 * @retval	"TRUE = データあり"
 * @retval	"FALSE = データなし"
 */
//--------------------------------------------------------------------------------------------
BOOL ZUKANWP_SAVEDATA_GetDataCheckFlag( ZUKANWP_SAVEDATA * sv )
{
	return sv->flg;
}

//--------------------------------------------------------------------------------------------
/**
 * @brief		データ有無フラグ設定
 *
 * @param		sv		セーブデータ
 *
 * @param	"TRUE = データあり" 	"FALSE = データなし"
 */
//--------------------------------------------------------------------------------------------
void ZUKANWP_SAVEDATA_SetDataCheckFlag( ZUKANWP_SAVEDATA * sv,BOOL flg )
{
  sv->flg = flg;
}
