//============================================================================================
/**
 * @file		zukan_wp_savedata.c
 * @brief		図鑑外部セーブデータ処理
 * @author	Hiroyuki Nakamura
 * @date		10.02.08
 *
 *	モジュール名：ZUKAN_WP_SAVEDATA
 */
//============================================================================================
#include <gflib.h>

#include "savedata/zukan_wp_savedata.h"


//============================================================================================
//	定数定義
//============================================================================================

// セーブデータ
struct _ZUKANWP_SAVEDATA {
	u8	chr[ZUKANWP_SAVEDATA_CHAR_SIZE_X*ZUKANWP_SAVEDATA_CHAR_SIZE_Y*0x20];
	u16	pal[16];
};


//--------------------------------------------------------------------------------------------
/**
 * @brief		セーブデータのサイズ取得
 *
 * @param		none
 *
 * @return	セーブデータのサイズ
 */
//--------------------------------------------------------------------------------------------
int ZUKANWP_SAVEDATA_GetWorkSize(void)
{
	return sizeof(ZUKANWP_SAVEDATA);
}

//--------------------------------------------------------------------------------------------
/**
 * @brief		セーブデータ初期化
 *
 * @param		sv		セーブデータ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
void ZUKANWP_SAVEDATA_InitWork( ZUKANWP_SAVEDATA * sv )
{
	GFL_STD_MemClear( sv, ZUKANWP_SAVEDATA_GetWorkSize() );
}
