//============================================================================================
/**
 * @file	ribbon_data.h
 * @brief	リボンデータ関連
 * @author	Hiroyuki Nakamura
 * @date	2006.04.18
 *        09/07/16 HGSSより移植 Ariizumi
 */
//============================================================================================

#pragma once

//============================================================================================
//	定数定義
//============================================================================================
#define	RIBBON_MAX		( 80 )			// リボン総数
#define	MSG_SP_RIBBON	( 0x8000 )		// 配布リボンのメッセージ定義

// リボンデータ取得ID
enum {
	RIBBON_PARA_POKEPARA = 0,	// PokeParaGetの取得ID
	RIBBON_PARA_GRAPHIC,		// グラフィックID
	RIBBON_PARA_PALNUM,			// パレット番号
	RIBBON_PARA_NAME,			// リボン名
	RIBBON_PARA_INFO,			// リボン説明

	RIBBON_PARA_CATEGORY,			// リボン種類
};

typedef enum
{
  RIBBON_CATEGORY_LEAGUE,    //リーグリボン
  RIBBON_CATEGORY_CONTEST,  //コンテストリボン
  RIBBON_CATEGORY_TOWER,    //タワーリボン
  RIBBON_CATEGORY_MEMORY,   //メモリーリボン
  RIBBON_CATEGORY_PRESENT,  //プレゼントリボン
  
  RIBBON_CATEGORY_MAX,
}RIBBON_CATEGORY;

//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * リボンデータ取得
 *
 * @param	dat_id		データ番号
 * @param	prm_id		取得パラメータID
 *
 * @return	指定パラメータ
 */
//--------------------------------------------------------------------------------------------
extern u32 RIBBON_DataGet( u8 dat_id, u8 prm_id );

//--------------------------------------------------------------------------------------------
/**
 * リボン説明取得
 *
 * @param	sv			セーブデータ
 * @param	dat_id		データ番号
 *
 * @return	リボン説明メッセージインデックス
 */
//--------------------------------------------------------------------------------------------
extern u32	RIBBON_InfoGet( u8 dat_id , u8 * sv );

//--------------------------------------------------------------------------------------------
/**
 * リボンIDから説明が格納されている位置を取得
 *
 * @param	dat_id		データ番号
 *
 * @retval	"0xff = 配布リボン以外"
 * @retval	"0xff != 格納位置"
 */
//--------------------------------------------------------------------------------------------
extern u8 RIBBON_SaveIndexGet( u8 dat_id );

//--------------------------------------------------------------------------------------------
/**
 * ID_PARA_リボンからmsgIDを取得(08.06.03)	//	PLATINUM MERGE
 *
 * @param	para_id		ID_PARA_リボン
 *
 * @retval	"msgID、0xffff = 見つからなかった"
 */
//--------------------------------------------------------------------------------------------
extern u16 RIBBON_NameGet( u32 pp_id );
