//============================================================================================
/**
 * @file	savedata_local.h
 * @brief
 * @date	2006.04.17
 * @author	tamada GAME FREAK inc.
 */
//============================================================================================

#ifndef	__SAVEDATA_LOCAL_H__
#define	__SAVEDATA_LOCAL_H__

#include "savedata.h"

#ifdef	PM_DEBUG
//この定義を有効にするとフラッシュのエラーチェックが無効になる
//デバッグ期間用なので製品版では繁栄させないこと！
//#define	DISABLE_FLASH_CHECK
#endif

//=============================================================================
//=============================================================================

//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
typedef u32 (*FUNC_GET_SIZE)(void);

//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
typedef void (*FUNC_INIT_WORK)(void *);

//---------------------------------------------------------------------------
/**
 * @brief	セーブデータ内容データ用の構造体定義
 */
//---------------------------------------------------------------------------
typedef struct {
	GMDATA_ID gmdataID;				///<セーブデータ識別ID
	SVBLK_ID	blockID;
	FUNC_GET_SIZE get_size;			///<セーブデータサイズ取得関数
	FUNC_INIT_WORK	init_work;		///<セーブデータ初期化関数
}SAVEDATA_TABLE;


//=============================================================================
//=============================================================================

extern const SAVEDATA_TABLE SaveDataTable[];
extern const int SaveDataTableMax;




#endif	/* __SAVEDATA_LOCAL_H__ */
