//============================================================================
/**
 *  @file   egg_demo_view.h
 *  @brief  タマゴ孵化デモの演出
 *  @author Koji Kawada
 *  @data   2010.01.25
 *  @note   
 *
 *  モジュール名：EGG_DEMO_VIEW
 */
//============================================================================
#pragma once

// インクルード
#include <gflib.h>


//=============================================================================
/**
*  構造体宣言
*/
//=============================================================================
//-------------------------------------
/// ワーク
//=====================================
typedef struct _EGG_DEMO_VIEW_WORK EGG_DEMO_VIEW_WORK;


//=============================================================================
/**
 *  関数宣言のプロトタイプ宣言
 */
//=============================================================================
//-------------------------------------
/// 初期化処理
//=====================================
extern EGG_DEMO_VIEW_WORK* EGG_DEMO_VIEW_Init(
                               HEAPID                   heap_id,
                               const POKEMON_PARAM*     pp
                           );

//-------------------------------------
/// 終了処理
//=====================================
extern void EGG_DEMO_VIEW_Exit( EGG_DEMO_VIEW_WORK* work );

//-------------------------------------
/// 主処理
//=====================================
extern void EGG_DEMO_VIEW_Main( EGG_DEMO_VIEW_WORK* work );

//-------------------------------------
/// 描画処理
//      GRAPHIC_3D_StartDrawとGRAPHIC_3D_EndDrawの間で呼ぶこと
//=====================================
extern void EGG_DEMO_VIEW_Draw( EGG_DEMO_VIEW_WORK* work );

//-------------------------------------
/// スタート
//=====================================
extern void EGG_DEMO_VIEW_Start( EGG_DEMO_VIEW_WORK* work );

//-------------------------------------
/// 白く飛ばす演出のためのパレットフェードをして欲しいか(1フレームしかTRUEにならない)
//=====================================
extern BOOL EGG_DEMO_VIEW_White( EGG_DEMO_VIEW_WORK* work );

//-------------------------------------
/// タマゴをポケモンに差し替える
//=====================================
extern void EGG_DEMO_VIEW_Hatch( EGG_DEMO_VIEW_WORK* work, const POKEMON_PARAM* pp );

//-------------------------------------
/// ポケモンの準備ができたか
//=====================================
BOOL EGG_DEMO_VIEW_IsReady( EGG_DEMO_VIEW_WORK* work );

//-------------------------------------
/// ポケモンスタート
//=====================================
void EGG_DEMO_VIEW_MonStart( EGG_DEMO_VIEW_WORK* work );

//-------------------------------------
/// 終了しているか
//=====================================
extern BOOL EGG_DEMO_VIEW_IsEnd( EGG_DEMO_VIEW_WORK* work );

