//============================================================================
/**
 *
 *	@file		intro_msg.h
 *	@brief  イントロ メッセージ処理
 *	@author	hosaka genya
 *	@data		2009.12.15
 *
 */
//============================================================================
#pragma once

typedef struct _INTRO_MSG_WORK INTRO_MSG_WORK;

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================

//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================

//=============================================================================
/**
 *								EXTERN宣言
 */
//=============================================================================


extern INTRO_MSG_WORK* INTRO_MSG_Create( HEAPID heap_id );

extern void INTRO_MSG_Exit( INTRO_MSG_WORK* wk );

extern void INTRO_MSG_Main( INTRO_MSG_WORK* wk );

extern void INTRO_MSG_SetPrint( INTRO_MSG_WORK* wk, int str_id );

extern BOOL INTRO_MSG_IsPrintEnd( INTRO_MSG_WORK* wk );

