//============================================================================
/**
 *
 *	@file		intro_cmd_data.h
 *	@brief  シーンデータへのアクセサ
 *	@author	hosaka genya
 *	@data		2009.12.11
 *
 */
//============================================================================
#pragma once

#include "demo/intro.h"
#include "intro_cmd_def.h"

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================

#define INTRO_CMD_PARAM_MAX (4)

//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================

typedef enum
{ 
  CMD_READ_END = ( FALSE ), ///< 次のコマンドを同時に読み込みまない(デフォルト値)
  CMD_READ_NEXT = ( TRUE ), ///< 次のコマンドも同時に読み込む
} CMD_READ;

//--------------------------------------------------------------
///	
//==============================================================
typedef struct {
  INTRO_CMD_TYPE type;
  int param[ INTRO_CMD_PARAM_MAX ];
  u8 read_next : 1; ///< CMD_READ : CMD_READ_NEXT なら次のコマンドを並列実行
  u8 padding : 7;
} INTRO_CMD_DATA;

//=============================================================================
/**
 *								EXTERN宣言
 */
//=============================================================================
extern const INTRO_CMD_DATA* Intro_DATA_GetCmdData( INTRO_SCENE_ID scene_id );

extern u16 Intro_DATA_GetSceneMax( void );


