//======================================================================
/**
 * @file  def_table_macro.h
 * @brief スクリプトコマンド定義用マクロ
 * @date  2009.09.27
 * @author  tamada GAME FREAK inc.
 *
 */
//======================================================================
//======================================================================
//  macro
//======================================================================

//--------------------------------------------------------------
/**
 * @macro 
 */
//--------------------------------------------------------------
  .macro  INIT_CMD
DEF_CMD_COUNT  =  0
  .endm
    
//--------------------------------------------------------------
/**
 * @macro  
 */
//--------------------------------------------------------------
  .macro  ASM_DEF_CMD symname
\symname  =  DEF_CMD_COUNT
DEF_CMD_COUNT  =  ( DEF_CMD_COUNT + 1 )
  .endm

//--------------------------------------------------------------
/**
 * @macro
 */
//--------------------------------------------------------------
  .macro  ASM_NO_CMD
DEF_CMD_COUNT  =  ( DEF_CMD_COUNT + 1 )
  .endm

//--------------------------------------------------------------
/**
 * @macro
 */
//--------------------------------------------------------------
  .macro  END_CMD
  /* なにもしない */
  .endm

//--------------------------------------------------------------
/**
 * @def   DEF_CMD
 * @brief アセンブラ用シーケンス定義マクロ
 * @param funcname    関数名
 * @param symname     シーケンスシンボル名
 *
 * @note
 *
 * funcnameはアセンブラからは捨てられる
 * symnameのみ、IDとして定義される
 */
//--------------------------------------------------------------
#define DEF_CMD( funcname, symname ) ASM_DEF_CMD symname

//--------------------------------------------------------------
/**
 * @def NO_CMD
 * @brief ダミー定義用マクロ
 *
 * @note
 * スクリプトコマンドの追加・削除でスクリプトコマンドIDがずれると
 * スクリプト全体のリコンパイルが必要になる。
 * これをなるべく避けるため、随所にNO_CMDを入れておき必要に応じて
 * その箇所をDEF_CMDで置き換える。
 */
//--------------------------------------------------------------
#define NO_CMD()          ASM_NO_CMD


