//============================================================================
/**
 *
 *	@file		app_res_def.h
 *	@brief  共通リソース用定義
 *	@author	hosaka genya
 *	@data		2009.10.08
 *
 */
//============================================================================
#pragma once

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================

//セルの読みわけに使うマッピングモード定義
typedef enum
{
  APP_RES_MAPPING_32K,
  APP_RES_MAPPING_64K,
  APP_RES_MAPPING_128K,
}APP_RES_MAPPING;

// @TODO 消す 互換性のための古い定義
//セルの読みわけに使うマッピングモード定義
typedef enum
{
  APP_COMMON_MAPPING_32K,
  APP_COMMON_MAPPING_64K,
  APP_COMMON_MAPPING_128K,
}APP_COMMON_MAPPING;


