//=============================================================================
/**
 * @file	  app_printsys_common.h
 * @brief	  PRINTSYS_PrintStreamGetStateの処理を共通化するプログラム
 * @author  k.ohno
 * @date	  10/02/22
 */
//=============================================================================

#pragma once

#include "print/printsys.h"


//----------------------------------------------------------------------------
/**
 *	@brief	プリントシステム制御初期化
 *	@param	トリガーを制御すりワーク u8
 */
//-----------------------------------------------------------------------------
extern void APP_PRINTSYS_COMMON_PrintStreamInit(u8* trgWork);
//----------------------------------------------------------------------------
/**
 *	@brief	プリントシステム実行関数
 *  @param  PRINT_STREAM* ストリームハンドル
 *	@param	初期化で渡したトリガーを制御すりワーク u8
 */
//-----------------------------------------------------------------------------
extern BOOL APP_PRINTSYS_COMMON_PrintStreamFunc(PRINT_STREAM* handle,u8* trgWork);

