//============================================================================================
/**
 *	@file	config_panel.h
 *	@brief	コンフィグ画面外部公開ヘッダ
 *	@date	06.01.30
 *	@author	Toru=Nagihashi
 *
 */
//============================================================================================

#pragma once

#include "gamesystem/gamesystem.h"
#include "savedata/config.h"
//-----------------------------------------------------------------------------
//	コンフィグ画面用パラム
//-----------------------------------------------------------------------------
typedef struct
{	
	BOOL is_exit;							//[out]	TRUEでexitで終了 FALSEで通常終了
	GAMESYS_WORK	*p_gamesys;	//[in]	ゲームシステム
}CONFIG_PANEL_PARAM;

//-----------------------------------------------------------------------------
//	コンフィグ画面用プロセスデータ
//-----------------------------------------------------------------------------
FS_EXTERN_OVERLAY(config_panel);
extern const GFL_PROC_DATA ConfigPanelProcData;

