//============================================================================================
/**
 * @file  mailbox.h
 * @brief メールボックス画面
 * @author  Akito Mori / Hiroyuki Nakamura
 * @date  09.12.03
 */
//============================================================================================
#ifndef __MAILBOX_H__
#define __MAILBOX_H__

#include "gamesystem/game_data.h"
//#include "system/keytouch_status.h"


//============================================================================================
//  定数定義
//============================================================================================

// 外部設定データ
typedef struct {
  GAMEDATA * gamedata;      // セーブデータ
//  void * fsys;          // ポケモンリストの呼び出しに必要
//  KEYTOUCH_STATUS * kt_status;  // キータッチステータス
}MAILBOX_PARAM;

#ifdef  PM_DEBUG
// デバッグ用データ
typedef struct {
  void * dat;
  u32 seq;
}DEBUG_MB_WORK;
#endif  // PM_DEBUG


//============================================================================================
//  プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * プロセス関数：初期化
 *
 * @param proc  プロセスデータ
 * @param seq   シーケンス
 *
 * @return  処理状況
 */
//--------------------------------------------------------------------------------------------
extern GFL_PROC_RESULT MailBoxProc_Init( GFL_PROC * proc, int *seq, void *pwk, void *mywk );

//--------------------------------------------------------------------------------------------
/**
 * プロセス関数：メイン
 *
 * @param proc  プロセスデータ
 * @param seq   シーケンス
 *
 * @return  処理状況
 */
//--------------------------------------------------------------------------------------------
extern GFL_PROC_RESULT MailBoxProc_Main( GFL_PROC * proc, int *seq, void *pwk, void *mywk );

//--------------------------------------------------------------------------------------------
/**
 * プロセス関数：終了
 *
 * @param proc  プロセスデータ
 * @param seq   シーケンス
 *
 * @return  処理状況
 */
//--------------------------------------------------------------------------------------------
extern GFL_PROC_RESULT MailBoxProc_End( GFL_PROC * proc, int *seq, void *pwk, void *mywk );



extern const GFL_PROC_DATA MailBoxProcData;

#endif  // __MAILBOX_H__
