//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		mictest.h
 *	@brief		マイクテスト画面外部公開ヘッダー
 *	@author		Toru=Nagihashi / genya hosaka(GSからWBに移植)
 *	@data		2008.07.03
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __MICTEST_H__
#define __MICTEST_H__

//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
FS_EXTERN_OVERLAY(mictest);
extern const GFL_PROC_DATA TitleMicTestProcData;



#endif		// __MICTEST_H__

