//============================================================================================
/**
 * @file	wifi_note.h
 * @bfief	WIFI友達手帳
 * @author	k.ohno
 * @date	06.04.05
 */
//============================================================================================
#ifndef __WIFI_NOTE_H__
#define __WIFI_NOTE_H__

//============================================================================================
//	定義
//============================================================================================

//------------------------------------------------------
/**
 * WIFIともだちリストPROCパラメータ
 */
//------------------------------------------------------
typedef struct {
    SAVE_CONTROL_WORK*  saveControlWork;
//	SAVEDATA*  savedata;
//	KEYTOUCH_STATUS* kt_status;
}WIFINOTE_PROC_PARAM;


// プロセス定義データ
extern const GFL_PROC_DATA WifiNoteProcData;

// ポインタ参照だけできるレコードコーナーワーク構造体
typedef struct _WIFINOTE_WORK WIFINOTE_WORK;	

#endif //__WIFI_NOTE_H__
