//============================================================================
/**
 *  @file   zenkoku_zukan_award.h
 *  @brief  地方図鑑表彰状
 *  @author Koji Kawada
 *  @data   2010.03.08
 *  @note   
 *
 *  モジュール名：ZENKOKU_ZUKAN_AWARD
 */
//============================================================================
#pragma once


// インクルード
#include <gflib.h>

#include "gamesystem/gamedata_def.h"

// オーバーレイ
FS_EXTERN_OVERLAY(zenkoku_zukan_award);


//=============================================================================
/**
*  定数定義
*/
//=============================================================================


//=============================================================================
/**
 *  PROC
 */
//=============================================================================
extern const GFL_PROC_DATA    ZENKOKU_ZUKAN_AWARD_ProcData;


//=============================================================================
/**
*  構造体宣言
*/
//=============================================================================
//-------------------------------------
/// PROC パラメータ
//=====================================
typedef struct
{
  const GAMEDATA*      gamedata;      ///< [in] 自分状態データMYSTATUSを得たりするために必要(名前と性別を使用)
  BOOL                 b_fix;         ///< [in] 飾ってあるのを見るときTRUE
}
ZENKOKU_ZUKAN_AWARD_PARAM;


//=============================================================================
/**
*  関数のプロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
/// パラメータ生成
//=====================================
extern ZENKOKU_ZUKAN_AWARD_PARAM*  ZENKOKU_ZUKAN_AWARD_AllocParam(
                                      HEAPID               heap_id,
                                      const GAMEDATA*      gamedata,
                                      BOOL                 b_fix
                                  );

//-------------------------------------
/// パラメータ解放
//=====================================
extern void  ZENKOKU_ZUKAN_AWARD_FreeParam(
                      ZENKOKU_ZUKAN_AWARD_PARAM*  param );

//-------------------------------------
/// パラメータを設定する
//=====================================
extern void  ZENKOKU_ZUKAN_AWARD_InitParam(
                  ZENKOKU_ZUKAN_AWARD_PARAM*      param,
                  const GAMEDATA*                 gamedata,
                  BOOL                            b_fix
             );

