//============================================================================================
/**
 * @file	pm_voice.h
 * @brief	ポケモン鳴き声再生システム
 * @author	
 * @date	
 */
//============================================================================================
#ifndef __PMVOICE_H__
#define __PMVOICE_H__

//------------------------------------------------------------------
/**
 * @brief	鳴き声オプション
 */
//------------------------------------------------------------------
enum {
	PMVOICE_MODE_NORMAL = 0,
	PMVOICE_MODE_CHORUS = 1,
	PMVOICE_MODE_REVERSE = 2,
};

//------------------------------------------------------------------
/**
 * @brief	データＩＮＤＥＸ有効範囲
 */
//------------------------------------------------------------------
#define PMVOICE_START	(BANK_PV001)
#define PMVOICE_END		(BANK_PV516_SKY)
#define PMVOICE_POKE001	(PMVOICE_START)

//============================================================================================
/**
 *
 * @brief	システム（main.c等から呼び出される）
 *
 */
//============================================================================================
extern void	PMVOICE_Init( HEAPID heapID );
extern void	PMVOICE_Main( void );
extern void	PMVOICE_Exit( void );

//============================================================================================
/**
 *
 * @brief	システム設定
 *
 */
//============================================================================================
extern void	PMVOICE_PlayerHeapReserve( int num );	// プレーヤー用waveバッファ事前確保
extern void	PMVOICE_PlayerHeapRelease( void );		// プレーヤー用waveバッファ開放

//============================================================================================
/**
 *
 * @brief	鳴き声サウンド関数
 *
 */
//============================================================================================
extern u32	PMVOICE_Play( u32 pokeNum, u16 option );	//鳴き声を再生(return: voicePlayerIdxBit)
extern void	PMVOICE_Stop( u32 voicePlayerIdxBit );		//鳴き声を停止
extern BOOL	PMVOICE_CheckPlay( u32 voicePlayerIdxBit );	//鳴き声終了検出(TRUE:再生中)

#endif

