//============================================================================================
/**
 * @file	pm_voice.h
 * @brief	ポケモン鳴き声再生システム
 * @author	
 * @date	
 */
//============================================================================================
#ifndef __PMVOICE_H__
#define __PMVOICE_H__

//------------------------------------------------------------------
/**
 * @brief	データＩＮＤＥＸ有効範囲
 */
//------------------------------------------------------------------
#define PMVOICE_START	(BANK_PV001)
#define PMVOICE_END		(BANK_PV516_SKY)
#define PMVOICE_POKE001	(PMVOICE_START)

//============================================================================================
/**
 *
 * @brief	システム（main.c等から呼び出される）
 *
 */
//============================================================================================
extern void	PMVOICE_Init( HEAPID heapID );
extern void	PMVOICE_Main( void );
extern void	PMVOICE_Exit( void );

//============================================================================================
/**
 *
 * @brief	鳴き声サウンド関数（各appから呼び出される）
 *
 */
//============================================================================================
#define PMVOICE_ERROR	(-1)
extern int	PMVOICE_Play( u32 pokeNum );		//鳴き声を再生(return: voicePlayerIdx or error)
extern void	PMVOICE_Stop( int voicePlayerIdx );


#endif

