//============================================================================================
/**
 * @file	pm_wb_voice.h
 * @brief	ポケモンＷＢ用鳴き声再生コールバック関数
 * @author	
 * @date	
 */
//============================================================================================
#ifndef __PMWB_VOICE_H__
#define __PMWB_VOICE_H__

#include "sound/pm_voice.h"
//------------------------------------------------------------------
/**
 * @brief	データＩＮＤＥＸ有効範囲
 */
//------------------------------------------------------------------
#define PMVOICE_START	(BANK_PV001)
#define PMVOICE_END		(BANK_PV516_SKY)
#define PMVOICE_POKE001	(PMVOICE_START)

//============================================================================================
/**
 * @brief	波形ＩＤＸ取得コールバック
 */
//============================================================================================
extern void	PMWB_GetVoiceWaveIdx( u32, u32, u32* );
//============================================================================================
/**
 * @brief	波形データ生成コールバック
 */
//============================================================================================
extern BOOL	PMWB_CustomVoiceWave( u32, u32, void**, u32*, int*, int* );

//============================================================================================
/**
 * @brief	鳴き声マクロ
 */
//============================================================================================
#define PMWB_PlayVoice( pokeNum, formNum ) \
		PMVOICE_Play(pokeNum, formNum, 64, FALSE, 0, 0, FALSE, FALSE)

#define PMWB_PlayVoiceChorus( pokeNum, formNum ) \
		PMVOICE_Play(pokeNum, formNum, 64, TRUE, -10, 20, FALSE, FALSE)

#define PMWB_PlayVoiceRev( pokeNum, formNum ) \
		PMVOICE_Play(pokeNum, formNum, 64, FALSE, 0, 0, FALSE, TRUE)

#endif


