#if 0
;===============================================================================================
;
;	NITRO-Composer
;
;	ポケットモンスター　金銀
;
;	サウンドアーカイブ共通部分定義ファイル
;
;	05.06.24 satoshi nohara
;	08.08.29 satoshi nohara
;
;===============================================================================================


;===============================================================================================
;	スタートナンバー
;
;	SEQ_SE_DP_SELECTが1500スタートになるようにSE_PL_STARTを調整した(08.10.15)
;===============================================================================================
#endif
#define PV_START			1

#define BGM_START			1000
#define BGM_GS_BANK_START	700

#define ME_START			1300
#define SE_START			1350
#define SE_PL_START			1372
#define SE_MUSICAL			1570
#define SE_SYSTEM2			1600

#define SE_GS_BANK_START	750


#if 0
;===============================================================================================
;	ダイヤモンド・パールからシーケンスナンバーを変更してはいけないサウンドナンバー
;
;	戦闘で使用しているSEはオフセットを指定しておく
;	src/battle/skillで使用しているsrc/battle/battle_snd_def.h
;
;	PV		0		-
;	ARC_BGM	700		-
;	ARC_SE	750		-
;	SEQ_BGM	1000	-
;	SEQ_SE	1350	-
;===============================================================================================
#endif
#define SE_START_BTL_FIX	1788


