//============================================================================================
/**
 * @file		dpc_obj.h
 * @brief		殿堂入り確認画面 ＯＢＪ関連
 * @author	Hiroyuki Nakamura
 * @date		10.03.29
 *
 *	モジュール名：DPCOBJ
 */
//============================================================================================
#pragma	once


//============================================================================================
//	定数定義
//============================================================================================


//============================================================================================
//	プロトタイプ宣言
//============================================================================================


extern void DPCOBJ_Init( DPCMAIN_WORK * wk );
extern void DPCOBJ_Exit( DPCMAIN_WORK * wk );
extern void DPCOBJ_AnmMain( DPCMAIN_WORK * wk );
extern void DPCOBJ_SetVanish( DPCMAIN_WORK * wk, GFL_CLWK * clwk, BOOL flg );

extern void DPCOBJ_AddPoke( DPCMAIN_WORK * wk );
