//============================================================================================
/**
 * @file		dpc_obj.h
 * @brief		殿堂入り確認画面 ＯＢＪ関連
 * @author	Hiroyuki Nakamura
 * @date		10.03.29
 *
 *	モジュール名：DPCOBJ
 */
//============================================================================================
#pragma	once


//============================================================================================
//	定数定義
//============================================================================================

// ポケモン配置角度間隔
#define	DPCOBJ_POKEMAX1_SPACE_RAD		( 0 )
#define	DPCOBJ_POKEMAX2_SPACE_RAD		( 180 )
#define	DPCOBJ_POKEMAX3_SPACE_RAD		( 120 )
#define	DPCOBJ_POKEMAX4_SPACE_RAD		( 90 )
#define	DPCOBJ_POKEMAX5_SPACE_RAD		( 72 )
#define	DPCOBJ_POKEMAX6_SPACE_RAD		( 60 )


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＢＪ初期化
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_Init( DPCMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＢＪ解放
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_Exit( DPCMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＢＪアニメメイン
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_AnmMain( DPCMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＢＪ表示切り替え
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		id		OBJ ID
 * @param		flg		TRUE = 表示, FALSE = 非表示
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_SetVanish( DPCMAIN_WORK * wk, u32 id, BOOL flg );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＢＪオートアニメ設定
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		id		OBJ ID
 * @param		anm		アニメ番号
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_SetAutoAnm( DPCMAIN_WORK * wk, u32 id, u32 anm );

//--------------------------------------------------------------------------------------------
/**
 * @brief		アニメチェック
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		id		OBJ ID
 *
 * @retval	"TRUE = アニメ中"
 * @retval	"FALSE = それ以外"
 */
//--------------------------------------------------------------------------------------------
extern BOOL DPCOBJ_CheckAnm( DPCMAIN_WORK * wk, u32 id );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＢＪ座標設定
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		id		OBJ ID
 * @param		x			Ｘ座標
 * @param		y			Ｙ座標
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_SetPos( DPCMAIN_WORK * wk, u32 id, s16 x, s16 y );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＢＪ座標取得
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		id		OBJ ID
 * @param		x			Ｘ座標
 * @param		y			Ｙ座標
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_GetPos( DPCMAIN_WORK * wk, u32 id, s16 * x, s16 * y );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ポケモンＯＢＪ追加
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_AddPoke( DPCMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		デフォルトのポケモンＯＢＪを取得
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 *
 * @return	OBJ ID
 */
//--------------------------------------------------------------------------------------------
extern u32 DPCOBJ_GetDefaultPoke( DPCMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ポケモンＯＢＪ配置
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		id		OBJ ID
 * @param		rad		角度
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_SetPokePos( DPCMAIN_WORK * wk, u32 id, u32 rad );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ポケモンＯＢＪプライオリティ変更
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_ChangePokePriority( DPCMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ポケモンＯＢＪ明るさ変更
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		flg		設定フラグ
 *
 * @return	none
 *
 * @li	flg = TRUE : 配置位置によって明るさを設定
 * @li	flg = FALSE : デフォルトの明るさ
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_InitFadeEvy( DPCMAIN_WORK * wk, BOOL flg );

//--------------------------------------------------------------------------------------------
/**
 * @brief		ＯＡＭフォント表示切り替え
 *
 * @param		wk		殿堂入りＰＣ画面ワーク
 * @param		flg		TRUE = 表示, FALSE = 非表示
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void DPCOBJ_FontOamVanish( DPCMAIN_WORK * wk, BOOL flg );
