//============================================================================================
/**
 * @file		zknsearch_ui.h
 * @brief		図鑑検索画面 ＵＩ関連
 * @author	Hiroyuki Nakamura
 * @date		10.02.09
 *
 *	モジュール名：ZKNSEARCHUI
 */
//============================================================================================
#pragma	once


//============================================================================================
//	定数定義
//============================================================================================

// 入力結果
enum {
	// トップ画面
	ZKNSEARCHUI_ROW = 0,
	ZKNSEARCHUI_NAME,
	ZKNSEARCHUI_TYPE,
	ZKNSEARCHUI_COLOR,
	ZKNSEARCHUI_FORM,
	ZKNSEARCHUI_START,
	ZKNSEARCHUI_RESET,

	ZKNSEARCHUI_Y,
	ZKNSEARCHUI_X,
	ZKNSEARCHUI_RET,

	// リスト画面
	ZKNSEARCHUI_LIST_RET = 0,

	ZKNSEARCHUI_LIST_ENTER1,
	ZKNSEARCHUI_LIST_ENTER2,
	ZKNSEARCHUI_LIST_ENTER3,
	ZKNSEARCHUI_LIST_ENTER4,
	ZKNSEARCHUI_LIST_ENTER5,
	ZKNSEARCHUI_LIST_ENTER6,
	ZKNSEARCHUI_LIST_ENTER7,

	ZKNSEARCHUI_LIST_CANCEL,
	ZKNSEARCHUI_LIST_RESET,
};


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * @brief		メインページのカーソル移動処理初期化
 *
 * @param		wk		図鑑検索画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void ZKNSEARCHUI_MainCursorMoveInit( ZKNSEARCHMAIN_WORK * wk, u32 pos );

//--------------------------------------------------------------------------------------------
/**
 * @brief		メインページのカーソル移動処理解放
 *
 * @param		wk		図鑑検索画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void ZKNSEARCHUI_CursorMoveExit( ZKNSEARCHMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		項目のパレット変更
 *
 * @param		wk		図鑑検索画面ワーク
 * @param		pos		位置
 * @param		pal		パレット番号
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void ZKNSEARCHUI_ChangeCursorPalette( ZKNSEARCHMAIN_WORK * wk, u32 pos, u32 pal );

//--------------------------------------------------------------------------------------------
/**
 * @brief		メインページのカーソル移動処理
 *
 * @param		wk		図鑑検索画面ワーク
 *
 * @return	入力結果
 */
//--------------------------------------------------------------------------------------------
extern u32 ZKNSEARCHUI_MenuMain( ZKNSEARCHMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		検索結果表示後の入力待ち
 *
 * @param		wk		図鑑検索画面ワーク
 *
 * @retval	"TRUE = 入力された"
 * @retval	"FALSE = それ以外"
 */
//--------------------------------------------------------------------------------------------
extern BOOL ZKNSEARCHUI_Result( ZKNSEARCHMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		リスト入力処理
 *
 * @param		wk		図鑑検索画面ワーク
 *
 * @return	入力結果
 */
//--------------------------------------------------------------------------------------------
extern int ZKNSEARCHUI_ListMain( ZKNSEARCHMAIN_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * @brief		リスト入力処理（フォルム用）
 *
 * @param		wk		図鑑検索画面ワーク
 *
 * @return	入力結果
 */
//--------------------------------------------------------------------------------------------
extern int ZKNSEARCHUI_FormListMain( ZKNSEARCHMAIN_WORK * wk );
