//============================================================================================
/**
 * @file		zukansearch.h
 * @brief		図鑑検索画面
 * @author	Hiroyuki Nakamura
 * @date		10.02.09
 *
 *	モジュール名：ZUKANSEARCH
 */
//============================================================================================
#pragma	once

#include "savedata/zukan_savedata.h"
#include "gamesystem/game_data.h"
#include "zukan_search_engine.h"


//============================================================================================
//	定数定義
//============================================================================================

typedef struct {
  GAMEDATA * gamedata;				// ゲームデータ
//	ZUKAN_SAVEDATA * savedata;	// 図鑑セーブデータ

	ZKNCOMM_LIST_SORT * sort;		// ソートデータ

	u32	retMode;								// 終了モード
}ZUKANSEARCH_DATA;

// 終了モード
enum {
	ZKNSEARCH_RET_START = 0,		// 検索実行
	ZKNSEARCH_RET_CANCEL,				// キャンセル
	ZKNSEARCH_RET_EXIT_X,				// 図鑑を終了してメニューを閉じる
};


//============================================================================================
//	グローバル
//============================================================================================

// 図鑑PROCデータ
extern const GFL_PROC_DATA ZUKANSEARCH_ProcData;


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

FS_EXTERN_OVERLAY(zukan_search);
