typedef struct _FLD_ACTSYS		FLD_ACTSYS;

//------------------------------------------------------------------
/**
 * @brief	フィールドアクトシステム作成
 */
//------------------------------------------------------------------
extern FLD_ACTSYS*	CreateFieldActSys( GAME_SYSTEM* gs, HEAPID heapID );
//------------------------------------------------------------------
/**
 * @brief	フィールドアクトシステム破棄
 */
//------------------------------------------------------------------
extern void	DeleteFieldActSys( FLD_ACTSYS* fldActSys );
//------------------------------------------------------------------
/**
 * @brief	フィールドアクト動作関数
 */
//------------------------------------------------------------------
extern void	MainFieldActSys( FLD_ACTSYS* fldActSys );

