//============================================================================
/**
 *  @file   btl_rec_sel.h
 *  @brief  通信対戦後の録画選択画面
 *  @author Koji Kawada
 *  @data   2010.01.27
 *  @note   
 *
 *  モジュール名：BTL_REC_SEL
 */
//============================================================================
#pragma once


// インクルード
#include <gflib.h>


// オーバーレイ
FS_EXTERN_OVERLAY(btl_rec_sel);


//=============================================================================
/**
 *  PROC
 */
//=============================================================================
extern const GFL_PROC_DATA    BTL_REC_SEL_ProcData;


//=============================================================================
/**
*  構造体宣言
*/
//=============================================================================
//-------------------------------------
/// PROC パラメータ
//=====================================
typedef struct _BTL_REC_SEL_PARAM
{
  GAMEDATA*         gamedata;           ///< [in,out]  GAMEDATA
}
BTL_REC_SEL_PARAM;


//=============================================================================
/**
*  関数のプロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
/// PROC パラメータ生成
//=====================================
extern BTL_REC_SEL_PARAM*  BTL_REC_SEL_AllocParam(
                            HEAPID           heap_id,
                            GAMEDATA*        gamedata );

//-------------------------------------
/// PROC パラメータ解放
//=====================================
extern void             BTL_REC_SEL_FreeParam(
                            BTL_REC_SEL_PARAM*  param );

//-------------------------------------
/// PROC パラメータを設定する
//=====================================
extern void             BTL_REC_SEL_InitParam(
                            BTL_REC_SEL_PARAM*  param,
                            GAMEDATA*        gamedata );
