//==============================================================================
/**
 * @file	compath_control.h
 * @brief	相性チェックゲームを管理するPROCのヘッダ
 * @author	matsuda
 * @date	2009.02.10(火)
 */
//==============================================================================
#ifndef __COMPATI_CONTROL_H__
#define __COMPATI_CONTROL_H__

//==============================================================================
//	外部データ
//==============================================================================
extern const GFL_PROC_DATA CompatiControlProcData;


#endif	//__COMPATI_CONTROL_H__
