//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		debug_wifi_match.h
 *	@brief  サーバーアクセスデバッグ
 *	@author	Toru=Nagihashi
 *	@date		2009.12.03
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
//-------------------------------------
///	デバッグモード
//=====================================
typedef enum
{
  DEBUG_WIFIBATTLEMATCH_MODE_SAKE,  //データベースサーバーへのデータアクセスモード
  DEBUG_WIFIBATTLEMATCH_MODE_ATLAS, //アトラスサーバーへのデータアクセスモード（※注意！2台でマッチングしないとできません！！）
} DEBUG_WIFIBATTLEMATCH_MODE;

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	引数
//=====================================
typedef struct 
{
  DEBUG_WIFIBATTLEMATCH_MODE  mode;   //[in ]デバッグモード
  SAVE_CONTROL_WORK*          p_save; //[in ]セーブ
} DEBUG_WIFIBATTLEMATCH_PARAM;


//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
extern const GFL_PROC_DATA	DEBUG_WifiBattleMatch_ProcData;
