//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		irc_menu.h
 *	@brief	赤外線ミニゲーム	メニュー画面
 *	@author	Toru=Nagihashi
 *	@date		2009.05.12
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include "net_app/compatible_irc_sys.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
//-------------------------------------
///	選択
//=====================================
typedef enum 
{
	IRCMENU_SELECT_COMPATIBLE,	//相性ミニゲームを選んだ
	IRCMENU_SELECT_RANKING,			//ランキングを選んだ
	IRCMENU_SELECT_RETURN,			//戻るを選んだ
} IRCMENU_SELECT;

//-------------------------------------
///	起動モード
//=====================================
typedef enum
{
	IRCMENU_MODE_INIT,							//初回スタート
	IRCMENU_MODE_RETURN,						//他からの復帰		（切断処理が入る）
	IRCMENU_MODE_RANKING_RETURN,		//ランキングからの復帰
} IRCMENU_MODE;


//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	PROCに渡すパラメータ
//=====================================
typedef struct {
	GAMESYS_WORK				*p_gamesys;//[in]ゲームシステム
	COMPATIBLE_IRC_SYS	*p_irc;			//[in]共通で使う赤外線システム
	IRCMENU_MODE				mode;				//[in]メニュー画面軌道モード
	IRCMENU_SELECT			select;			//[out]メニュー画面で選んだもの
  COMPATIBLE_STATUS		*p_you_status;//[out]通信相手のステータス（バッファを作って渡してください）
}IRC_MENU_PARAM;

//=============================================================================
/**
 *					PROCDATA
*/
//=============================================================================
//-------------------------------------
///	オーラチェック用プロックデータ
//=====================================
extern const GFL_PROC_DATA IrcMenu_ProcData;

