//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		mystery.h
 *	@brief  ふしぎなおくりものプロセス
 *	@author	Toru=Nagihashi
 *	@date		2009.12.09
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include <gflib.h>
#include "gamesystem/game_data.h"
#include "savedata/mystery_data.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
FS_EXTERN_OVERLAY(mystery);

//=============================================================================
/**
 *					引数
*/
//=============================================================================
typedef struct
{ 
  int dummy;
}MYSTERY_PARAM;

//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
extern const GFL_PROC_DATA MysteryGiftProcData;

extern POKEMON_PARAM* MYSTERY_PokemonCreate(const GIFT_PRESENT_POKEMON* pGift, HEAPID heapID, GAMEDATA* pGameData);

