//==============================================================================
/**
 * @file    union_eff.h
 * @brief   ユニオンルーム：エフェクト類のヘッダ
 * @author  matsuda
 * @date    2010.01.17(日)
 */
//==============================================================================
#pragma once

#include "field/fldmmdl.h"


//==============================================================================
//  型定義
//==============================================================================
///ユニオンエフェクト制御システム構造体
typedef struct _UNION_EFF_SYSTEM UNION_EFF_SYSTEM;


//==============================================================================
//  外部関数宣言
//==============================================================================
//--------------------------------------------------------------
//  システム系
//--------------------------------------------------------------
extern UNION_EFF_SYSTEM * UNION_EFF_SystemSetup(HEAPID heap_id);
extern void UNION_EFF_SystemExit(UNION_EFF_SYSTEM *unieff);
extern void UNION_EFF_SystemUpdate(UNION_EFF_SYSTEM *unieff);
extern void UNION_EFF_SystemDraw(UNION_EFF_SYSTEM *unieff);

//--------------------------------------------------------------
//  アプリ系
//--------------------------------------------------------------
extern void UnionEff_App_ReqFocus(UNION_EFF_SYSTEM *unieff, MMDL *mmdl);
