//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		wifibattlematch.h
 *	@brief	WIFIのバトルマッチ画面
 *	@author	Toru=Nagihashi
 *	@date		2009.11.02
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "battle/battle.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
//-------------------------------------
///	種類
//=====================================
typedef enum
{
	WIFIBATTLEMATCH_MODE_RANDOM,  //ランダム対戦
	WIFIBATTLEMATCH_MODE_WIFI,    //WIFI大会
	WIFIBATTLEMATCH_MODE_LIVE,    //ライブ大会

} WIFIBATTLEMATCH_MODE;


//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	PROCパラメータ
//=====================================
typedef struct 
{
  GAMEDATA              *p_game_data; //[in ]ゲームデータ
  BtlRule               btl_rule;     //[in ]バトルルール
	WIFIBATTLEMATCH_MODE	mode;         //[in ]起動モード
} WIFIBATTLEMATCH_PARAM;


//=============================================================================
/**
 *					外部参照
*/
//=============================================================================
FS_EXTERN_OVERLAY( wifibattlematch_sys );
extern const GFL_PROC_DATA	WifiBattleMaptch_ProcData;
