#!/usr/bin/ruby
#===================================================================
#
# @brief  make対象にするフォルダを環境変数に吐き出す
#
# @data   09.12.04
# @author genya_hosaka
#
#===================================================================

#====================================================
# 設定
#====================================================
# 文字コード指定
$KCODE = 'SJIS'

#====================================================
# 定数宣言
#====================================================
#ヘッダファイル出力
DST_FILENAME = "make_dir"  #出力ファイル名

#====================================================
# 主処理 開始
#====================================================

#カレントにあるファイルをリストアップ
pwd =  Dir::entries( Dir::pwd )

# 配列化
val = pwd.to_a;
# フォルダに厳選、特殊フォルダを排除
val = val.select{ |i| File::ftype(i) == "directory" && i != "." && i != ".." && i != ".svn" }

# 文字列生成
str = ""
val.each{ |i|
  str += i
  str += " "
}

# 環境変数に書いてみる
# ENV.store("SUBDIRS",str)
# p ENV["SUBDIRS"]
# p ENV.keys

File::open( DST_FILENAME ,"w"){ |file|

    file.print "SUBDIRS = "
    file.print str
}

