//============================================================================================
/**
 * @file		cdemo_seq.h
 * @brief		コマンドデモ画面 シーケンス処理
 * @author	Hiroyuki Nakamura
 * @date		09.05.07
 */
//============================================================================================
#pragma	once


// メインシーケンス
enum {
	CDEMOSEQ_MAIN_INIT = 0,			// 初期化
	CDEMOSEQ_MAIN_RELEASE,			// 解放
	CDEMOSEQ_MAIN_FADE,					// フェード
	CDEMOSEQ_MAIN_ALPHA_BLEND,	// アルファブレンド
	CDEMOSEQ_MAIN_BG_SCRN_ANM,	// ＢＧスクリーンアニメ
	CDEMOSEQ_MAIN_MAIN,					// メイン
	CDEMOSEQ_MAIN_END,					// 終了
};


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * @brief		メイン処理
 *
 * @param		wk		デモワーク
 *
 * @retval	"TRUE = 処理中"
 * @retval	"FALSE = それ以外"
 */
//-------------------------------------------------------------------------------------------
extern BOOL CDEMOSEQ_Main( CDEMO_WORK * wk, int * seq );
