//=============================================================================================
/**
 * @file	bmp_win.h
 * @brief	ビットマップウィンドウシステム
 */
//=============================================================================================
#ifndef _BMP_WIN_H_
#define _BMP_WIN_H_

#include <bg_sys.h>
#include <bmp.h>

#ifdef __cplusplus
extern "C" {
#endif


//----------------------------------------------------
/**
 *  ハンドル構造体の型宣言
 */
//----------------------------------------------------
typedef struct _GFL_BMPWIN	GFL_BMPWIN;

//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
/**
 *
 * ビットマップ管理システムの開始、終了
 *
 * 主にプロセス起動、終了時に呼ばれる。
 * ビットマップウインドウを使用するＢＧフレーム（複数指定可）、使用ＣＧＸ領域の設定を行う。
 * これ以後、各ビットマップ作成の際は、ここで設定したステータスが用いられる。
 */
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
/**
 * システム初期化
 *
 * @param	heapID	使用ヒープ領域
 */
//--------------------------------------------------------------------------------------------
extern void	GFL_BMPWIN_Init( HEAPID heapID );

//--------------------------------------------------------------------------------------------
/**
 * システム終了
 */
//--------------------------------------------------------------------------------------------
extern void GFL_BMPWIN_Exit( void );

//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウの作成、破棄
 *
 * ビットマップとして使用したいＢＧフレーム、描画位置、使用ＣＧＸサイズの設定などを指定し
 * ビットマップウインドウ管理ハンドルを作成する。
 * 自動でＣＧＸバッファ領域のヒープ確保も行う。
 * 作成後のビットマップウインドウ操作は、ハンドルポインタによって行われる。
 */
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------

//=============================================================================================
/**
 *
 * ビットマップウインドウの作成
 *（領域自動確保版：通常はこちらを使ってください）
 *
 * @param[in]	frmnum	GFL_BGL使用フレーム
 * @param[in]	posx	Ｘ座標（キャラクター単位）
 * @param[in]	posy	Ｙ座標（キャラクター単位）
 * @param[in]	sizx	Ｘサイズ（キャラクター単位）
 * @param[in]	sizy	Ｙサイズ（キャラクター単位）
 * @param[in]	panum	使用パレットナンバー
 * @param[in]	dir		確保ＶＲＡＭ方向(GFL_BMP_CHRAREA_GET_F:前方確保　GFL_BMP_CHRAREA_GET_B:後方確保）
 *
 * @return	ビットマップウインドウハンドルポインタ
 */
//=============================================================================================
extern GFL_BMPWIN* GFL_BMPWIN_Create( u8 frmnum, u8 posx, u8 posy, u8 sizx, u8 sizy, u8 palnum, u8 dir );

//=============================================================================================
/**
 * ビットマップウインドウの作成
 *（領域固定版：旧作の移植などのために暫定的に作った。それ以外には使わないようにお願いします。）
 *
 * @param[in]	frmnum	GFL_BGL使用フレーム
 * @param[in]	posx		Ｘ座標（キャラクター単位）
 * @param[in]	posy		Ｙ座標（キャラクター単位）
 * @param[in]	sizx		Ｘサイズ（キャラクター単位）
 * @param[in]	sizy		Ｙサイズ（キャラクター単位）
 * @param[in]	panum		使用パレットナンバー
 * @param[in]	charPos	使用する先頭キャラナンバ
 *
 * @retval  GFL_BMPWIN*		
 *
 */
//=============================================================================================
extern GFL_BMPWIN* GFL_BMPWIN_CreateFixPos( u8 frmnum, u8 posx, u8 posy, u8 sizx, u8 sizy, u8 palnum, u32 charPos );


//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウの破棄
 *
 * @param	bmpwin	ビットマップウインドウポインタ
 */
//--------------------------------------------------------------------------------------------
extern void GFL_BMPWIN_Delete( GFL_BMPWIN* bmpwin );

//--------------------------------------------------------------------------------------------
/**
 *
 * 描画制御
 *
 */
//--------------------------------------------------------------------------------------------
//---------------------------------------------------------
/**
 * ビットマップ用キャラクターを内部バッファからＶＲＡＭへ転送
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
extern	void	GFL_BMPWIN_TransVramCharacter( GFL_BMPWIN * bmpwin );

//---------------------------------------------------------
/**
 * ビットマップ用スクリーンを関連ＢＧスクリーンバッファに作成する
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
extern	void	GFL_BMPWIN_MakeScreen( GFL_BMPWIN * bmpwin );

//---------------------------------------------------------
/**
 * ウィンドウ枠のスクリーンデータを関連ＢＧスクリーンバッファに作成する
 *
 * @param[in]	win				ビットマップウインドウポインタ
 * @param[in]	start_char_num	ウィンドウ枠開始キャラナンバー
 * @param[in]	pal_num			ウィンドウ枠パレットナンバー
 *
 *  ウィンドウ枠キャラクターデータは、
 * 【左上(0)，上辺(1)，右上(2)，左辺(3)，右辺(4)、左下(5)，下辺(6)，右下(7)】
 *  の順に並んでいることを想定している。
 *                                                  0111112
 *                                                  3     4
 *                                                  3     4
 *                                                  5666667
 */
//---------------------------------------------------------
extern	void	GFL_BMPWIN_MakeFrameScreen( GFL_BMPWIN* win, u16 start_char_num, u16 pal_num );

//---------------------------------------------------------
/**
 * 関連ＢＧスクリーンバッファのビットマップ用スクリーンをクリアする
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
extern	void	GFL_BMPWIN_ClearScreen( GFL_BMPWIN * bmpwin );

//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウステータス取得
 */
//--------------------------------------------------------------------------------------------
//--------------------------------
/**
 *
 * フレームナンバーの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	フレームナンバー
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetFrame( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * BMP領域のXサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	BMP領域のXサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetSizeX( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * BMP領域のYサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	BMP領域のYサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetSizeY( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * スクリーンXサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	スクリーンXサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetScreenSizeX( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * スクリーンYサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	スクリーンYサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetScreenSizeY( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * 描画Xサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	描画Xサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetPosX( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * 描画Yサイズの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	描画Yサイズ
 */
//--------------------------------
extern	u8	GFL_BMPWIN_GetPosY( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * キャラクターナンバーの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	キャラクターナンバー
 */
//--------------------------------
extern	u16	GFL_BMPWIN_GetChrNum( const GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * ビットマップポインタの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	ビットマップポインタ
 */
//--------------------------------
extern	GFL_BMP_DATA*	GFL_BMPWIN_GetBmp( GFL_BMPWIN * bmpwin );

//--------------------------------
/**
 * パレットナンバーの取得
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 *
 * @retval	パレットナンバー
 */
//--------------------------------
extern u8 GFL_BMPWIN_GetPalette( const GFL_BMPWIN * bmpwin );

//--------------------------------------------------------------------------------------------
/**
 * ビットマップウインドウステータス変更
 */
//--------------------------------------------------------------------------------------------
//--------------------------------
/**
 * 描画X座標の変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	px		セットする描画X座標
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetPosX( GFL_BMPWIN * bmpwin, u8 px );

//--------------------------------
/**
 * 描画Y座標の変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	py		セットする描画Y座標
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetPosY( GFL_BMPWIN * bmpwin, u8 py );

//--------------------------------
/**
 * スクリーン描画サイズXの変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	sx		セットするスクリーン描画サイズX
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetScreenSizeX( GFL_BMPWIN * bmpwin, u8 sx );

//--------------------------------
/**
 * スクリーン描画サイズＹの変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	sy		セットするスクリーン描画サイズY
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetScreenSizeY( GFL_BMPWIN * bmpwin, u8 sy );

//--------------------------------
/**
 * パレットナンバーの変更
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 * @param[in]	palnum	セットするパレットナンバー
 */
//--------------------------------
extern	void	GFL_BMPWIN_SetPalette( GFL_BMPWIN * bmpwin, u8 palnum );

//--------------------------------------------------------------------------------------------
/**
 *
 * 描画制御補助
 *
 */
//--------------------------------------------------------------------------------------------
//---------------------------------------------------------
/**
 * BMPWINのキャラを転送・スクリーンのMake・転送を一括で行う
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
inline	void	GFL_BMPWIN_MakeTransWindow( GFL_BMPWIN * bmpwin )
{
	GFL_BMPWIN_TransVramCharacter( bmpwin );
	GFL_BMPWIN_MakeScreen( bmpwin );
	GFL_BG_LoadScreenReq( GFL_BMPWIN_GetFrame(bmpwin) );
}

//---------------------------------------------------------
/**
 * BMPWINのキャラを転送・スクリーンのMake・転送を一括で行う(VBlank用
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
inline	void	GFL_BMPWIN_MakeTransWindow_VBlank( GFL_BMPWIN * bmpwin )
{
	GFL_BMPWIN_TransVramCharacter( bmpwin );
	GFL_BMPWIN_MakeScreen( bmpwin );
	GFL_BG_LoadScreenV_Req( GFL_BMPWIN_GetFrame(bmpwin) );
}

//---------------------------------------------------------
/**
 * スクリーンのClear・転送を一括で行う
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
inline	void	GFL_BMPWIN_ClearTransWindow( GFL_BMPWIN * bmpwin )
{
	GFL_BMPWIN_ClearScreen( bmpwin );
	GFL_BG_LoadScreenReq( GFL_BMPWIN_GetFrame(bmpwin) );
}

//---------------------------------------------------------
/**
 * スクリーンのClear・転送を一括で行う(VBlank用
 *
 * @param[in]	bmpwin	ビットマップウインドウポインタ
 */
//---------------------------------------------------------
inline	void	GFL_BMPWIN_ClearTransWindow_VBlank( GFL_BMPWIN * bmpwin )
{
	GFL_BMPWIN_ClearScreen( bmpwin );
	GFL_BG_LoadScreenV_Req( GFL_BMPWIN_GetFrame(bmpwin) );
}


#ifdef __cplusplus
}/* extern "C" */
#endif

#endif
