#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================================
/**
 * @file	double3Ddisp.h
 * @author	GAME FREAK inc.
 */
//=============================================================================================
#ifndef	__GFL_DOUBLE3DDISP_H__
#define	__GFL_DOUBLE3DDISP_H__

/*
============================================================================================


		現在試用段階です。
		ディスプレイは外側で両面ＯＮにしてください。あたりまえだけど。

		基本はNitroSDKのサンプルのまま
		サブ画面(非３Ｄ画面)のキャプチャーデータ切り替え用に
		ＢＧ，ＯＢＪリソースをフルに使っているのがネックで
		このままＢＧやＯＢＪと共存できるのかは疑問

		サブVRAMはキャプチャーのために
		ＢＧ，ＯＢＪともに256ビットマップとして128kを必要とする。
		なので現状それを満たすには、VRAM_C,VRAM_Dが固定で使用されることになる。
		VRAM_Dを使用するので、通信との両立は不可能


============================================================================================
*/
//------------------------------------------------------------------
/**
 * @brief	初期化
 *
 * キャプチャーデータ表示ＯＢＪを設定
 *
 * @param	heapID	ヒープＩＤ
 */
//------------------------------------------------------------------
extern void 
	GFL_G3D_DOUBLE3D_Init
		( HEAPID heapID );

//------------------------------------------------------------------
/**
 * @brief	終了（VBLANKタスクリムーブ後に呼ぶこと）
 */
//------------------------------------------------------------------
extern void 
	GFL_G3D_DOUBLE3D_Exit
		( void );

/*
============================================================================================


		描画の際、以下の関数を用いて。各種切り替え設定を行ってください。
		
		GFL_G3D_DOUBLE3D_GetFlip
			現在のflipを取得することにより、上下に相当する描画を切り替えます。
			（カメラ等）

		GFL_G3D_DOUBLE3D_SetSwapFlag
			SwapBuffer終了後に設定してください

		（例）
		static void g3d_draw( void )
		{
			if( flip_flag ){
				GFL_G3D_CAMERA_Switching( g3DcameraLower );
			} else {
				GFL_G3D_CAMERA_Switching( g3DcameraUpper );
			}
			GFL_G3D_SCENE_Draw( g3Dscene );  
			swap = TRUE;
		}


============================================================================================
*/
//------------------------------------------------------------------
/**
 * @brief	flip面フラグ取得
 *
 * @return	TRUE = 下が３Ｄ, FALSE = 上が３Ｄ
 */
//------------------------------------------------------------------
extern BOOL
	GFL_G3D_DOUBLE3D_GetFlip
		( void );
//------------------------------------------------------------------
/**
 * @brief	swap終了フラグ設定
 */
//------------------------------------------------------------------
extern void 
	GFL_G3D_DOUBLE3D_SetSwapFlag
		( void );

/*
============================================================================================


		画面の切り替えはVBLANK中に実行します。
		
		GFL_G3D_DOUBLE3D_VblankIntr( 直接呼出し用 )
		GFL_G3D_DOUBLE3D_VblankIntrTask( TCB用 )

		のいずれかをセットアップしてください。


============================================================================================
*/
//------------------------------------------------------------------
/**
 * @brief	VBLANK割り込み関数
 */
//------------------------------------------------------------------
extern void
	GFL_G3D_DOUBLE3D_VblankIntr
		( void );

extern void	
	GFL_G3D_DOUBLE3D_VblankIntrTCB
		( GFL_TCB* tcb, void* work );

#endif	__GFL_DOUBLE3DDISP_H__

#ifdef __cplusplus
} /* extern "C" */
#endif
