//============================================================================
/**
 *
 *	@file		comm_battle_demo.h
 *	@brief  通信バトルデモ 
 *	@author hosaka genya
 *	@data		2010.01.20
 *
 */
//============================================================================
#pragma once

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================

#define TRAINER_NAME_BUF_LEN ( PERSON_NAME_SIZE*2+EOM_SIZE ) ///< プレイヤー名BUFの長さ

//--------------------------------------------------------------
///	トレーナーID配列のID
//==============================================================
enum
{ 
  COMM_BTL_DEMO_TRDATA_A = 0,    ///< マルチバトルの時、ユニオンルームで左上の位置 / 通常時は自分
  COMM_BTL_DEMO_TRDATA_B,        ///< マルチバトルの時、ユニオンルームで左下の位置 / 通常時は相手
  COMM_BTL_DEMO_TRDATA_C,        ///< マルチバトルの時、ユニオンルームで右上の位置
  COMM_BTL_DEMO_TRDATA_D,        ///< マルチバトルの時、ユニオンルームで右下の位置

  COMM_BTL_DEMO_TRDATA_MAX,
};

//=============================================================================
/**
 *								構造体定義
 */
//=============================================================================

//--------------------------------------------------------------
///	通信バトルデモ 起動タイプ
//==============================================================
typedef enum
{ 
  COMM_BTL_DEMO_TYPE_NORMAL_START,  ///< ノーマル開始
  COMM_BTL_DEMO_TYPE_NORMAL_END,    ///< ノーマル終了
  COMM_BTL_DEMO_TYPE_MULTI_START,   ///< マルチバトル開始
  COMM_BTL_DEMO_TYPE_MULTI_END,     ///< マルチバトル終了
} COMM_BTL_DEMO_TYPE;

//--------------------------------------------------------------
///	トレーナー毎のデータ
//==============================================================
typedef struct {
  const POKEPARTY* party; ///< 所有ポケモンデータ
  const STRBUF* str_trname[ TRAINER_NAME_BUF_LEN ]; ///< トレイナー名
  int trsex;                                        ///< トレイナーの性別:PTL_SEX_XXX
  int server_version;                               ///< サーババージョン
} COMM_BTL_DEMO_TRAINER_DATA;

//--------------------------------------------------------------
///	初期化パラメータ
//==============================================================
typedef struct {
  // [IN]
  COMM_BTL_DEMO_TYPE type; ///< 通信バトルデモ 起動タイプ
  COMM_BTL_DEMO_TRAINER_DATA trainer_data[ COMM_BTL_DEMO_TRDATA_MAX ];  ///< トレーナー毎のデータ
  // [OUT]
} COMM_BTL_DEMO_PARAM;

//=============================================================================
/**
 *								EXTERN宣言
 */
//=============================================================================

FS_EXTERN_OVERLAY(comm_btl_demo);
extern const GFL_PROC_DATA CommBtlDemoProcData;

