//============================================================================
/**
 *  @file   egg_demo.h
 *  @brief  タマゴ孵化デモ
 *  @author Koji Kawada
 *  @data   2010.01.25
 *  @note   
 *
 *  モジュール名：EGG_DEMO
 */
//============================================================================
#pragma once


// インクルード
#include <gflib.h>


// オーバーレイ
FS_EXTERN_OVERLAY(egg_demo);


//=============================================================================
/**
 *  PROC
 */
//=============================================================================
extern const GFL_PROC_DATA    EGG_DEMO_ProcData;


//=============================================================================
/**
*  構造体宣言
*/
//=============================================================================
//-------------------------------------
/// PROC パラメータ
//=====================================
typedef struct _EGG_DEMO_PARAM
{
  GAMEDATA*         gamedata;           ///< [in,out]  GAMEDATA
  POKEMON_PARAM*    pp;                 ///< [in,out]  孵化させるタマゴ
}
EGG_DEMO_PARAM;


//=============================================================================
/**
*  関数のプロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
/// タマゴ孵化デモ用パラメータ生成
//=====================================
extern EGG_DEMO_PARAM*  EGG_DEMO_AllocParam(
                            HEAPID           heap_id,
                            GAMEDATA*        gamedata,
                            POKEMON_PARAM*   pp );

//-------------------------------------
/// タマゴ孵化デモ用パラメータ解放
//=====================================
extern void             EGG_DEMO_FreeParam(
                            EGG_DEMO_PARAM*  param );

//-------------------------------------
/// タマゴ孵化デモ用パラメータを設定する
//=====================================
extern void             EGG_DEMO_InitParam(
                            EGG_DEMO_PARAM*  param,
                            GAMEDATA*        gamedata,
                            POKEMON_PARAM*   pp );
