//============================================================================
/**
 *  @file   shinka_demo.h
 *  @brief  進化デモ
 *  @author Koji Kawada
 *  @data   2010.01.13
 *  @note   
 *
 *  モジュール名：SHINKADEMO
 */
//============================================================================
#pragma once

#include "poke_tool/pokeparty.h"
#include "gamesystem/gamedata_def.h"

// オーバーレイ
FS_EXTERN_OVERLAY(shinka_demo);


//=============================================================================
/**
 *  PROC
 */
//=============================================================================
extern  const GFL_PROC_DATA   ShinkaDemoProcData;


//=============================================================================
/**
*  構造体宣言
*/
//=============================================================================
//-------------------------------------
/// PROC パラメータ
//=====================================
typedef struct _SHINKA_DEMO_PARAM
{
  GAMEDATA*         gamedata;           ///< [in,out]  GAMEDATA
  const POKEPARTY*  ppt;                ///< [in]      POKEPARTY構造体
  u16               after_mons_no;      ///< [in]      進化後のポケモンナンバー
  u8                shinka_pos;         ///< [in]      進化するポケモンのPOKEPARTY内のインデックス
  u8                shinka_cond;        ///< [in]      進化条件（ヌケニンチェックに使用）
  BOOL              b_field;            ///< [in]      フィールドから呼び出すときはTRUE、バトル後に呼び出すときはFALSE
  BOOL              b_enable_cancel;    ///< [in]      進化キャンセルできるときはTRUE、できないときはFALSE
}
SHINKA_DEMO_PARAM;


//=============================================================================
/**
*  関数のプロトタイプ宣言
*/
//=============================================================================


