//==============================================================================
/**
 *
 * 戦闘録画
 *
 */
//==============================================================================
#ifndef __GT_GDS_BATTLE_REC_H__
#define __GT_GDS_BATTLE_REC_H__


//--------------------------------------------------------------
/**
 *  送信データ：戦闘録画
 *  6312byte
 */
//--------------------------------------------------------------
typedef struct {
  GDS_PROFILE profile;    ///<GDSプロフィール   88
  BATTLE_REC_HEADER head;   ///<戦闘録画のヘッダ  100
  BATTLE_REC_WORK rec;    ///<録画データ本体      7272
}BATTLE_REC_SEND;

//--------------------------------------------------------------
/**
 *  送信データ：検索リクエスト
 *  16byte
 */
//--------------------------------------------------------------
typedef struct{
  u16 monsno;         ///< ポケモン番号
  u16 battle_mode;       ///< 検索施設
  u16 battle_mode_bit_mask; ///< 検索条件ビットマスク
  u8 country_code;      ///< 住んでいる国コード
  u8 local_code;        ///< 住んでいる地方コード
  
  u32 server_version;     ///< ROMのサーバーバージョン
  
  u8 work[4];         ///<予備
}BATTLE_REC_SEARCH_SEND;

//--------------------------------------------------------------
/**
 *  送信データ：ランキング取得
 */
//--------------------------------------------------------------
typedef struct{
  u32 server_version;     ///< ROMのサーバーバージョン
}BATTLE_REC_RANKING_SEARCH_SEND;


//--------------------------------------------------------------
/**
 *  受信データ：概要一覧取得時
 *  196byte
 */
//--------------------------------------------------------------
typedef struct {
  GDS_PROFILE profile;    ///<GDSプロフィール
  BATTLE_REC_HEADER head;   ///<戦闘録画のヘッダ
}BATTLE_REC_OUTLINE_RECV;

//--------------------------------------------------------------
/**
 *  受信データ：一件の検索結果取得時
 *  6312byte
 */
//--------------------------------------------------------------
typedef struct{
  GDS_PROFILE profile;    ///<GDSプロフィール
  BATTLE_REC_HEADER head;   ///<戦闘録画のヘッダ
  BATTLE_REC_WORK rec;    ///<戦闘録画本体
}BATTLE_REC_RECV;


#endif  //__GT_GDS_BATTLE_REC_H__

