//==============================================================================
/**
 *
 * ミュージカルショット
 *
 */
//==============================================================================
#ifndef __GT_GDS_MUSICAL_H__
#define __GT_GDS_MUSICAL_H__


//--------------------------------------------------------------
/**
 *	送信データ：ミュージカルショット
 *		544byte
 */
//--------------------------------------------------------------
typedef struct{
	GDS_PROFILE profile;
	MUSICAL_SHOT_DATA mus_shot;
}MUSICAL_SHOT_SEND;

//--------------------------------------------------------------
/**
 *	受信データ：ミュージカルショット
 *		544byte
 */
//--------------------------------------------------------------
typedef struct{
	GDS_PROFILE profile;
	MUSICAL_SHOT_DATA mus_shot;
}MUSICAL_SHOT_RECV;


#endif  //__GT_GDS_MUSICAL_H__
