//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		dwcrap_sc_gdb.h
 *	@brief  DWC統計・競争＆データベースラップルーチン
 *	@author	Toru=Nagihashi
 *	@date		2009.11.24
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once
#include "sc/dwc_sc.h"
#include "gdb/dwc_gdb.h"
//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	受け取り構造体
//=====================================
typedef struct 
{
  u16 win;
  u16 lose;
  u32 match_cnt;
  u32 rate;
} DWC_GDB_PARAM;



//-------------------------------------
///	ワーク
//=====================================
typedef struct _DWCRAP_SC_GDB_WORK DWCRAP_SC_GDB_WORK;


//=============================================================================
/**
 *					プロトタイプ宣言
*/
//=============================================================================
//-------------------------------------
///	ワーク作成
//=====================================
extern DWCRAP_SC_GDB_WORK * DWCRAP_SC_GDB_Init( HEAPID heapID );
extern void DWCRAP_SC_GDB_Exit( DWCRAP_SC_GDB_WORK *p_wk );

//-------------------------------------
///	統計・競争関係（SC）
//=====================================
extern void DWCRAP_SC_Start( DWCRAP_SC_GDB_WORK *p_wk );
extern BOOL DWCRAP_SC_Process( DWCRAP_SC_GDB_WORK *p_wk, const DWCUserData *cp_user_data, DWCScResult *p_result );

//-------------------------------------
///	データベース関係（GDB)
//=====================================
extern void DWCRAP_GDB_Start( DWCRAP_SC_GDB_WORK *p_wk );
extern BOOL DWCRAP_GDB_Process( DWCRAP_SC_GDB_WORK *p_wk, const DWCUserData *cp_user_data, DWCGdbError *p_result );
