#=============================================================================================
#
#	スタッフロール：GMMファイル作成
#	2010/04/23 by nakahiro
#
#=============================================================================================

#---------------------------------------------------------------------------------------------
#	定数定義
#---------------------------------------------------------------------------------------------


#---------------------------------------------------------------------------------------------
#	グローバル変数
#---------------------------------------------------------------------------------------------
$CSV_FILE = $ARGV[0];		# 元ファイル
$GMM_FILE = $ARGV[1];		# テンプレートＧＭＭ

$CNV_FILE = 0;				# コンバートファイル名
@TailData = ();				# テイルデータ


#---------------------------------------------------------------------------------------------
#	メイン処理
#---------------------------------------------------------------------------------------------

&SUB_MakeCnvFileName();	# コンバートファイル名作成
&SUB_TemplateGMM();		# ヘッダ部分の書き込みとテイル部分の取得
&SUB_DataConv();		# データコンバート
&SUB_SetTailGMM();		# テイル部分の書き込み

exit;


#---------------------------------------------------------------------------------------------
#	コンバートファイル名作成
#---------------------------------------------------------------------------------------------
sub SUB_MakeCnvFileName {
	$CNV_FILE = $CSV_FILE;
	$CNV_FILE =~ s/.csv/.gmm/;
}


#---------------------------------------------------------------------------------------------
#	ヘッダ部分の書き込みとテイル部分の取得
#---------------------------------------------------------------------------------------------
sub SUB_TemplateGMM {
	# テンプレートＧＭＭ読み込み
	open( FP_GMM, $GMM_FILE );
	@fp_gmm = <FP_GMM>;
	close( FP_GMM );

	# 作成ファイルオープン
	open( FP_CNV, "> " . $CNV_FILE );

	$seq = 0;
	$cnt = 0;
	foreach $one ( @fp_gmm ){
		# ヘッダ書き込み
		if( $seq == 0 ){
			if( $one =~ /<row id=/ ){
				$seq = 1;
			}else{
				print( FP_CNV $one );
			}
		# テイル検索
		}elsif( $seq == 1 ){
			if( $one =~ /<flowchart-group-list>/ ){
				$seq = 2;
			}
		}

		# テイル書き込み
		if( $seq == 2 ){
			$TailData[$cnt] = $one;
			$cnt++;
		}
	}
	close( FP_CNV );
}

#---------------------------------------------------------------------------------------------
#	データコンバート
#---------------------------------------------------------------------------------------------
use Encode;

sub SUB_DataConv {
	# 元ファイルオープン
	open( FP_CSV, "< " . $CSV_FILE );
	$fp_csv = <FP_CSV>;					# ダミー
	@fp_csv = <FP_CSV>;
	close( FP_CSV );

	# 作成ファイルオープン
	open( FP_CNV, ">> " . $CNV_FILE );

	$cnt = 0;
	foreach $one ( @fp_csv ){
		@line = split( ",", $one );		# ","で分割

		$line[0] =~ s/&/&amp;/g;		# "&"を"&amp;"に置き換え
		$line[0] =~ s/、/,/g;			# "、"を","に置き換え

#		print( $line[0] . "\t" );

		if( $line[0] ne "" ){
#			$text = encode( "utf8", decode( "shiftjis", $line[0] ) );	# Shift-Jis > UTF8
			$text = encode( "utf8", decode( "cp932", $line[0] ) );	# Shift-Jis > UTF8

			# "E'"この文字が"?"になってしまうため、強引に置き換えてます。
			# 文字コードをUTF8に変換し、"?"を置き換える。
			$eE = encode( "utf8", pack( "C", hex("C9") ) );
			$text =~ s/\?/$eE/g;

			if( $cnt < 10 ){
				print( FP_CNV "\t<row id=\"STAFF_ROLL_STR_00" . $cnt ."\">\n" );
			}elsif( $cnt < 100 ){
				print( FP_CNV "\t<row id=\"STAFF_ROLL_STR_0" . $cnt ."\">\n" );
			}else{
				print( FP_CNV "\t<row id=\"STAFF_ROLL_STR_" . $cnt ."\">\n" );
			}
			print( FP_CNV "\t\t<language name=\"JPN\" width=\"256\">" . $text . "</language>\n" );
			print( FP_CNV "\t\t<language name=\"JPN_KANJI\" width=\"256\">" . $text . "</language>\n" );
			print( FP_CNV "\t</row>\n\n" );
			$cnt++;
		}
	}

	close( FP_CNV );
}


#---------------------------------------------------------------------------------------------
#	テイル部分の書き込み
#---------------------------------------------------------------------------------------------
sub SUB_SetTailGMM {
	# 作成ファイルオープン
	open( FP_CNV, ">> " . $CNV_FILE );
	foreach $one ( @TailData ){
		print( FP_CNV $one );
	}
	close( FP_CNV );
}
