//======================================================================
/**
 * @file	mus_shot_photo.h
 * @brief	ミュージカルショット　上画面写真
 * @author	ariizumi
 * @data	09/09/15
 *
 * モジュール名：MUS_SHOT_PHOTO
 */
//======================================================================
#pragma once
#include "musical/musical_shot_sys.h"


//======================================================================
//	define
//======================================================================
#pragma mark [> define

//======================================================================
//	enum
//======================================================================
#pragma mark [> enum


//======================================================================
//	typedef struct
//======================================================================
#pragma mark [> struct
typedef struct _MUS_SHOT_PHOTO_WORK MUS_SHOT_PHOTO_WORK;

//======================================================================
//	proto
//======================================================================
#pragma mark [> proto

MUS_SHOT_PHOTO_WORK* MUS_SHOT_PHOTO_InitSystem( MUSICAL_SHOT_DATA *shotData , HEAPID heapId );
void MUS_SHOT_PHOTO_ExitSystem( MUS_SHOT_PHOTO_WORK *photWork );
void MUS_SHOT_PHOTO_UpdateSystem( MUS_SHOT_PHOTO_WORK *photWork );

//--------------------------------------------------------------
//	
//--------------------------------------------------------------