//======================================================================
/**
 * @file	dressup_system.h
 * @brief	ミュージカルのドレスアップProc
 * @author	ariizumi
 * @data	09/02/10
 */
//======================================================================
#ifndef MUSICAL_DRESSUP_SYS_H__
#define MUSICAL_DRESSUP_SYS_H__

#include "musical/musical_define.h"

//======================================================================
//	define
//======================================================================

//======================================================================
//	enum
//======================================================================

//======================================================================
//	typedef struct
//======================================================================

typedef struct _DRESSUP_INIT_WORK DRESSUP_INIT_WORK;

//======================================================================
//	proto
//======================================================================

extern GFL_PROC_DATA DressUp_ProcData;

DRESSUP_INIT_WORK* MUSICAL_DRESSUP_CreateInitWork( HEAPID heapId ,  MUSICAL_POKE_PARAM *musPoke , SAVE_CONTROL_WORK *saveCtrl );
void MUSICAL_DRESSUP_DeleteInitWork( DRESSUP_INIT_WORK* initWork );

//--------------------------------------------------------------
//	
//--------------------------------------------------------------

#endif MUSICAL_DRESSUP_SYS_H__