//=============================================================================================
/**
 * @file	g3d_util.h                                                  
 * @brief	３Ｄ描画管理システム使用プログラム
 */
//=============================================================================================
//=============================================================================================
//	型宣言
//=============================================================================================
//=============================================================================================
/**
 *
 *
 * ３Ｄ関連ハンドルの配列管理ユーティリティー
 * 
 *
 */
//=============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * セットアップ
 *
 * @param	resCount		管理リソース最大数	
 * @param	objCount		管理オブジェクト最大数
 * @param	anmCount		管理アニメーション最大数
 * @param	heapID			ヒープＩＤ
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_UtilsysInit( u16 resCount, u16 objCount, u16 anmCount, HEAPID heapID );  
//--------------------------------------------------------------------------------------------
/**
 * 破棄
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_UtilsysExit( void );  

//=============================================================================================
/**
 *
 *
 * ３Ｄリソース管理
 *
 *
 */
//=============================================================================================
typedef enum {
	GFL_G3D_UTIL_RESARC = 0,		//アーカイブＩＤを指定
	GFL_G3D_UTIL_RESPATH,			//アーカイブパスを指定

}GFL_G3D_UTIL_RESTYPE;	//指定アーカイブタイプ

//	リソース配列設定用テーブル構造体
typedef struct {
	u32						arcive;		//指定アーカイブ
	u16						datID;		//アーカイブ内データＩＤ
	GFL_G3D_UTIL_RESTYPE	arcType;	//指定アーカイブタイプ
	BOOL					trans;		//VRAM転送フラグ(テクスチャリソースの際に参照。TRUE=転送)
}GFL_G3D_UTIL_RES;

//--------------------------------------------------------------------------------------------
/**
 * リソースを配列に追加
 *
 * @param	resTable		リソース配列ポインタ
 * @param	resCount		リソース数
 *
 * @return	idx				リソース配置先頭ＩＮＤＥＸ
 */
//--------------------------------------------------------------------------------------------
extern u16 GFL_G3D_UtilResLoad( const GFL_G3D_UTIL_RES* resTable, u16 resCount ); 
//--------------------------------------------------------------------------------------------
/**
 * リソースを配列から削除
 *
 * @param	idx				リソース配置先頭ＩＮＤＥＸ
 * @param	resCount		リソース数
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_UtilResUnload( u16 idx, u16 resCount ); 
//--------------------------------------------------------------------------------------------
/**
 * リソースハンドルを配列から取得
 *
 * @param	idx				リソース格納ＩＮＤＥＸ
 *
 * @return	GFL_G3D_RES*	リソースポインタ
 */
//--------------------------------------------------------------------------------------------
extern GFL_G3D_RES* GFL_G3D_UtilResGet( u16 idx ); 
//--------------------------------------------------------------------------------------------
/**
 * テクスチャリソースを配列から転送(→ＶＲＡＭ)
 *
 * @param	idx		リソース格納ＩＮＤＥＸ
 *
 * @return	BOOL	結果(成功=TRUE)
 */
//--------------------------------------------------------------------------------------------
extern BOOL GFL_G3D_UtilVramLoadTex ( u16 idx ); 

//=============================================================================================
/**
 *
 *
 * ３Ｄオブジェクト管理
 *
 *
 */
//=============================================================================================
//	オブジェクト配列設定用テーブル構造体
typedef struct {
	u16					mdlresID;		//モデルリソースＩＮＤＥＸ
	u8					mdldatID;		//モデルデータファイル内部ＩＮＤＥＸ
	u16					texresID;		//テクスチャリソースＩＮＤＥＸ
	VecFx32				trans;			//座標
	VecFx32				scale;			//スケール
	MtxFx33				rotate;			//回転
	u8					priority;		//プライオリティー
	BOOL				drawSW;			//描画フラグ(TRUE=描画)
}GFL_G3D_UTIL_OBJ;

#define GFL_G3D_UTIL_RESNULL (0xffff)
//--------------------------------------------------------------------------------------------
/**
 * オブジェクトを配列に追加
 *
 * @param	objTable		オブジェクト配列ポインタ
 * @param	objCount		オブジェクト数
 *
 * @return	idx				オブジェクト配置先頭ＩＮＤＥＸ
 */
//--------------------------------------------------------------------------------------------
extern u16 GFL_G3D_UtilObjLoad( const GFL_G3D_UTIL_OBJ* objTable, u16 objCount );  
//--------------------------------------------------------------------------------------------
/**
 * オブジェクトを配列から削除
 *
 * @param	idx				オブジェクト配置先頭ＩＮＤＥＸ
 * @param	objCount		オブジェクト数
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_UtilObjUnload( u16 idx, u16 objCount );
//--------------------------------------------------------------------------------------------
/**
 * オブジェクトハンドルを配列から取得
 *
 * @param	idx				オブジェクト格納ＩＮＤＥＸ
 *
 * @return	GFL_G3D_OBJ*	オブジェクトポインタ
 */
//--------------------------------------------------------------------------------------------
extern GFL_G3D_OBJ* GFL_G3D_UtilObjGet( u16 idx ); 

//=============================================================================================
/**
 *
 *
 * ３Ｄアニメーション管理
 *
 *
 */
//=============================================================================================
//	アニメーション配列設定用テーブル構造体
typedef struct {
	u16		anmresID;		//アニメーションリソースＩＮＤＥＸ
	u8		anmdatID;		//アニメーションデータファイル内部ＩＮＤＥＸ
	u16		forMdl;			//アニメーション適用先オブジェクトＩＮＤＥＸ
	BOOL	bind;			//TRUE = セットアップ時にforMdlにバインドする			
}GFL_G3D_UTIL_ANM;

//--------------------------------------------------------------------------------------------
/**
 * アニメーションを配列に追加
 *	参照オブジェクトが必要とされるので、オブジェクトの追加後に行うこと
 *
 * @param	anmTable		アニメーション配列ポインタ
 * @param	anmCount		アニメーション数
 *
 * @return	idx				アニメーション配置先頭ＩＮＤＥＸ
 */
//--------------------------------------------------------------------------------------------
extern u16 GFL_G3D_UtilAnmLoad( const GFL_G3D_UTIL_ANM* anmTable, u16 anmCount );  
//--------------------------------------------------------------------------------------------
/**
 * アニメーションを配列から削除
 *
 * @param	idx				アニメーション配置先頭ＩＮＤＥＸ
 * @param	objCount		アニメーション数
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_UtilAnmUnload( u16 idx, u16 anmCount );
//--------------------------------------------------------------------------------------------
/**
 * アニメーションを配列から取得
 *
 * @param	idx				アニメーション格納ＩＮＤＥＸ
 *
 * @return	GFL_G3D_ANM*	アニメーションポインタ
 */
//--------------------------------------------------------------------------------------------
extern GFL_G3D_ANM* GFL_G3D_UtilAnmGet( u16 idx ); 

//=============================================================================================
/**
 *
 *
 * ３Ｄハンドル管理一括呼び出し
 * 　上のリソース、オブジェクト、アニメーションのセットアップ、破棄をまとめて。
 *
 *
 */
//=============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * 配列にまとめて追加
 *
 * @param	resTable		リソース配列ポインタ
 * @param	resCount		リソース数
 * @param	resIdx			リソース配置先頭ＩＮＤＥＸ格納ポインタ
 * @param	objTable		オブジェクト配列ポインタ
 * @param	objCount		オブジェクト数
 * @param	objIdx			オブジェクト配置先頭ＩＮＤＥＸ格納ポインタ
 * @param	anmTable		アニメーション配列ポインタ
 * @param	anmCount		アニメーション数
 * @param	objIdx			アニメーション配置先頭ＩＮＤＥＸ格納ポインタ
 */
//--------------------------------------------------------------------------------------------
inline void
	GFL_G3D_UtilAllLoad
		( const GFL_G3D_UTIL_RES* resTable, u16 resCount, u16* resIdx,
		   const GFL_G3D_UTIL_OBJ* objTable, u16 objCount, u16* objIdx,
			 const GFL_G3D_UTIL_ANM* anmTable, u16 anmCount, u16* anmIdx )
{
	*resIdx = GFL_G3D_UtilResLoad( resTable, resCount ); 
	*objIdx = GFL_G3D_UtilObjLoad( objTable, objCount ); 
	*anmIdx = GFL_G3D_UtilAnmLoad( anmTable, anmCount ); 
}

//--------------------------------------------------------------------------------------------
/**
 * 配列からまとめて破棄
 *
 * @param	resCount		リソース数
 * @param	resIdx			リソース配置先頭ＩＮＤＥＸ格納ポインタ
 * @param	objCount		オブジェクト数
 * @param	objIdx			オブジェクト配置先頭ＩＮＤＥＸ格納ポインタ
 * @param	anmCount		アニメーション数
 * @param	objIdx			アニメーション配置先頭ＩＮＤＥＸ格納ポインタ
 */
//--------------------------------------------------------------------------------------------
inline void
	GFL_G3D_UtilAllUnload
		( u16 resCount, u16* resIdx, u16 objCount, u16* objIdx, u16 anmCount, u16* anmIdx )
{
	GFL_G3D_UtilAnmUnload( *anmIdx, anmCount );
	GFL_G3D_UtilObjUnload( *objIdx, objCount );
	GFL_G3D_UtilResUnload( *resIdx, resCount );
}

//=============================================================================================
/**
 *
 *
 * 描画管理
 *
 *
 */
//=============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * ３Ｄオブジェクトの描画
 *
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_UtilDraw( void );

//--------------------------------------------------------------------------------------------
/**
 * ３Ｄオブジェクトの回転行列の作成
 *
 * @param	rotSrc	計算前の回転ベクトルポインタ
 * @param	rotDst	計算後の回転行列格納ポインタ
 *
 * この関数等を使用し、オブジェクト毎に適切な回転行列を作成したものを、描画に流す。
 */
//--------------------------------------------------------------------------------------------
// Ｘ→Ｙ→Ｚの順番で計算
extern void GFL_G3D_UtilObjDrawRotateCalcXY( VecFx32* rotSrc, MtxFx33* rotDst );

// Ｘ→Ｙ→Ｚの順番で計算（相対）
extern void GFL_G3D_UtilObjDrawRotateCalcXY_Rev( VecFx32* rotSrc, MtxFx33* rotDst );

// Ｙ→Ｘ→Ｚの順番で計算
extern void GFL_G3D_UtilObjDrawRotateCalcYX( VecFx32* rotSrc, MtxFx33* rotDst );

// Ｙ→Ｘ→Ｚの順番で計算（相対）
extern void GFL_G3D_UtilObjDrawRotateCalcYX_Rev( VecFx32* rotSrc, MtxFx33* rotDst );







