//=============================================================================================
/**
 * @file	g3d_light.h
 * @brief	ライト設定
 * @date	
 */
//=============================================================================================
#ifndef _G3D_LIGHT_H_
#define _G3D_LIGHT_H_

//=============================================================================================
//	型宣言
//=============================================================================================
typedef struct _GFL_G3D_LIGHTING	GFL_G3D_LIGHTING;

//=============================================================================================
/**
 *
 *
 * 管理システム
 *
 *
 */
//=============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * ライト作成
 *
 * @param	num			使用ライトナンバー
 * @param	color		ライトの色
 * @param	vec			ライト方向ベクトル
 *
 * @return	g3Dlight	ライトハンドル
 */
//--------------------------------------------------------------------------------------------
extern GFL_G3D_LIGHTING*
	GFL_G3D_LightCreate
		( const u16 num, const u16 color, const VecFx16* vec, HEAPID heapID );

//--------------------------------------------------------------------------------------------
/**
 * カメラ破棄
 *
 * @param	g3Dlight	ライトハンドル
 */
//--------------------------------------------------------------------------------------------
extern void
	GFL_G3D_LightDelete
		( GFL_G3D_LIGHTING* g3Dlight );

//--------------------------------------------------------------------------------------------
/**
 * ライト反映
 *
 * @param	g3Dlight	ライトハンドル
 */
//--------------------------------------------------------------------------------------------
extern void
	GFL_G3D_LightSwitching
		( GFL_G3D_LIGHTING* g3Dlight );

//--------------------------------------------------------------------------------------------
/**
 * ライト方向の取得と変更
 *
 * @param	g3Dlight	ライトハンドル
 * @param	vec			ライトベクトルの格納もしくは参照ワークポインタ	
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_LightVecGet( GFL_G3D_LIGHTING* g3Dlight, VecFx16* vec );
extern void GFL_G3D_LightVecSet( GFL_G3D_LIGHTING* g3Dlight, VecFx16* vec );

//--------------------------------------------------------------------------------------------
/**
 * カメラ色の取得と変更
 *
 * @param	g3Dlight	ライトハンドル
 * @param	color		ライト色の格納もしくは参照ワークポインタ	
 */
//--------------------------------------------------------------------------------------------
extern void GFL_G3D_LightColorGet( GFL_G3D_LIGHTING* g3Dlight, u16* color );
extern void GFL_G3D_LightColorSet( GFL_G3D_LIGHTING* g3Dlight, u16* color );

#endif


