//=============================================================================================
/**
 * @file	textprint.h
 * @brief	ビットマップ文字列表示用システム
 * 
 */
//=============================================================================================
#include "gflib.h"

#ifndef __TEXTPRINT_H__
#define __TEXTPRINT_H__

#include "systemfont.h"
#ifdef __cplusplus
extern "C" {
#endif

//------------------------------------------------------------------
/**
 * 描画モード定義
 */
//------------------------------------------------------------------
enum{
	GFL_TEXT_WRITE_16 = 0,
	GFL_TEXT_WRITE_256,
};

//------------------------------------------------------------------
/**
 * 描画引数用構造体
 */
//------------------------------------------------------------------
typedef struct {
	GFL_BMP_DATA*	bmp;
	u16				writex;
	u16				writey;
	u8				spacex;
	u8				spacey;
	u8				colorF:4;
	u8				colorB:4;
	u8				mode;
}GFL_TEXT_PRINTPARAM;

//------------------------------------------------------------------
/**
 *
 * 初期化
 *
 */
//------------------------------------------------------------------
void
	GFL_TEXT_CreateSystem
		( const char* fontDataPath );

//------------------------------------------------------------------
/**
 *
 * 終了
 *
 */
//------------------------------------------------------------------
void
	GFL_TEXT_DeleteSystem
		( void );

//------------------------------------------------------------------
/**
 * ビットマップの内部CGX領域に文字を描画する(STRBUF)
 *
 * @param   text		文字列
 * @param   param		描画用パラメータ
 */
//------------------------------------------------------------------
void
	GFL_TEXT_Print
		( const STRBUF* text, GFL_TEXT_PRINTPARAM* param );

//------------------------------------------------------------------
/**
 * ビットマップの内部CGX領域に文字を描画する(STRCODE)
 *
 * @param   textcode	文字列
 * @param   param		描画用パラメータ
 */
//------------------------------------------------------------------
void
	GFL_TEXT_PrintCode
		( const STRCODE* textcode, GFL_TEXT_PRINTPARAM* param );

//------------------------------------------------------------------
/**
 * ビットマップの内部CGX領域に文字を描画する(SjisCode)
 *
 * @param   textcode	文字列
 * @param   param		描画用パラメータ
 */
//------------------------------------------------------------------
void
	GFL_TEXT_PrintSjisCode
		( const char* textcode, GFL_TEXT_PRINTPARAM* param );

#ifdef __cplusplus
}/* extern "C" */
#endif

#endif


