//=============================================================================
/**
 * @file	dwc_rapcommon.h
 * @brief	Wi-Fiデバイスとのアクセス関数 汎用の処理
 * @author	GAME FREAK Inc.
 * @date    2007.2.20
 */
//=============================================================================


#ifndef __DWC_RAPCOMMON_H__
#define __DWC_RAPCOMMON_H__

#include "wifilist.h"


//==============================================================================
/**
 * DWCライブラリ初期化
 * @param   WIFI_LIST  ユーザーデータがない場合作成
 * @retval  DS本体に保存するユーザIDのチェック・作成結果。
 */
//==============================================================================
extern int mydwc_init(int heapID);

//==============================================================================
/**
 * DWC  UserDataを作る
 * @param   WIFI_LIST  ユーザーデータがない場合作成
 * @retval  DS本体に保存するユーザIDのチェック・作成結果。
 */
//==============================================================================
extern void mydwc_createUserData( WIFI_LIST *pWifiList );


//==============================================================================
/**
 * 自分のGSIDを取得する
 * @param   WIFI_LIST  
 * @retval  ０と－１は失敗   正の値は成功
 */
//==============================================================================

extern int mydwc_getMyGSID(WIFI_LIST *pWifiList);

//==============================================================================
/**
 * 自分のGSIDが正しいのか検査する
 * @param   SAVEDATA*  
 * @retval  TRUEが成功
 */
//==============================================================================
#if _SAVE_PROGRAM
extern BOOL mydwc_checkMyGSID(SAVEDATA *pSV);
#endif //_SAVE_PROGRAM

#endif //

