//=============================================================================
/**
 * @file	dwc_rapinitialize.h
 * @brief	Wi-Fiデバイスとのアクセス関数 起動時の処理
 * @author	GAME FREAK Inc.
 * @date    2006.12.5
 */
//=============================================================================


#ifndef __DWC_RAPINITIALIZE_H__
#define __DWC_RAPINITIALIZE_H__

//==============================================================================
/**
 * @brief   Wi-Fi接続初期化 初期化時に呼び出しておく必要がある
 * @param   heapID  メモリ領域
 * @retval  none
 */
//==============================================================================
extern void GFL_NET_startWiFi( int heapID );

#endif //__DWC_RAPINITIALIZE_H__

