//============================================================================================
/**
 * @file	zonedata.h
 * @brief	ゾーン毎データへのアクセス
 * @author	tamada GAME FREAK inc.
 * @date	2008.11.12
 */
//============================================================================================
#pragma once


//------------------------------------------------------------------
/**
 * @brief	ゾーン名データの最大長（デバッグ用）
 */
//------------------------------------------------------------------
#define	ZONEDATA_NAME_LENGTH	(16)

//------------------------------------------------------------------
/**
 * @brief	ゾーン名データの取得
 * @param	heapID		作業用ヒープの指定
 * @param	buffer		名前を取得するためのバッファ
 * @param	zoneid		取得するゾーンの名前
 */
//------------------------------------------------------------------
extern void ZONEDATA_GetZoneName(HEAPID heapID, char * buffer, u16 zoneid);


//------------------------------------------------------------------
//------------------------------------------------------------------
extern const char * ZONEDATA_GetAllZoneName(HEAPID heapID);

//------------------------------------------------------------------
/**
 * @brief	ゾーンの最大数の取得
 * @return	u16	最大数
 */
//------------------------------------------------------------------
extern u16 ZONEDATA_GetZoneIDMax(void);
//------------------------------------------------------------------
/**
 * @brief	マトリックス指定の取得
 * @param	zone_id	ゾーン指定ID
 * @return	u16	マトリックス指定値
 */
//------------------------------------------------------------------
extern u16 ZONEDATA_GetMatrixID(u16 zone_id);
//------------------------------------------------------------------
/**
 * @brief	エリア指定の取得
 * @param	zone_id	ゾーン指定ID
 * @return	u16	エリア指定値
 */
//------------------------------------------------------------------
extern u16 ZONEDATA_GetAreaID(u16 zone_id);
//------------------------------------------------------------------
/**
 * @brief	マップ構造指定の取得
 * @param	zone_id	ゾーン指定ID
 * @return	u16	マップ構造指定値
 */
//------------------------------------------------------------------
extern u16 ZONEDATA_GetMapRscID(u16 zone_id);

