//======================================================================
/**
 * @file	gym_elec_local_def.h
 * @brief	数値定義ファイル
 * @note	このファイルはコンバーターから出力されます
 *
 */
//======================================================================

//基準プラットフォーム以外の停車フレーム定義
//※レール3
#define R_STOP_FRM1 (40)	//レール1
#define R_STOP_FRM2 (65)	//レール2
#define R_STOP_FRM4 (124)	//レール4
#define R_STOP_FRM6 (126)	//レール6
#define R_STOP_FRM8 (138)	//レール8
//カプセルごとのレール移動アニメ共通部分フレーム（アニメデータ依存）
#define COMM_FRM1 (13)
#define COMM_FRM2 (105)
#define COMM_FRM3 (93)
#define COMM_FRM4 (70)
