//============================================================================================
/**
 * @brief	box_savedata.h
 * @brief	ボックスセーブデータ系
 * @date	2008.11.07
 * @author	ariizumi
 */
//============================================================================================

#ifndef	__BOX_SAVEDATA_H__
#define	__BOX_SAVEDATA_H__

//============================================================================================
//============================================================================================
//---------------------------------------------------------------------------
/**
 * @brief	ボックスデータの不完全型定義
 */
//---------------------------------------------------------------------------
typedef struct _BOX_DATA BOX_DATA;

extern u32	BOXDAT_GetTotalSize(void);
extern void	BOXDAT_Init(BOX_DATA *boxData);

extern void BOXDAT_SetPPPData_Tray( u8 trayIdx , void *dataPtr , BOX_DATA *boxData );

#endif //__BOX_SAVEDATA_H__
