//======================================================================
/**
 * @file	bsubway_savedata_def.h
 * @bfief	バトルサブウェイ　セーブデータ関連定数定義
 * @author iwasawa
 * @date	07.05.28
 * @note プラチナより移植 kagaya
 */
//======================================================================
#ifndef	__SUBWAY_SAVEDATA_DEF_H__
#define __SUBWAY_SAVEDATA_DEF_H__

//======================================================================
//  define
//======================================================================

#endif //__SUBWAY_SAVEDATA_DEF_H__
