//============================================================================
/**
 *
 *	@file		myitem_savedata_def.h
 *	@brief  手持ちアイテム スクリプトからも参照する定義
 *	@author		hosaka genya
 *	@data		2009.10.09
 *	@note   myitem_savededa.h から切り出し
 *	@note   アセンブラで読み込むためenum禁止
 *
 */
//============================================================================
#pragma once

//=============================================================================
/**
 *								定数定義
 */
//=============================================================================
//--------------------------------------------------------------
//	この定義はitemconv_dp の datamake.cppと同じでなければいけない 2009.07.21
//--------------------------------------------------------------
// ポケットID
#define	BAG_POKE_NORMAL		( 0 )		// 道具
#define	BAG_POKE_DRUG		( 1 )		// 薬
#define	BAG_POKE_WAZA		( 2 )		// 技マシン
#define	BAG_POKE_NUTS		( 3 )		// 木の実
#define	BAG_POKE_EVENT		( 4 )		// 大切な物

#define	BAG_POKE_MAX		( 5 )		// ポケット最大数

#define	BATTLE_BAG_POKE_MAX		( 4 )		// バトルバッグのポケット最大数

