//==============================================================================
/**
 * @file    save_control_intr.h
 * @brief   イントロ画面用、中断機能付きセーブシステム
 * @author  matsuda
 * @date    2009.12.10(木)
 */
//==============================================================================
#pragma once

#include "savedata/save_control.h"


//==============================================================================
//  型定義
//==============================================================================
///イントロ画面用セーブシステムの型
typedef struct _INTR_SAVE_CONTROL INTR_SAVE_CONTROL;




//==============================================================================
//  外部関数宣言
//==============================================================================
//==================================================================
/**
 * イントロ画面用、中断機能付きセーブシステム作成
 *
 * @param   heap_id		
 * @param   ctrl		
 *
 * @retval  INTR_SAVE_CONTROL *		
 */
//==================================================================
extern INTR_SAVE_CONTROL * IntrSave_Init(HEAPID heap_id, SAVE_CONTROL_WORK *ctrl);

//==================================================================
/**
 * イントロ画面用、中断機能付きセーブシステム削除
 *
 * @param   isc		
 */
//==================================================================
extern void IntrSave_Exit(INTR_SAVE_CONTROL *isc);

//==================================================================
/**
 * セーブ開始
 *
 * @param   isc		
 */
//==================================================================
extern void IntrSave_Start(INTR_SAVE_CONTROL *isc);

//==================================================================
/**
 * セーブメイン
 *
 * @param   isc		
 *
 * @retval  SAVE_RESULT		
 */
//==================================================================
extern SAVE_RESULT IntrSave_Main(INTR_SAVE_CONTROL *isc);

//==================================================================
/**
 * セーブ中断リクエスト
 *
 * @param   isc		
 *
 * 実際に中断されたかはIntrSave_CheckSuspend関数で監視してください
 */
//==================================================================
extern void IntrSave_ReqSuspend(INTR_SAVE_CONTROL *isc);

//==================================================================
/**
 * 中断していたセーブを再開します
 *
 * @param   isc		
 */
//==================================================================
extern void IntrSave_Resume(INTR_SAVE_CONTROL *isc);

//==================================================================
/**
 * セーブを中断しているか調べる
 *
 * @param   isc		
 *
 * @retval  BOOL		TRUE:中断している(カードアクセス可能)
 * @retval  BOOL		FALSE:中断していない(カードアクセス禁止)
 */
//==================================================================
extern BOOL IntrSave_CheckSuspend(INTR_SAVE_CONTROL *isc);

//==================================================================
/**
 * 第1段階のセーブが完了後、MYSTATUSに性別、名前をセットした後、
 * この関数を呼び出してください
 * MYSTATUSセット完了後の2度目のセーブを行います
 *
 * @param   isc		
 */
//==================================================================
extern void IntrSave_ReqMyStatusSave(INTR_SAVE_CONTROL *isc);

//==================================================================
/**
 * 全てのセーブが完了しているか調べる
 *
 * @param   isc		
 *
 * @retval  BOOL		TRUE:全てのセーブが完了している
 * @retval  BOOL		FALSE:まだセーブが残っている
 */
//==================================================================
extern BOOL IntrSave_CheckAllSaveEnd(INTR_SAVE_CONTROL *isc);
