//==============================================================================
/**
 * @file    symbol_save_field.h
 * @brief   シンボルエンカウント用セーブデータでフィールド上でしか使用しないもの(FIELDMAPオーバーレイに配置)
 * @author  matsuda
 * @date    2010.03.06(土)
 */
//==============================================================================
#pragma once


//==============================================================================
//  外部関数宣言
//==============================================================================
extern BOOL SymbolSave_Field_MoveAuto( SYMBOL_SAVE_WORK *symbol_save, u32 no );

