//==============================================================================
/**
 * @file	test_savedata.h
 * @brief	テスト用セーブ
 * @author	matsuda
 * @date	2008.08.28(木)
 */
//==============================================================================
#ifndef __TEST_SAVEDATA_H__
#define __TEST_SAVEDATA_H__


//==============================================================================
//	外部関数宣言
//==============================================================================
extern u32	DebugMatsuSave_GetWorkSize(void);
extern void DebugMatsuSave_Init(int *work);


#endif	//__TEST_SAVEDATA_H__
