//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		ybtn_reg.h
 *	@brief	Yボタン登録セーブデータ
 *	@author	Toru=Nagihashi
 *	@date		2009.10.20
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

#include "savedata/save_control.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================
//-------------------------------------
///	Yボタン登録箇所
//=====================================
typedef enum
{
	YBTN_REG_JITENSYA,
	YBTN_REG_TSURIZAO,
	YBTN_REG_TOWNMAP,
	YBTN_REG_BAG_WAZAMACHINE,
	YBTN_REG_PSTATUS_WAZA,

	YBTN_REG_MAX,
	YBTN_REG_NULL	= YBTN_REG_MAX,	//データなし
} YBTN_REG_TYPE;

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================
//-------------------------------------
///	未分類セーブデータ不完全型
//=====================================
typedef struct _YBTN_REG YBTN_REG;

//=============================================================================
/**
 *					外部参照
*/
//=============================================================================
//----------------------------------------------------------
//セーブデータシステムに依存する関数
//----------------------------------------------------------
extern int YBTN_REG_GetWorkSize( void );
extern void YBTN_REG_Init( YBTN_REG *p_msc );

//----------------------------------------------------------
//セーブデータ取得のための関数
//----------------------------------------------------------
extern const YBTN_REG * SaveData_GetYBtnRegConst( const SAVE_CONTROL_WORK * cp_sv );
extern YBTN_REG * SaveData_GetYBtnReg( SAVE_CONTROL_WORK * p_sv );

//----------------------------------------------------------
//各アプリ内での、Yボタン登録関数
//----------------------------------------------------------
extern void YBTN_REG_SetRegister( YBTN_REG *p_misc, YBTN_REG_TYPE type, BOOL is_on );
extern BOOL YBTN_REG_GetRegister( const YBTN_REG *cp_misc, YBTN_REG_TYPE type );

//----------------------------------------------------------
//Yボタンメニューで取得、操作する関数
//----------------------------------------------------------
extern YBTN_REG_TYPE YBTN_REG_GetType( const YBTN_REG *cp_misc, u8 idx );
extern void YBTN_REG_Insert( YBTN_REG *p_misc, YBTN_REG_TYPE type, u8 insert_idx );
