//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		debug_nagihashi.h
 *	@brief  デバッグ用便利関数群
 *	@author	Toru=Nagihashi
 *	@date		2010.02.13
 *	@note   オーバーレイを無視するためにヘッダに全て記述。
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#pragma once

//ライブラリ
#include <gflib.h>

//モジュール
#include "debug/debug_str_conv.h"

//=============================================================================
/**
 *					定数宣言
*/
//=============================================================================

//=============================================================================
/**
 *					構造体宣言
*/
//=============================================================================

//=============================================================================
/**
 *					外部公開
*/
//=============================================================================
//----------------------------------------------------------------------------
/**
 *	@brief  STRBUFの中身を表示（漢字は無理）
 *
 *	@param	const STRBUF *cp_str STRBUF
 */
//-----------------------------------------------------------------------------
static inline void DEBUG_STRBUF_Print( const STRBUF *cp_str )
{

  const int len     = GFL_STR_GetBufferLength(cp_str);
  const STRCODE *cp_code = GFL_STR_GetStringCodePointer( cp_str );

  { 
    int i;
    char str[3] = {0};
    for( i = 0; i < len; i++ )
    {
      DEB_STR_CONV_StrcodeToSjis( &cp_code[i] , str , 1 );
      NAGI_Printf( "%s ", str );
    }
    NAGI_Printf("\n");
  }

}

//=============================================================================
/**
 *					処理時間計算マクロ
*/
//=============================================================================
static OSTick s_DUN_TICK_DRAW_start;
#define DEBUG_TICK_PrintStart  (s_DUN_TICK_DRAW_start = OS_GetTick())
#define DEBUG_TICK_PrintEnd    NAGI_Printf("line[%d] time=%dms\n",__LINE__,OS_TicksToMicroSeconds(OS_GetTick() - s_DUN_TICK_DRAW_start) )
