//==============================================================================
/**
 * @file	ui.c
 * @brief	ユーザーインターフェイス管理
 * @author	GAME FREAK Inc.
 * @date	2005.07.29
 */
//==============================================================================

#include "gflib.h" 
#include "ui_def.h" 

//==============================================================================
//
//			定義、関数宣言
//
//==============================================================================


//------------------------------------------------------------------
/**
 * @brief	_UI_SYS 型宣言
 * ユーザーインターフェイス情報
 */
//------------------------------------------------------------------
struct _UI_SYS {
    UI_TPSYS* pTP;         ///< タッチパネル管理構造体
    UI_KEYSYS* pKey;       ///< キー管理構造体
	u8 AgbCasetteVersion;  ///< 差し込まれているAgbカーットリッジのバージョン（GBAポケモンが差し込まれている時のみ）
	u8 DontSleep;          ///< スリープ状態にしてはいけない場合BITがたっている 大丈夫な場合0
	u8 DontSoftReset;      ///< ソフトリセットしたくない場合BITがたっている 大丈夫な場合0
	u8 DS_Boot_Flag;       ///< 
};


//==============================================================================
//
//			関数
//
//==============================================================================

//==============================================================================
/**
 * UI初期化
 * @param   heapID    ヒープ確保を行うID
 * @return  UIHandle  workハンドル
 */
//==============================================================================

//初期化
UIHandle* GFL_UI_sysInit(int heapID)
{

}

//==============================================================================
/**
 * UI初期化
 * @param   heapID    ヒープ確保を行うID
 * @return  UIHandle  workハンドル
 */
//==============================================================================

//初期化
UIHandle* GFL_UI_sysInit(int heapID)
{

}

//==============================================================================
/**
 * UI初期化
 * @param   heapID    ヒープ確保を行うID
 * @return  UIHandle  workハンドル
 */
//==============================================================================

//初期化
UIHandle* GFL_UI_sysInit(int heapID)
{

}







/*---------------------------------------------------------------------------*
  @brief	ＡＧＢカートリッジ初期化
 *---------------------------------------------------------------------------*/
void sys_InitAgbCasetteVer(int version)
{
	sys.AgbCasetteVersion = version;
}

/*---------------------------------------------------------------------------*
  @brief	スリープ状態を禁止する
 *---------------------------------------------------------------------------*/
void sys_SleepNG(u8 sleepTypeBit)
{
	sys.DontSleep |= sleepTypeBit;
}

/*---------------------------------------------------------------------------*
  @brief	スリープ状態を許可する
 *---------------------------------------------------------------------------*/
void sys_SleepOK(u8 sleepTypeBit)
{
	sys.DontSleep &= ~(sleepTypeBit);
}

/*---------------------------------------------------------------------------*
  @brief	ソフトウエアリセット状態を禁止する
 *---------------------------------------------------------------------------*/
void sys_SoftResetNG(u8 softResetBit)
{
	sys.DontSoftReset |= softResetBit;
}

/*---------------------------------------------------------------------------*
  @brief	ソフトウエアリセット状態を許可する
 *---------------------------------------------------------------------------*/
void sys_SoftResetOK(u8 softResetBit)
{
	sys.DontSoftReset &= ~(softResetBit);
}


//------------------------------------------------------------------
/**
 * @fn      タッチパネル管理構造体を引き出す グループ内関数
 * @param   pUI		ユーザーインターフェイス管理構造体
 * @return  UI_TPSYS*		タッチパネル管理構造体
 */
//------------------------------------------------------------------

UI_TPSYS* _UI_GetTPSYS(UI_SYS* pUI)
{
}

pTP;         ///< タッチパネル管理構造体
    UI_KEYSYS* pKey;       ///< キー管理構造体



