//*****************************************************************************
/**
 * @file	ui_def.h
 * @brief	ユーザーインターフェイス用グループ内定義
 * @author	k.ohno
 * @date	2006.11.16
 */
//*****************************************************************************

#ifndef __UI_DEF_H__
#define	__UI_DEF_H__

//------------------------------------------------------------------
/**
 * @brief	定義
 */
//------------------------------------------------------------------
typedef struct _UI_TPSYS  UI_TPSYS;   ///< タッチパネル構造体定義
typedef struct _UI_KEYSYS  UI_KEYSYS; ///< キー構造体定義

//------------------------------------------------------------------
/**
 * @brief      タッチパネル管理構造体を引き出す グループ内関数
 * @param   pUI		ユーザーインターフェイス管理構造体
 * @return  タッチパネル管理構造体
 */
//------------------------------------------------------------------
extern UI_TPSYS* _UI_GetTPSYS(const UISYS* pUI);

//------------------------------------------------------------------
/**
 * @brief   キー管理構造体を引き出す グループ内関数
 * @param   pUI		ユーザーインターフェイス管理構造体
 * @return  キー管理構造体
 */
//------------------------------------------------------------------
extern UI_KEYSYS* _UI_GetKEYSYS(const UISYS* pUI);

//==============================================================================
/**
 * @brief  キー初期化
 * @param   heapID    ヒープ確保を行うID
 * @return  UI_KEYSYS  キーシステムワーク
 */
//==============================================================================
extern UI_KEYSYS* GFL_UI_Key_sysInit(const int heapID);

//==============================================================================
/**
 * @brief キー読み取り処理
 * @param[in,out]   pUI     ユーザーインターフェイスハンドルのポインタ
 * @return  none
 */
//==============================================================================
extern void GFL_UI_Key_sysMain(UISYS* pUI);

//==============================================================================
/**
 * @brief キー終了処理
 * @param[in,out]   pUI     ユーザーインターフェイスハンドルのポインタ
 * @return  none
 */
//==============================================================================
extern void GFL_UI_Key_sysEnd(UISYS* pUI);


//==============================================================================
/**
 * @brief  タッチパネル初期化
 * @param   heapID    ヒープ確保を行うID
 * @return  UI_TPSYS  タッチパネルシステムワーク
 */
//==============================================================================
extern UI_TPSYS* GFL_UI_TP_sysInit(const int heapID);

//==============================================================================
/**
 * @brief タッチパネル読み取り処理
 * @param[in,out]   pUI     ユーザーインターフェイスハンドルのポインタ
 * @return  none
 */
//==============================================================================
extern void GFL_UI_TP_sysMain(UISYS* pUI);

//==============================================================================
/**
 * @brief タッチパネル終了処理
 * @param[in,out]   pUI     ユーザーインターフェイスハンドルのポインタ
 * @return  none
 */
//==============================================================================
extern void GFL_UI_TP_sysEnd(UISYS* pUI);

#endif  //__UI_DEF_H__

