#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================
/**
 * @file	dwc_rapcommon.h
 * @brief	Wi-Fiデバイスとのアクセス関数 汎用の処理
 * @author	GAME FREAK Inc.
 * @date    2007.2.20
 */
//=============================================================================


#pragma once

#if GFL_NET_WIFI


//==============================================================================
/**
 * DWCライブラリ初期化
 * @param   GFL_WIFI_FRIENDLIST  ユーザーデータがない場合作成
 * @retval  DS本体に保存するユーザIDのチェック・作成結果。
 */
//==============================================================================
extern int OLDmydwc_initdwc(int heapID);
//extern int OLDmydwc_init(int heapID);

//==============================================================================
/**
 * @brief   DWC  UserDataを作る
 * @param   DWCUserData  ユーザーデータがない場合作成
 * @retval  none
 */
//==============================================================================
//extern void OLDmydwc_createUserData( DWCUserData *userdata );

//==============================================================================
/**
 * 自分のGSIDを取得する
 * @param   GFL_WIFI_FRIENDLIST  
 * @retval  ０と－１は失敗   正の値は成功
 */
//==============================================================================

//extern int OLDmydwc_getMyGSID(void);

//==============================================================================
/**
 * 自分のGSIDが正しいのか検査する
 * @retval  TRUEが成功
 */
//==============================================================================
//extern BOOL OLDmydwc_checkMyGSID(void);

#endif //

#ifdef __cplusplus
} /* extern "C" */
#endif
