/*=============================================================================
/*!

	@file	npMemory.h

	@brief	メモリ管理定義ファイル<br>
			Copyright (c) 2005 Polygon Magic, Inc.
	
	@author	ka2

	$Revision: 1.3 $
	$Date: 2006/03/10 10:35:08 $

*//*=========================================================================*/
#ifndef	NPMEMORY_H
#define	NPMEMORY_H

#include <nitro/mi.h>

#ifdef __cplusplus
extern "C" {
#endif

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	include
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	define
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	enum
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	struct
//-----------------------------------------------------------------------------
typedef	npVOID* ( NP_APIENTRY *npHEAPALLOCFUNC )( npSIZE nSize );
typedef npVOID	( NP_APIENTRY *npHEAPFREEFUNC  )( npVOID );

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	global variable
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	global function
//-----------------------------------------------------------------------------
//#define	npAllocHeap( size )
//#define	npFreeHeap( buf )

/*!

	@brief	指定されたメモリブロックに値 0 を書き込む

	@param	dst		メモリブロック
	@param	size	メモリブロックのサイズ

*/
#define npZeroMemory(dst, size)			MI_CpuClear8(dst, size)

/*!

	@brief	Copies characters between buffers.

	@param	dst		New buffer 
	@param	src		Buffer to copy from 
	@param	size	Number of characters to copy 

*/
#define npCopyMemory(dst, src, size)	MI_CpuCopy8((void *)src, (void *)dst, size)

/*!

	@brief	Sets buffers to a specified character.

	@param	dst		Pointer to destination 
	@param	c		Character to set 
	@param	size	Number of characters 

*/
#define npFillMemory(dst, c, size)		MI_CpuFill8(dst, c, size)

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */

#ifdef __cplusplus
}
#endif

#endif	/* NPMEMORY_H */
