/*=============================================================================
/*!

	@file	npTextureLibrary.h

	@brief	テクスチャライブラリ(マネージャ)定義ファイル
	
	@author	ka2<br>
			Copyright (c) 2005 Polygon Magic, Inc.

	$Revision: 1.4 $
	$Date: 2006/03/13 06:13:20 $

*//*=========================================================================*/
#ifndef	NPTEXTURELIBRARY_H
#define	NPTEXTURELIBRARY_H

/*! @name	C リンケージ外対応 */
//!@{

#include "core/npContext.h"
#include "core/npTexture.h"

//!@}

#ifdef __cplusplus
extern "C" {
#endif

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	include
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	define
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	enum
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	struct
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	global variable
//-----------------------------------------------------------------------------

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */
//-----------------------------------------------------------------------------
//	global function
//-----------------------------------------------------------------------------
/*!

	テクスチャライブラリで必要なメモリサイズを取得する

	@param	nNum	使用するテクスチャ枚数

	@return	必要なメモリサイズ

*/
#define	npCheckTextureLibraryHeapSize( nNum )	( sizeof( npTEXTURE ) * ( nNum ) )

/*!

	テクスチャライブラリの初期化

	@param	pContext	レンダリングコンテキスト
	@param	pBuf		テクスチャライブラリに渡すバッファ
	@param	nSize		上記のバッファのサイズ( Byte 単位 )

	@return	エラーコード

	@note	レンダリングコンテキストごとにテクスチャライブラリを<br>
			生成する必要がある
	@note	テクスチャを使用する前に必ず呼ばなければならない

*/
NP_API npERROR NP_APIENTRY npInitTextureLibrary( 
	npCONTEXT* 	pContext,
	npVOID*		pBuf,
	npSIZE		nSize
);

/*!

	テクスチャライブラリの終了処理

	@param	pContext	レンダリングコンテキスト

	@note	テクスチャライブラリを終了する時は必ず呼び出す
	@note	登録されているテクスチャバッファを全て開放する

*/
NP_API npVOID NP_APIENTRY npExitTextureLibrary( npCONTEXT* pContext );

/*!

	レンダリングコンテキストに登録されているテクスチャオブジェクトを全て開放する

	@param	pContext	レンダリングコンテキスト

	@note	リファレンスカウンタを無視して開放する

*/
NP_API npVOID NP_APIENTRY npClearTextureLibrary( npCONTEXT* pContext );

/*!

	名前に一致するテクスチャオブジェクトを取得する

	@param	pContext	レンダリングコンテキスト
	@param	szName		検索するテクスチャ名

	@return	ユニークな ID に一致するテクスチャオブジェクト

	@note	戻り値が NP_NULL なら登録されているテクスチャオブジェクトが存在しない

*/
NP_API npTEXTURE* NP_APIENTRY npFindTextureLibrary(
	npCONTEXT*	pContext,
	npCHAR*		szName 
);

/* -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- */

#ifdef __cplusplus
}
#endif

#endif	/* NPTEXTURELIBRARY_H */
